<abi-corpus version='2.1' soname='libspdk_accel.so.13.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_util.so.7.0'/>
    <dependency name='libspdk_thread.so.8.1'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libspdk_jsonrpc.so.5.1'/>
    <dependency name='libspdk_dma.so.3.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_accel_alloc_sequence_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_decrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_encrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_accel_module_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_module_list_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_put_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_continue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_first_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_next_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_reverse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_set_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_set_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_decrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_dualcast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_encrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_xor' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_task_complete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='accel.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='spdk_accel_cipher' filepath='accel.h' line='50' column='1' id='682178d1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_ACCEL_CIPHER_AES_CBC' value='0'/>
      <enumerator name='SPDK_ACCEL_CIPHER_AES_XTS' value='1'/>
    </enum-decl>
    <enum-decl name='spdk_accel_crypto_tweak_mode' filepath='accel_module.h' line='24' column='1' id='404aa5de'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_ACCEL_CRYPTO_TWEAK_MODE_SIMPLE_LBA' value='0'/>
      <enumerator name='SPDK_ACCEL_CRYPTO_TWEAK_MODE_JOIN_NEG_LBA_WITH_LBA' value='1'/>
      <enumerator name='SPDK_ACCEL_CRYPTO_TWEAK_MODE_INCR_512_FULL_LBA' value='2'/>
      <enumerator name='SPDK_ACCEL_CRYPTO_TWEAK_MODE_INCR_512_UPPER_LBA' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_accel_opcode' filepath='accel.h' line='35' column='1' id='ad747ae4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_ACCEL_OPC_COPY' value='0'/>
      <enumerator name='SPDK_ACCEL_OPC_FILL' value='1'/>
      <enumerator name='SPDK_ACCEL_OPC_DUALCAST' value='2'/>
      <enumerator name='SPDK_ACCEL_OPC_COMPARE' value='3'/>
      <enumerator name='SPDK_ACCEL_OPC_CRC32C' value='4'/>
      <enumerator name='SPDK_ACCEL_OPC_COPY_CRC32C' value='5'/>
      <enumerator name='SPDK_ACCEL_OPC_COMPRESS' value='6'/>
      <enumerator name='SPDK_ACCEL_OPC_DECOMPRESS' value='7'/>
      <enumerator name='SPDK_ACCEL_OPC_ENCRYPT' value='8'/>
      <enumerator name='SPDK_ACCEL_OPC_DECRYPT' value='9'/>
      <enumerator name='SPDK_ACCEL_OPC_XOR' value='10'/>
      <enumerator name='SPDK_ACCEL_OPC_LAST' value='11'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='768' id='c6867c77'>
      <subrange length='6' type-id='f0981eeb' id='52fa524b'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='95e97e5f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_bounce_buffer' size-in-bits='384' is-struct='yes' visibility='default' filepath='accel_module.h' line='60' column='1' id='213755d0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default' filepath='accel_module.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='orig_iovcnt' type-id='8f92235e' visibility='default' filepath='accel_module.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='orig_domain' type-id='e5ecc906' visibility='default' filepath='accel_module.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='orig_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='accel_module.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_crypto_key' size-in-bits='896' is-struct='yes' visibility='default' filepath='accel_module.h' line='42' column='1' id='7e6118f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='26a90f95' visibility='default' filepath='accel_module.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_size' type-id='b59d7dce' visibility='default' filepath='accel_module.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key2' type-id='26a90f95' visibility='default' filepath='accel_module.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key2_size' type-id='b59d7dce' visibility='default' filepath='accel_module.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cipher' type-id='682178d1' visibility='default' filepath='accel_module.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tweak_mode' type-id='404aa5de' visibility='default' filepath='accel_module.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='module_if' type-id='b78a11b9' visibility='default' filepath='accel_module.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='param' type-id='ee9bdf6b' visibility='default' filepath='accel_module.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='accel_module.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_crypto_key_create_param' size-in-bits='320' is-struct='yes' visibility='default' filepath='accel.h' line='27' column='1' id='ee9bdf6b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='26a90f95' visibility='default' filepath='accel.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hex_key' type-id='26a90f95' visibility='default' filepath='accel.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hex_key2' type-id='26a90f95' visibility='default' filepath='accel.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tweak_mode' type-id='26a90f95' visibility='default' filepath='accel.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key_name' type-id='26a90f95' visibility='default' filepath='accel.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_driver' size-in-bits='384' is-struct='yes' visibility='default' filepath='accel_module.h' line='243' column='1' id='b3dd0cff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='accel_module.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='execute_sequence' type-id='1d08b901' visibility='default' filepath='accel_module.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_io_channel' type-id='94a5300d' visibility='default' filepath='accel_module.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_operation_info' type-id='b1607b55' visibility='default' filepath='accel_module.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='accel_module.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_module_if' size-in-bits='1024' is-struct='yes' visibility='default' filepath='accel_module.h' line='146' column='1' id='c7a04c81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='accel_module.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default' filepath='accel_module.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='module_fini' type-id='b7f9d8e6' visibility='default' filepath='accel_module.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_config_json' type-id='582528d7' visibility='default' filepath='accel_module.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_ctx_size' type-id='0838a534' visibility='default' filepath='accel_module.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='supports_opcode' type-id='8dc19c3f' visibility='default' filepath='accel_module.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_io_channel' type-id='94a5300d' visibility='default' filepath='accel_module.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='submit_tasks' type-id='17aa1e6d' visibility='default' filepath='accel_module.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='crypto_key_init' type-id='d00898aa' visibility='default' filepath='accel_module.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='crypto_key_deinit' type-id='701e506f' visibility='default' filepath='accel_module.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='crypto_supports_tweak_mode' type-id='bb2251e5' visibility='default' filepath='accel_module.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='crypto_supports_cipher' type-id='c2cfdafc' visibility='default' filepath='accel_module.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_memory_domains' type-id='4966e857' visibility='default' filepath='accel_module.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='get_operation_info' type-id='b1607b55' visibility='default' filepath='accel_module.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tailq' type-id='e7f43f74' visibility='default' filepath='accel_module.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_opcode_info' size-in-bits='8' is-struct='yes' visibility='default' filepath='accel_module.h' line='138' column='1' id='0116b8f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='required_alignment' type-id='b96825af' visibility='default' filepath='accel_module.h' line='143' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_opcode_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='accel.h' line='703' column='1' id='9f6466ab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='executed' type-id='9c313c2d' visibility='default' filepath='accel.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='failed' type-id='9c313c2d' visibility='default' filepath='accel.h' line='707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_bytes' type-id='9c313c2d' visibility='default' filepath='accel.h' line='709' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_operation_exec_ctx' size-in-bits='128' is-struct='yes' visibility='default' filepath='accel.h' line='727' column='1' id='ca8df46c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='accel.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='accel.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_opts' size-in-bits='224' is-struct='yes' visibility='default' filepath='accel.h' line='672' column='1' id='77da0a4b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='accel.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='small_cache_size' type-id='8f92235e' visibility='default' filepath='accel.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='large_cache_size' type-id='8f92235e' visibility='default' filepath='accel.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='task_count' type-id='8f92235e' visibility='default' filepath='accel.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sequence_count' type-id='8f92235e' visibility='default' filepath='accel.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_count' type-id='8f92235e' visibility='default' filepath='accel.h' line='684' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_task' size-in-bits='3072' is-struct='yes' visibility='default' filepath='accel_module.h' line='78' column='1' id='a817e78c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='accel_ch' type-id='4d4d5eba' visibility='default' filepath='accel_module.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='seq' type-id='d4aefa7e' visibility='default' filepath='accel_module.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fn' type-id='e2a47d34' visibility='default' filepath='accel_module.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='step_cb_fn' type-id='e7d92aa4' visibility='default' filepath='accel_module.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='step_cb_arg' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='src_domain' type-id='e5ecc906' visibility='default' filepath='accel_module.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='src_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dst_domain' type-id='e5ecc906' visibility='default' filepath='accel_module.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dst_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='accel_module.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nbytes' type-id='9c313c2d' visibility='default' filepath='accel_module.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='iv' type-id='9c313c2d' visibility='default' filepath='accel_module.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='op_code' type-id='b96825af' visibility='default' filepath='accel_module.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1232'>
        <var-decl name='status' type-id='23bd8cb5' visibility='default' filepath='accel_module.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='flags' type-id='95e97e5e' visibility='default' filepath='accel_module.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='link' type-id='e7f43f75' visibility='default' filepath='accel_module.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='seq_link' type-id='e7f43f75' visibility='default' filepath='accel_module.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='aux_iovs' type-id='c6867c77' visibility='default' filepath='accel_module.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='bounce' type-id='e7f43f76' visibility='default' filepath='accel_module.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='91' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='accel_module.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='accel_module.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='132' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='213755d0' visibility='default' filepath='accel_module.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d' type-id='213755d0' visibility='default' filepath='accel_module.h' line='134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='52' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='043cb572' visibility='default' filepath='accel_module.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='03917988' visibility='default' filepath='accel_module.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='274' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2fb8c007' visibility='default' filepath='accel_module.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='4cd686d7' visibility='default' filepath='accel_module.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='223' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b78a11b9' visibility='default' filepath='accel_module.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8159aa69' visibility='default' filepath='accel_module.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='129' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='10ebab0a' visibility='default' filepath='accel_module.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2fe6360' visibility='default' filepath='accel_module.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='95' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='srcs' type-id='63e171df' visibility='default' filepath='accel_module.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cnt' type-id='8f92235e' visibility='default' filepath='accel_module.h' line='97' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int16_t' type-id='95e97e5f' filepath='types.h' line='39' column='1' id='03896e23'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='int16_t' type-id='03896e23' filepath='stdint-intn.h' line='25' column='1' id='23bd8cb5'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_accel_completion_cb' type-id='1ed1e4cd' filepath='accel.h' line='61' column='1' id='e2a47d34'/>
    <typedef-decl name='spdk_accel_fini_cb' type-id='b7f9d8e6' filepath='accel.h' line='68' column='1' id='e5aecfa2'/>
    <typedef-decl name='spdk_accel_sequence_get_buf_cb' type-id='e34b5a87' filepath='accel_module.h' line='293' column='1' id='4208e346'/>
    <typedef-decl name='spdk_accel_step_cb' type-id='b7f9d8e6' filepath='accel.h' line='331' column='1' id='e7d92aa4'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='110' column='1' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='d2' type-id='e7f43f77' visibility='default' filepath='accel_module.h' line='114' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='seed' type-id='8f92235e' visibility='default' filepath='accel_module.h' line='115' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fill_pattern' type-id='9c313c2d' visibility='default' filepath='accel_module.h' line='116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='crypto_key' type-id='043cb572' visibility='default' filepath='accel_module.h' line='117' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='100' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='d' type-id='e7f43f77' visibility='default' filepath='accel_module.h' line='104' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s2' type-id='e7f43f77' visibility='default' filepath='accel_module.h' line='108' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='90' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='s' type-id='e7f43f77' visibility='default' filepath='accel_module.h' line='94' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nsrcs' type-id='e7f43f78' visibility='default' filepath='accel_module.h' line='98' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='accel_module.h' line='119' column='1' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='crc_dst' type-id='90421557' visibility='default' filepath='accel_module.h' line='120' column='1'/>
