<abi-corpus version='2.1' soname='libspdk_sock.so.8.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_jsonrpc.so.5.1'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_net_impl_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_accept' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_connect_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_get_default_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_get_default_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_get_impl_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_get_optimal_sock_group' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_getaddr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_add_sock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_get_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_get_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_poll_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_provide_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_group_remove_sock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_impl_get_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_impl_set_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_is_connected' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_is_ipv4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_is_ipv6' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_listen_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_map_cleanup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_map_find_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_map_insert' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_map_lookup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_map_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_readv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_recv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_recv_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_set_default_impl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_set_recvbuf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_set_recvlowat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_set_sendbuf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_writev_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='sock.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='thread-shared-types.h' line='51' column='1' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='struct_mutex.h' line='22' column='1' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__sock_request_internal' size-in-bits='256' is-struct='yes' visibility='default' filepath='sock.h' line='49' column='1' id='683903f3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='sock.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='curr_list' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset' type-id='8f92235e' visibility='default' filepath='sock.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='is_zcopy' type-id='c894953d' visibility='default' filepath='sock.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_net_impl' size-in-bits='1856' is-struct='yes' visibility='default' filepath='sock.h' line='76' column='1' id='7828460a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='sock.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='sock.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='getaddr' type-id='b9fe6bd8' visibility='default' filepath='sock.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='connect' type-id='98ea3c17' visibility='default' filepath='sock.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='listen' type-id='98ea3c17' visibility='default' filepath='sock.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='accept' type-id='d781846a' visibility='default' filepath='sock.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='close' type-id='ff5e8dca' visibility='default' filepath='sock.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='recv' type-id='a417871e' visibility='default' filepath='sock.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='readv' type-id='da0f7949' visibility='default' filepath='sock.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='writev' type-id='da0f7949' visibility='default' filepath='sock.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='recv_next' type-id='b22ae6ce' visibility='default' filepath='sock.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='writev_async' type-id='9a013802' visibility='default' filepath='sock.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='readv_async' type-id='9a013802' visibility='default' filepath='sock.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='flush' type-id='ff5e8dca' visibility='default' filepath='sock.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='set_recvlowat' type-id='2969e6b1' visibility='default' filepath='sock.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='set_recvbuf' type-id='2969e6b1' visibility='default' filepath='sock.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_sendbuf' type-id='2969e6b1' visibility='default' filepath='sock.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_ipv6' type-id='e0b2e255' visibility='default' filepath='sock.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='is_ipv4' type-id='e0b2e255' visibility='default' filepath='sock.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='is_connected' type-id='e0b2e255' visibility='default' filepath='sock.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='group_impl_get_optimal' type-id='846bb243' visibility='default' filepath='sock.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='group_impl_create' type-id='e75ea894' visibility='default' filepath='sock.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='group_impl_add_sock' type-id='4cbbe7ce' visibility='default' filepath='sock.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='group_impl_remove_sock' type-id='4cbbe7ce' visibility='default' filepath='sock.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='group_impl_poll' type-id='d5e7854d' visibility='default' filepath='sock.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='group_impl_close' type-id='bdf450ad' visibility='default' filepath='sock.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='get_opts' type-id='2c5bde4e' visibility='default' filepath='sock.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='set_opts' type-id='9a46f87f' visibility='default' filepath='sock.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='sock.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock' size-in-bits='1792' is-struct='yes' visibility='default' filepath='sock.h' line='32' column='1' id='2fd26578'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='net_impl' type-id='5dabfc38' visibility='default' filepath='sock.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opts' type-id='635566cb' visibility='default' filepath='sock.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='group_impl' type-id='ad1df54b' visibility='default' filepath='sock.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='sock.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='queued_reqs' type-id='e7f43f75' visibility='default' filepath='sock.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pending_reqs' type-id='e7f43f75' visibility='default' filepath='sock.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='read_req' type-id='7fb90480' visibility='default' filepath='sock.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='queued_iovcnt' type-id='95e97e5e' visibility='default' filepath='sock.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='cb_cnt' type-id='95e97e5e' visibility='default' filepath='sock.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='cb_fn' type-id='f24fbecd' visibility='default' filepath='sock.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='flags' type-id='e7f43f76' visibility='default' filepath='sock.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='impl_opts' type-id='14471ec6' visibility='default' filepath='sock.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group' size-in-bits='320' is-struct='yes' visibility='default' filepath='sock.h' line='58' column='1' id='9baacbac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='group_impls' type-id='e7f43f77' visibility='default' filepath='sock.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='e7f43f78' visibility='default' filepath='sock.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group_impl' size-in-bits='320' is-struct='yes' visibility='default' filepath='sock.h' line='64' column='1' id='00ed2c8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='net_impl' type-id='5dabfc38' visibility='default' filepath='sock.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='group' type-id='becb7f9a' visibility='default' filepath='sock.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='socks' type-id='e7f43f79' visibility='default' filepath='sock.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='link' type-id='e7f43f7a' visibility='default' filepath='sock.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group_provided_buf' size-in-bits='192' is-struct='yes' visibility='default' filepath='sock.h' line='52' column='1' id='b9665878'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='sock.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='e7f43f7b' visibility='default' filepath='sock.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_impl_opts' size-in-bits='640' is-struct='yes' visibility='default' filepath='sock.h' line='89' column='1' id='14471ec6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recv_buf_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='send_buf_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='enable_recv_pipe' type-id='c894953d' visibility='default' filepath='sock.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='enable_zerocopy_send' type-id='c894953d' visibility='default' filepath='sock.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='enable_quickack' type-id='c894953d' visibility='default' filepath='sock.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enable_placement_id' type-id='8f92235e' visibility='default' filepath='sock.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='enable_zerocopy_send_server' type-id='c894953d' visibility='default' filepath='sock.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='enable_zerocopy_send_client' type-id='c894953d' visibility='default' filepath='sock.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='zerocopy_threshold' type-id='8f92235e' visibility='default' filepath='sock.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tls_version' type-id='8f92235e' visibility='default' filepath='sock.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='enable_ktls' type-id='c894953d' visibility='default' filepath='sock.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='psk_key' type-id='ae3e8ca6' visibility='default' filepath='sock.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='psk_key_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='psk_identity' type-id='26a90f95' visibility='default' filepath='sock.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_key' type-id='7885dec3' visibility='default' filepath='sock.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_key_ctx' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tls_cipher_suites' type-id='80f4b756' visibility='default' filepath='sock.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_map' size-in-bits='448' is-struct='yes' visibility='default' filepath='sock.h' line='71' column='1' id='a3b1dfd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='e7f43f7c' visibility='default' filepath='sock.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mtx' type-id='7a6844eb' visibility='default' filepath='sock.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_opts' size-in-bits='320' is-struct='yes' visibility='default' filepath='sock.h' line='199' column='1' id='635566cb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='sock.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='sock.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default' filepath='sock.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved13' type-id='d3490169' visibility='default' filepath='sock.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ack_timeout' type-id='8f92235e' visibility='default' filepath='sock.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='sock.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='impl_opts' type-id='276545ec' visibility='default' filepath='sock.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='impl_opts_size' type-id='b59d7dce' visibility='default' filepath='sock.h' line='238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_request' size-in-bits='448' is-struct='yes' visibility='default' filepath='sock.h' line='36' column='1' id='6ddea8d2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='1ed1e4cd' visibility='default' filepath='sock.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='683903f3' visibility='default' filepath='sock.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='sock.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='115' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5dabfc38' visibility='default' filepath='sock.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='36' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2301d53e' visibility='default' filepath='sock.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='2fe26e7c' visibility='default' filepath='sock.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='67' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='2301d53e' visibility='default' filepath='sock.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='2fe26e7c' visibility='default' filepath='sock.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='68' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='ad1df54b' visibility='default' filepath='sock.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='59' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='ad1df54b' visibility='default' filepath='sock.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='e72947b3' visibility='default' filepath='sock.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='55' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='8142ca8e' visibility='default' filepath='sock.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='60' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='8142ca8e' visibility='default' filepath='sock.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='2025002c' visibility='default' filepath='sock.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='72' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='90ef5363' visibility='default' filepath='sock.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='71c01beb' visibility='default' filepath='sock.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='50' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7fb90480' visibility='default' filepath='sock.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ba42579e' visibility='default' filepath='sock.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='38' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='7fb90480' visibility='default' filepath='sock.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ba42579e' visibility='default' filepath='sock.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='sock.h' line='45' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='closed' type-id='b96825af' visibility='default' filepath='sock.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='sock.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' filepath='types.h' line='194' column='1' id='41060289'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_sock_cb' type-id='71e5033a' filepath='sock.h' line='505' column='1' id='f24fbecd'/>
    <typedef-decl name='ssize_t' type-id='41060289' filepath='stdio.h' line='77' column='1' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' filepath='pthreadtypes.h' line='67' column='1' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default' filepath='pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default' filepath='pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='8f332899' size-in-bits='64' id='e0b2e255'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='14471ec6' const='yes' id='13599d0d'/>
    <pointer-type-def type-id='13599d0d' size-in-bits='64' id='9d126465'/>
    <pointer-type-def type-id='89a4002b' size-in-bits='64' id='9a46f87f'/>
    <pointer-type-def type-id='5c7a9ba0' size-in-bits='64' id='ff5e8dca'/>
    <pointer-type-def type-id='e60c160e' size-in-bits='64' id='b9fe6bd8'/>
    <pointer-type-def type-id='b5a346ad' size-in-bits='64' id='2969e6b1'/>
    <pointer-type-def type-id='b93ad1ac' size-in-bits='64' id='b22ae6ce'/>
    <pointer-type-def type-id='06e74071' size-in-bits='64' id='bdf450ad'/>
