<abi-corpus version='2.1' soname='libspdk_ioat.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_ioat_build_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_build_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_detach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_get_dma_capabilities' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_get_max_descriptors' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_probe' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_process_events' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='ioat.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' filepath='env.h' line='689' column='1' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='701' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='env.h' line='650' column='1' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='651' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='654' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' filepath='env.h' line='672' column='1' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default' filepath='env.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default' filepath='env.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default' filepath='env.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default' filepath='env.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='702' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='env.h' line='657' column='1' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='662' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='env.h' line='701' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='701' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='spdk_ioat_attach_cb' type-id='9b95b6a5' filepath='ioat.h' line='52' column='1' id='8cd955d6'/>
    <typedef-decl name='spdk_ioat_probe_cb' type-id='d6185de6' filepath='ioat.h' line='42' column='1' id='f6c74e99'/>
    <typedef-decl name='spdk_ioat_req_cb' type-id='b7f9d8e6' filepath='ioat.h' line='32' column='1' id='577fc623'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eeb'/>
    <pointer-type-def type-id='382815ac' size-in-bits='64' id='d6185de6'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='fff4b13a' size-in-bits='64' id='3319d698'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='6577fd51' size-in-bits='64' id='9b95b6a5'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_ioat_flush' mangled-name='spdk_ioat_flush' filepath='ioat.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_flush'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='134' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioat_get_max_descriptors' mangled-name='spdk_ioat_get_max_descriptors' filepath='ioat.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_get_max_descriptors'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='351' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_ioat_probe' mangled-name='spdk_ioat_probe' filepath='ioat.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_probe'>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='ioat.c' line='540' column='1'/>
      <parameter type-id='f6c74e99' name='probe_cb' filepath='ioat.c' line='540' column='1'/>
      <parameter type-id='8cd955d6' name='attach_cb' filepath='ioat.c' line='540' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_detach' mangled-name='spdk_ioat_detach' filepath='ioat.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_detach'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='559' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioat_build_copy' mangled-name='spdk_ioat_build_copy' filepath='ioat.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_build_copy'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='575' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='575' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='575' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='576' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='ioat.c' line='576' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='576' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_submit_copy' mangled-name='spdk_ioat_submit_copy' filepath='ioat.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_submit_copy'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='642' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_build_fill' mangled-name='spdk_ioat_build_fill' filepath='ioat.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_build_fill'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='656' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='656' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='656' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='657' column='1'/>
      <parameter type-id='9c313c2d' name='fill_pattern' filepath='ioat.c' line='657' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='657' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_submit_fill' mangled-name='spdk_ioat_submit_fill' filepath='ioat.c' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_submit_fill'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='fill_pattern' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='715' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_get_dma_capabilities' mangled-name='spdk_ioat_get_dma_capabilities' filepath='ioat.c' line='729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_get_dma_capabilities'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='729' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_ioat_process_events' mangled-name='spdk_ioat_process_events' filepath='ioat.c' line='738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_process_events'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='738' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_ioat_chan' is-struct='yes' visibility='default' filepath='ioat_internal.h' line='26' column='1' is-declaration-only='yes' id='fff4b13a'/>
    <function-type size-in-bits='64' id='382815ac'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6577fd51'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <parameter type-id='3319d698'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
