<abi-corpus version='2.1' soname='libspdk_lvol.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_util.so.7.0'/>
    <dependency name='libspdk_blob.so.10.0'/>
    <dependency name='libspdk_thread.so.8.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_lvol_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_esnap_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_snapshot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_decouple_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_deletable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_get_by_names' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_get_by_uuid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_inflate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_is_degraded' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_iter_immediate_clones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_rename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_resize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_set_read_only' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_esnap_missing_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_esnap_missing_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_grow' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_load_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_notify_hotplug' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_rename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='lvol.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='296' id='12e4ade3'>
      <subrange length='37' type-id='f0981eeb' id='aa6426fb'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='464' id='64ad9dae'>
      <subrange length='58' type-id='f0981eeb' id='fc047456'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <enum-decl name='blob_clear_method' filepath='blob.h' line='48' column='1' id='6486fbcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BLOB_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='BLOB_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='BLOB_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='BLOB_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='lvol_clear_method' filepath='lvol.h' line='26' column='1' id='78195891'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVOL_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='LVOL_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='LVOL_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='LVOL_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='lvs_clear_method' filepath='lvol.h' line='33' column='1' id='b9d2071b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVS_CLEAR_WITH_UNMAP' value='0'/>
      <enumerator name='LVS_CLEAR_WITH_WRITE_ZEROES' value='1'/>
      <enumerator name='LVS_CLEAR_WITH_NONE' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='degraded_lvol_sets_tree' size-in-bits='64' is-struct='yes' visibility='default' filepath='lvolstore.h' line='90' column='1' id='36dfe51c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='a16313d5' visibility='default' filepath='lvolstore.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='blob.h' line='163' column='1' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' size-in-bits='1216' is-struct='yes' visibility='default' filepath='blob.h' line='175' column='1' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='d013fa97' visibility='default' filepath='blob.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='264c8cbd' visibility='default' filepath='blob.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='21f143ce' visibility='default' filepath='blob.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='be92dbcf' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='be92dbcf' visibility='default' filepath='blob.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='6edb6746' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='6edb6746' visibility='default' filepath='blob.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='2ce17223' visibility='default' filepath='blob.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='1b27772b' visibility='default' filepath='blob.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='1b27772b' visibility='default' filepath='blob.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4c29f0d0' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='e52281d8' visibility='default' filepath='blob.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='translate_lba' type-id='f51a5171' visibility='default' filepath='blob.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='copy' type-id='57452971' visibility='default' filepath='blob.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_degraded' type-id='995c0ad0' visibility='default' filepath='blob.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='blob.h' line='153' column='1' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvol' size-in-bits='2112' is-struct='yes' visibility='default' filepath='lvolstore.h' line='94' column='1' id='7b976e75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lvol_store' type-id='4c655657' visibility='default' filepath='lvolstore.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blob' type-id='89e1f283' visibility='default' filepath='lvolstore.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blob_id' type-id='533eb244' visibility='default' filepath='lvolstore.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='unique_id' type-id='64ad9dae' visibility='default' filepath='lvolstore.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='lvolstore.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1296'>
        <var-decl name='uuid_str' type-id='12e4ade3' visibility='default' filepath='lvolstore.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='lvolstore.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ref_count' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='action_in_progress' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='lvolstore.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='lvolstore.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='degraded_set' type-id='a16313d5' visibility='default' filepath='lvolstore.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='degraded_link' type-id='e7f43f72' visibility='default' filepath='lvolstore.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvol_store' size-in-bits='2240' is-struct='yes' visibility='default' filepath='lvolstore.h' line='73' column='1' id='78ce766f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bs_dev' type-id='44388ddf' visibility='default' filepath='lvolstore.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blobstore' type-id='07fd40b5' visibility='default' filepath='lvolstore.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='super_blob' type-id='89e1f283' visibility='default' filepath='lvolstore.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='super_blob_id' type-id='533eb244' visibility='default' filepath='lvolstore.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='lvolstore.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lvol_count' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvols_opened' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pending_lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='retry_open_lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='load_esnaps' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='on_list' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='lvolstore.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='new_name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='lvolstore.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='degraded_lvol_sets_tree' type-id='36dfe51c' visibility='default' filepath='lvolstore.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='lvolstore.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvs_opts' size-in-bits='704' is-struct='yes' visibility='default' filepath='lvol.h' line='46' column='1' id='3543c05e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default' filepath='lvol.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='clear_method' type-id='b9d2071b' visibility='default' filepath='lvol.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvol.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='num_md_pages_per_cluster_ratio' type-id='8f92235e' visibility='default' filepath='lvol.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='lvol.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='lvol.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='uuid.h' line='21' column='1' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='lvolstore.h' line='106' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b1c2c545' visibility='default' filepath='lvolstore.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='449ccdbd' visibility='default' filepath='lvolstore.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='lvolstore.h' line='81' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='b1c2c545' visibility='default' filepath='lvolstore.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='449ccdbd' visibility='default' filepath='lvolstore.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='lvolstore.h' line='86' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='4c655657' visibility='default' filepath='lvolstore.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c08726c7' visibility='default' filepath='lvolstore.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' filepath='blob.h' line='43' column='1' id='533eb244'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='6e11a86a' filepath='blob.h' line='118' column='1' id='7683f572'/>
    <typedef-decl name='spdk_bs_esnap_dev_create' type-id='0a322735' filepath='blob.h' line='149' column='1' id='63c64b6d'/>
    <typedef-decl name='spdk_lvol_iter_cb' type-id='bfb580fd' filepath='lvol.h' line='126' column='1' id='892e12ff'/>
    <typedef-decl name='spdk_lvol_op_complete' type-id='1ed1e4cd' filepath='lvol.h' line='117' column='1' id='d6a4099a'/>
    <typedef-decl name='spdk_lvol_op_with_handle_complete' type-id='ef8691f1' filepath='lvol.h' line='108' column='1' id='7c4e9e6e'/>
    <typedef-decl name='spdk_lvs_op_complete' type-id='1ed1e4cd' filepath='lvol.h' line='98' column='1' id='1405f9e6'/>
    <typedef-decl name='spdk_lvs_op_with_handle_complete' type-id='6cb69b9f' filepath='lvol.h' line='89' column='1' id='5d9bdc8a'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='uuid.h' line='22' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' id='995c0ad0'/>
    <pointer-type-def type-id='9790a036' size-in-bits='64' id='e52281d8'/>
    <pointer-type-def type-id='58eb2595' size-in-bits='64' id='f51a5171'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='7b976e75' const='yes' id='e599220a'/>
    <pointer-type-def type-id='e599220a' size-in-bits='64' id='9010b860'/>
    <qualified-type-def type-id='3543c05e' const='yes' id='7b98ece1'/>
    <pointer-type-def type-id='7b98ece1' size-in-bits='64' id='5cbcc391'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='05f9d741' size-in-bits='64' id='bfb580fd'/>
    <pointer-type-def type-id='29d31011' size-in-bits='64' id='0a322735'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' id='4c29f0d0'/>
