<abi-corpus version='2.1' soname='libspdk_init.so.4.0'>
  <elf-needed>
    <dependency name='libspdk_jsonrpc.so.5.1'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libspdk_thread.so.8.1'/>
    <dependency name='libspdk_util.so.7.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_add_subsystem' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_add_subsystem_depend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_initialize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_fini_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init_from_json_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='json_config.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='spdk_subsystem_init_fn' type-id='f1eb0faf' filepath='init.h' line='61' column='1' id='522497da'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='7b5ced03' size-in-bits='64' id='f1eb0faf'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_subsystem_init_from_json_config' mangled-name='spdk_subsystem_init_from_json_config' filepath='json_config.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init_from_json_config'>
      <parameter type-id='80f4b756' name='json_config_file' filepath='json_config.c' line='561' column='1'/>
      <parameter type-id='80f4b756' name='rpc_addr' filepath='json_config.c' line='561' column='1'/>
      <parameter type-id='522497da' name='cb_fn' filepath='json_config.c' line='562' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='json_config.c' line='562' column='1'/>
      <parameter type-id='c894953d' name='stop_on_error' filepath='json_config.c' line='563' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='7b5ced03'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rpc.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' filepath='log.h' line='52' column='1' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_rpc_opts' size-in-bits='192' is-struct='yes' visibility='default' filepath='init.h' line='28' column='1' id='9f4e83f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='init.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='log_file' type-id='822cd80b' visibility='default' filepath='init.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='log_level' type-id='4271cbce' visibility='default' filepath='init.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='9f4e83f2' const='yes' id='e36863d9'/>
    <pointer-type-def type-id='e36863d9' size-in-bits='64' id='f0555789'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_rpc_initialize' mangled-name='spdk_rpc_initialize' filepath='rpc.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_initialize'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='68' column='1'/>
      <parameter type-id='f0555789' name='_opts' filepath='rpc.c' line='68' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_rpc_finish' mangled-name='spdk_rpc_finish' filepath='rpc.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_finish'>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='subsystem.c' language='LANG_C99'>
    <class-decl name='spdk_subsystem' size-in-bits='384' is-struct='yes' visibility='default' filepath='init.h' line='13' column='1' id='9fe5652b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='953b12f8' visibility='default' filepath='init.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini' type-id='953b12f8' visibility='default' filepath='init.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_config_json' type-id='582528d7' visibility='default' filepath='init.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_subsystem_depend' size-in-bits='256' is-struct='yes' visibility='default' filepath='init.h' line='28' column='1' id='086abaea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depends_on' type-id='80f4b756' visibility='default' filepath='init.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='init.h' line='25' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f7a7c12b' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='de14d493' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='init.h' line='31' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='51dccc68' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='20958be6' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_msg_fn' type-id='b7f9d8e6' filepath='thread.h' line='90' column='1' id='de128c99'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='9fe5652b' size-in-bits='64' id='f7a7c12b'/>
    <pointer-type-def type-id='f7a7c12b' size-in-bits='64' id='de14d493'/>
    <pointer-type-def type-id='086abaea' size-in-bits='64' id='51dccc68'/>
    <pointer-type-def type-id='51dccc68' size-in-bits='64' id='20958be6'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='9ed8cfeb' size-in-bits='64' id='582528d7'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_add_subsystem' mangled-name='spdk_add_subsystem' filepath='subsystem.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem'>
      <parameter type-id='f7a7c12b' name='subsystem' filepath='subsystem.c' line='35' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_add_subsystem_depend' mangled-name='spdk_add_subsystem_depend' filepath='subsystem.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem_depend'>
      <parameter type-id='51dccc68' name='depend' filepath='subsystem.c' line='41' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init_next' mangled-name='spdk_subsystem_init_next' filepath='subsystem.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init_next'>
      <parameter type-id='95e97e5e' name='rc' filepath='subsystem.c' line='138' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init' mangled-name='spdk_subsystem_init' filepath='subsystem.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init'>
      <parameter type-id='522497da' name='cb_fn' filepath='subsystem.c' line='173' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='subsystem.c' line='173' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_fini_next' mangled-name='spdk_subsystem_fini_next' filepath='subsystem.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_fini_next'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_fini' mangled-name='spdk_subsystem_fini' filepath='subsystem.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_fini'>
      <parameter type-id='de128c99' name='cb_fn' filepath='subsystem.c' line='245' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='subsystem.c' line='245' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='9ed8cfeb'>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
