<abi-corpus version='2.1' soname='libspdk_virtio.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_vfio_user.so.3.1'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='virtio_dev_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_backend_ops' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_dump_json_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_find_and_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_get_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_queue_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_queue_is_acquired' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_read_dev_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_release_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_set_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_stop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_write_dev_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_attach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_enumerate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_event_process' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_recv_pkts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_user_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_vfio_user_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_add_iovs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='virtio.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_virtio_desc_type' filepath='virtio.h' line='149' column='1' id='82458b79'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_VIRTIO_DESC_RO' value='0'/>
      <enumerator name='SPDK_VIRTIO_DESC_WR' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='thread-shared-types.h' line='51' column='1' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='struct_mutex.h' line='22' column='1' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_dev' size-in-bits='768' is-struct='yes' visibility='default' filepath='virtio.h' line='38' column='1' id='220c9082'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vqs' type-id='06ce3ba1' visibility='default' filepath='virtio.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='virtio.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fixed_queues_num' type-id='149c6638' visibility='default' filepath='virtio.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='max_queues' type-id='149c6638' visibility='default' filepath='virtio.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='negotiated_features' type-id='9c313c2d' visibility='default' filepath='virtio.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='is_hw' type-id='95e97e5e' visibility='default' filepath='virtio.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='modern' type-id='b96825af' visibility='default' filepath='virtio.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='virtio.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backend_ops' type-id='7fd10606' visibility='default' filepath='virtio.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_dev_ops' size-in-bits='832' is-struct='yes' visibility='default' filepath='virtio.h' line='68' column='1' id='eca1d791'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_dev_cfg' type-id='1ce7e695' visibility='default' filepath='virtio.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_dev_cfg' type-id='1ce7e695' visibility='default' filepath='virtio.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_status' type-id='6da20016' visibility='default' filepath='virtio.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_status' type-id='f948f56c' visibility='default' filepath='virtio.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_features' type-id='ed7ddf11' visibility='default' filepath='virtio.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_features' type-id='66ede75c' visibility='default' filepath='virtio.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='destruct_dev' type-id='ea4b0ff5' visibility='default' filepath='virtio.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_queue_size' type-id='eaedb1ab' visibility='default' filepath='virtio.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setup_queue' type-id='c53a950e' visibility='default' filepath='virtio.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='del_queue' type-id='3dd6b921' visibility='default' filepath='virtio.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_queue' type-id='3dd6b921' visibility='default' filepath='virtio.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dump_json_info' type-id='715d4cd2' visibility='default' filepath='virtio.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='write_json_config' type-id='715d4cd2' visibility='default' filepath='virtio.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtqueue' size-in-bits='832' is-struct='yes' visibility='default' filepath='virtio.h' line='106' column='1' id='d7c60ba9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vdev' type-id='c4ba6c30' visibility='default' filepath='virtio.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vq_ring' type-id='83eac9f7' visibility='default' filepath='virtio.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vq_used_cons_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vq_nentries' type-id='149c6638' visibility='default' filepath='virtio.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='vq_free_cnt' type-id='149c6638' visibility='default' filepath='virtio.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='vq_avail_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vq_ring_virt_mem' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vq_ring_size' type-id='f0981eec' visibility='default' filepath='virtio.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='vq_ring_mem' type-id='9c313c2d' visibility='default' filepath='virtio.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vq_desc_head_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='vq_desc_tail_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='vq_queue_index' type-id='149c6638' visibility='default' filepath='virtio.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_addr' type-id='8a121f49' visibility='default' filepath='virtio.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='owner_thread' type-id='f8fcfe66' visibility='default' filepath='virtio.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='req_start' type-id='149c6638' visibility='default' filepath='virtio.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='req_end' type-id='149c6638' visibility='default' filepath='virtio.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reqs_finished' type-id='149c6638' visibility='default' filepath='virtio.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vq_descx' type-id='f3c55529' visibility='default' filepath='virtio.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vq_desc_extra' size-in-bits='128' is-struct='yes' visibility='default' filepath='virtio.h' line='101' column='1' id='fb448689'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ndescs' type-id='149c6638' visibility='default' filepath='virtio.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='types.h' line='41' column='1' id='33f57a65'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='stdint-intn.h' line='26' column='1' id='3ff5601b'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' filepath='pthreadtypes.h' line='67' column='1' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default' filepath='pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default' filepath='pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <array-type-def dimensions='1' type-id='fb448689' size-in-bits='infinite' id='f3c55529'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='eca1d791' const='yes' id='d2d03d88'/>
    <pointer-type-def type-id='d2d03d88' size-in-bits='64' id='7fd10606'/>
    <pointer-type-def type-id='af38b981' size-in-bits='64' id='1ce7e695'/>
    <pointer-type-def type-id='c53f26ba' size-in-bits='64' id='66ede75c'/>
    <pointer-type-def type-id='8ee50edc' size-in-bits='64' id='c53a950e'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='b5d91067' size-in-bits='64' id='eaedb1ab'/>
    <pointer-type-def type-id='956bea3d' size-in-bits='64' id='ed7ddf11'/>
    <pointer-type-def type-id='3abf5dfc' size-in-bits='64' id='6da20016'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='220c9082' size-in-bits='64' id='c4ba6c30'/>
    <pointer-type-def type-id='d7c60ba9' size-in-bits='64' id='91d0de51'/>
    <pointer-type-def type-id='91d0de51' size-in-bits='64' id='06ce3ba1'/>
    <pointer-type-def type-id='1b4dff91' size-in-bits='64' id='ea4b0ff5'/>
    <pointer-type-def type-id='69547f68' size-in-bits='64' id='715d4cd2'/>
    <pointer-type-def type-id='137dad42' size-in-bits='64' id='f948f56c'/>
    <pointer-type-def type-id='0282c3dd' size-in-bits='64' id='3dd6b921'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='vring' is-struct='yes' visibility='default' filepath='virtio_ring.h' line='122' column='1' is-declaration-only='yes' id='83eac9f7'/>
    <function-decl name='virtio_dev_construct' mangled-name='virtio_dev_construct' filepath='virtio.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_construct'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='229' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio.c' line='229' column='1'/>
      <parameter type-id='7fd10606' name='ops' filepath='virtio.c' line='230' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='virtio.c' line='230' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_reset' mangled-name='virtio_dev_reset' filepath='virtio.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_reset'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='252' column='1'/>
      <parameter type-id='9c313c2d' name='req_features' filepath='virtio.c' line='252' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_start' mangled-name='virtio_dev_start' filepath='virtio.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_start'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='274' column='1'/>
      <parameter type-id='149c6638' name='max_queues' filepath='virtio.c' line='274' column='1'/>
      <parameter type-id='149c6638' name='fixed_queue_num' filepath='virtio.c' line='274' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_destruct' mangled-name='virtio_dev_destruct' filepath='virtio.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_destruct'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='293' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_start' mangled-name='virtqueue_req_start' filepath='virtio.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_start'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='394' column='1'/>
      <parameter type-id='eaa32e2f' name='cookie' filepath='virtio.c' line='394' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='virtio.c' line='394' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtqueue_req_flush' mangled-name='virtqueue_req_flush' filepath='virtio.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_flush'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='415' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_abort' mangled-name='virtqueue_req_abort' filepath='virtio.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_abort'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='450' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_add_iovs' mangled-name='virtqueue_req_add_iovs' filepath='virtio.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_add_iovs'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='467' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='virtio.c' line='467' column='1'/>
      <parameter type-id='149c6638' name='iovcnt' filepath='virtio.c' line='467' column='1'/>
      <parameter type-id='82458b79' name='desc_type' filepath='virtio.c' line='468' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_recv_pkts' mangled-name='virtio_recv_pkts' filepath='virtio.c' line='516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_recv_pkts'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='516' column='1'/>
      <parameter type-id='63e171df' name='io' filepath='virtio.c' line='516' column='1'/>
      <parameter type-id='90421557' name='len' filepath='virtio.c' line='516' column='1'/>
      <parameter type-id='149c6638' name='nb_pkts' filepath='virtio.c' line='516' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='virtio_dev_acquire_queue' mangled-name='virtio_dev_acquire_queue' filepath='virtio.c' line='532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_acquire_queue'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='532' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='532' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_find_and_acquire_queue' mangled-name='virtio_dev_find_and_acquire_queue' filepath='virtio.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_find_and_acquire_queue'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='555' column='1'/>
      <parameter type-id='149c6638' name='start_index' filepath='virtio.c' line='555' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_get_thread' mangled-name='virtio_dev_queue_get_thread' filepath='virtio.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_get_thread'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='580' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='580' column='1'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_is_acquired' mangled-name='virtio_dev_queue_is_acquired' filepath='virtio.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_is_acquired'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='598' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='598' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='virtio_dev_release_queue' mangled-name='virtio_dev_release_queue' filepath='virtio.c' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_release_queue'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='604' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='604' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_read_dev_config' mangled-name='virtio_dev_read_dev_config' filepath='virtio.c' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_read_dev_config'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='628' column='1'/>
      <parameter type-id='b59d7dce' name='offset' filepath='virtio.c' line='628' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='virtio.c' line='629' column='1'/>
      <parameter type-id='95e97e5e' name='length' filepath='virtio.c' line='629' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_write_dev_config' mangled-name='virtio_dev_write_dev_config' filepath='virtio.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_write_dev_config'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='635' column='1'/>
      <parameter type-id='b59d7dce' name='offset' filepath='virtio.c' line='635' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='virtio.c' line='636' column='1'/>
      <parameter type-id='95e97e5e' name='length' filepath='virtio.c' line='636' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_stop' mangled-name='virtio_dev_stop' filepath='virtio.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_stop'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='642' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_set_status' mangled-name='virtio_dev_set_status' filepath='virtio.c' line='651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_set_status'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='651' column='1'/>
      <parameter type-id='b96825af' name='status' filepath='virtio.c' line='651' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_get_status' mangled-name='virtio_dev_get_status' filepath='virtio.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_get_status'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='661' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='virtio_dev_backend_ops' mangled-name='virtio_dev_backend_ops' filepath='virtio.c' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_backend_ops'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='667' column='1'/>
      <return type-id='7fd10606'/>
    </function-decl>
    <function-decl name='virtio_dev_dump_json_info' mangled-name='virtio_dev_dump_json_info' filepath='virtio.c' line='673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_dump_json_info'>
      <parameter type-id='c4ba6c30' name='hw' filepath='virtio.c' line='673' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='virtio.c' line='673' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='c53f26ba'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='af38b981'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8ee50edc'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='3abf5dfc'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='b96825af'/>
    </function-type>
    <function-type size-in-bits='64' id='956bea3d'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' id='b5d91067'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='149c6638'/>
      <return type-id='149c6638'/>
    </function-type>
    <function-type size-in-bits='64' id='1b4dff91'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='69547f68'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='137dad42'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b96825af'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0282c3dd'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_pci.c' language='LANG_C99'>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='env.h' line='639' column='1' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='643' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='virtio_pci_create_cb' type-id='9259a2b1' filepath='virtio.h' line='164' column='1' id='9d774d53'/>
    <pointer-type-def type-id='04b7c0a5' size-in-bits='64' id='9259a2b1'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' id='a714fad8'/>
    <pointer-type-def type-id='b7790783' size-in-bits='64' id='486c7873'/>
    <class-decl name='virtio_pci_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7790783'/>
    <function-decl name='virtio_pci_dev_event_process' mangled-name='virtio_pci_dev_event_process' filepath='virtio_pci.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_event_process'>
      <parameter type-id='95e97e5e' name='fd' filepath='virtio_pci.c' line='159' column='1'/>
      <parameter type-id='149c6638' name='device_id' filepath='virtio_pci.c' line='159' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_enumerate' mangled-name='virtio_pci_dev_enumerate' filepath='virtio_pci.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_enumerate'>
      <parameter type-id='9d774d53' name='enum_cb' filepath='virtio_pci.c' line='723' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='virtio_pci.c' line='723' column='1'/>
      <parameter type-id='149c6638' name='pci_device_id' filepath='virtio_pci.c' line='724' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_attach' mangled-name='virtio_pci_dev_attach' filepath='virtio_pci.c' line='742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_attach'>
      <parameter type-id='9d774d53' name='enum_cb' filepath='virtio_pci.c' line='742' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='virtio_pci.c' line='742' column='1'/>
      <parameter type-id='149c6638' name='device_id' filepath='virtio_pci.c' line='743' column='1'/>
      <parameter type-id='a714fad8' name='pci_address' filepath='virtio_pci.c' line='743' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_init' mangled-name='virtio_pci_dev_init' filepath='virtio_pci.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_init'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio_pci.c' line='761' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio_pci.c' line='761' column='1'/>
      <parameter type-id='486c7873' name='pci_ctx' filepath='virtio_pci.c' line='762' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='04b7c0a5'>
      <parameter type-id='486c7873'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_vfio_user.c' language='LANG_C99'>
    <function-decl name='virtio_vfio_user_dev_init' mangled-name='virtio_vfio_user_dev_init' filepath='virtio_vfio_user.c' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_vfio_user_dev_init'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio_vfio_user.c' line='399' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio_vfio_user.c' line='399' column='1'/>
      <parameter type-id='80f4b756' name='path' filepath='virtio_vfio_user.c' line='399' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_vhost_user.c' language='LANG_C99'>
