<abi-corpus version='2.1' soname='libspdk_vfu_tgt.so.1.0'>
  <elf-needed>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vfu_create_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_delete_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_get_pci_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_intx_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_msix_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_by_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_private' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_vfu_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_map_one' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_register_endpoint_ops' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_set_socket_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_unmap_sg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='tgt_endpoint.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <array-type-def dimensions='1' type-id='99021309' size-in-bits='13440' id='734814fe'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ea28250a' size-in-bits='1024' id='24a581cc'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_endpoint_ops' size-in-bits='1152' is-struct='yes' visibility='default' id='b2332df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='init' type-id='8f91df7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_device_info' type-id='3d411fd3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_vendor_capability' type-id='ab594408' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attach_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='detach_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destruct' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='post_memory_add' type-id='e8c2de89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pre_memory_remove' type-id='e8c2de89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='reset_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='quiesce_device' type-id='8260a369' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_device' size-in-bits='14272' is-struct='yes' visibility='default' id='1f9584df'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='class' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='pmcap' type-id='f74f6b06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='pxcap' type-id='db1684d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msixcap' type-id='34cef360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='nr_vendor_caps' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='intr_ipin' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nr_int_irqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nr_msix_irqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='regions' type-id='734814fe' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_region' size-in-bits='1344' is-struct='yes' visibility='default' id='99021309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_sparse_mmaps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmaps' type-id='24a581cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='access_cb' type-id='82c8d56f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_sparse_mmap' size-in-bits='128' is-struct='yes' visibility='default' id='ea28250a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='did' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssid' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='24' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bcc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='scc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pi' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__loff_t' type-id='724e4de6' id='00c9d214'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' id='724e4de6'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' id='41060289'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='dma_sg_t' type-id='06003cec' id='14b05be2'/>
    <typedef-decl name='loff_t' type-id='00c9d214' id='69bf7bee'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_vfu_access_cb' type-id='3c1d4cd4' id='82c8d56f'/>
    <typedef-decl name='spdk_vfu_fini_cb' type-id='953b12f8' id='2c76d06d'/>
    <typedef-decl name='spdk_vfu_init_cb' type-id='03347643' id='c88628db'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='vfu_ctx_t' type-id='7f626116' id='543ad5de'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='14b05be2' size-in-bits='64' id='7648c0bf'/>
    <pointer-type-def type-id='4281545d' size-in-bits='64' id='8260a369'/>
    <pointer-type-def type-id='049ca64f' size-in-bits='64' id='3d411fd3'/>
    <pointer-type-def type-id='2174dd7d' size-in-bits='64' id='e8c2de89'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='fba903dd' size-in-bits='64' id='58857d8d'/>
    <pointer-type-def type-id='b2332df6' size-in-bits='64' id='2fd9908c'/>
    <pointer-type-def type-id='1f9584df' size-in-bits='64' id='7cf8ab37'/>
    <pointer-type-def type-id='03c130da' size-in-bits='64' id='3c1d4cd4'/>
    <pointer-type-def type-id='8205951e' size-in-bits='64' id='ab594408'/>
    <pointer-type-def type-id='543ad5de' size-in-bits='64' id='54925d5d'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='f712e2b7' size-in-bits='64' id='03347643'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='a1bf19e7' size-in-bits='64' id='8f91df7b'/>
    <class-decl name='dma_sg' is-struct='yes' visibility='default' is-declaration-only='yes' id='06003cec'/>
    <class-decl name='vfu_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='7f626116'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='msixcap' is-struct='yes' visibility='default' is-declaration-only='yes' id='34cef360'/>
    <class-decl name='pmcap' is-struct='yes' visibility='default' is-declaration-only='yes' id='f74f6b06'/>
    <class-decl name='pxcap' is-struct='yes' visibility='default' is-declaration-only='yes' id='db1684d3'/>
    <function-decl name='spdk_vfu_register_endpoint_ops' mangled-name='spdk_vfu_register_endpoint_ops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_register_endpoint_ops'>
      <parameter type-id='2fd9908c' name='ops'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vfu_set_socket_path' mangled-name='spdk_vfu_set_socket_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_set_socket_path'>
      <parameter type-id='80f4b756' name='basename'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vfu_get_endpoint_by_name' mangled-name='spdk_vfu_get_endpoint_by_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_get_endpoint_by_name'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='58857d8d'/>
    </function-decl>
    <function-decl name='spdk_vfu_create_endpoint' mangled-name='spdk_vfu_create_endpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_create_endpoint'>
      <parameter type-id='80f4b756' name='endpoint_name'/>
      <parameter type-id='80f4b756' name='cpumask_str'/>
      <parameter type-id='80f4b756' name='dev_type_name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vfu_delete_endpoint' mangled-name='spdk_vfu_delete_endpoint' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_delete_endpoint'>
      <parameter type-id='80f4b756' name='endpoint_name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vfu_get_endpoint_id' mangled-name='spdk_vfu_get_endpoint_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_get_endpoint_id'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_vfu_get_endpoint_name' mangled-name='spdk_vfu_get_endpoint_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_get_endpoint_name'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_vfu_get_vfu_ctx' mangled-name='spdk_vfu_get_vfu_ctx' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_get_vfu_ctx'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='54925d5d'/>
    </function-decl>
    <function-decl name='spdk_vfu_get_endpoint_private' mangled-name='spdk_vfu_get_endpoint_private' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_get_endpoint_private'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_vfu_endpoint_msix_enabled' mangled-name='spdk_vfu_endpoint_msix_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_endpoint_msix_enabled'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_vfu_endpoint_intx_enabled' mangled-name='spdk_vfu_endpoint_intx_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_endpoint_intx_enabled'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_vfu_endpoint_get_pci_config' mangled-name='spdk_vfu_endpoint_get_pci_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_endpoint_get_pci_config'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_vfu_init' mangled-name='spdk_vfu_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_init'>
      <parameter type-id='c88628db' name='init_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vfu_map_one' mangled-name='spdk_vfu_map_one' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_map_one'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <parameter type-id='9c313c2d' name='addr'/>
      <parameter type-id='9c313c2d' name='len'/>
      <parameter type-id='7648c0bf' name='sg'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='prot'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_vfu_unmap_sg' mangled-name='spdk_vfu_unmap_sg' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_unmap_sg'>
      <parameter type-id='58857d8d' name='endpoint'/>
      <parameter type-id='7648c0bf' name='sg'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vfu_fini' mangled-name='spdk_vfu_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfu_fini'>
      <parameter type-id='2c76d06d' name='fini_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_vfu_endpoint' is-struct='yes' visibility='default' is-declaration-only='yes' id='fba903dd'/>
    <function-type size-in-bits='64' id='4281545d'>
      <parameter type-id='58857d8d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='049ca64f'>
      <parameter type-id='58857d8d'/>
      <parameter type-id='7cf8ab37'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2174dd7d'>
      <parameter type-id='58857d8d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='03c130da'>
      <parameter type-id='54925d5d'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='69bf7bee'/>
      <parameter type-id='c894953d'/>
      <return type-id='79a0948f'/>
    </function-type>
    <function-type size-in-bits='64' id='8205951e'>
      <parameter type-id='58857d8d'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='149c6638'/>
      <parameter type-id='149c6638'/>
      <return type-id='149c6638'/>
    </function-type>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f712e2b7'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='a1bf19e7'>
      <parameter type-id='58857d8d'/>
      <parameter type-id='26a90f95'/>
      <parameter type-id='80f4b756'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
