<abi-corpus version='2.1' soname='libspdk_blobfs.so.8.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_blob.so.9.0'/>
    <dependency name='libspdk_trace.so.7.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_file_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_close_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_get_length' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_read_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_readv_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_set_priority' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_sync' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_sync_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_truncate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_truncate_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_write_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_file_writev_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_alloc_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_alloc_thread_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_create_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_create_file_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_delete_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_delete_file_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_file_stat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_file_stat_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_free_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_free_thread_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_get_cache_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_iter_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_open_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_open_file_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_rename_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_rename_file_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_set_cache_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fs_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='blobfs.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='blob.h' line='129' column='1' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blobfs_opts' size-in-bits='32' is-struct='yes' visibility='default' filepath='blobfs.h' line='28' column='1' id='fe81a337'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default' filepath='blobfs.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' size-in-bits='1152' is-struct='yes' visibility='default' filepath='blob.h' line='141' column='1' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='d013fa97' visibility='default' filepath='blob.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='264c8cbd' visibility='default' filepath='blob.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='21f143ce' visibility='default' filepath='blob.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='be92dbcf' visibility='default' filepath='blob.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='be92dbcf' visibility='default' filepath='blob.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='6edb6746' visibility='default' filepath='blob.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='6edb6746' visibility='default' filepath='blob.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='2ce17223' visibility='default' filepath='blob.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='1b27772b' visibility='default' filepath='blob.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='1b27772b' visibility='default' filepath='blob.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4c29f0d0' visibility='default' filepath='blob.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='e52281d8' visibility='default' filepath='blob.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='translate_lba' type-id='f51a5171' visibility='default' filepath='blob.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='copy' type-id='57452971' visibility='default' filepath='blob.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='214' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='blob.h' line='119' column='1' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_file_stat' size-in-bits='128' is-struct='yes' visibility='default' filepath='blobfs.h' line='32' column='1' id='7983aec1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blobid' type-id='533eb244' visibility='default' filepath='blobfs.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='9c313c2d' visibility='default' filepath='blobfs.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int64_t' type-id='95e97e5f' filepath='types.h' line='44' column='1' id='0c9942d2'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eec' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='fs_request_fn' type-id='b7f9d8e6' filepath='blobfs.h' line='79' column='1' id='cfa65786'/>
    <typedef-decl name='fs_send_request_fn' type-id='7f78ab7b' filepath='blobfs.h' line='90' column='1' id='cecd7741'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' filepath='stdint-intn.h' line='27' column='1' id='9da381c4'/>
    <typedef-decl name='size_t' type-id='f0981eec' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' filepath='blob.h' line='43' column='1' id='533eb244'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='6e11a86a' filepath='blob.h' line='116' column='1' id='7683f572'/>
    <typedef-decl name='spdk_bs_op_complete' type-id='1ed1e4cd' filepath='blob.h' line='71' column='1' id='0955aa0c'/>
    <typedef-decl name='spdk_file_op_complete' type-id='1ed1e4cd' filepath='blobfs.h' line='63' column='1' id='da5c13d9'/>
    <typedef-decl name='spdk_file_op_with_handle_complete' type-id='c352a4d6' filepath='blobfs.h' line='54' column='1' id='0d4fce45'/>
    <typedef-decl name='spdk_file_stat_op_complete' type-id='c3659915' filepath='blobfs.h' line='72' column='1' id='38de0b20'/>
    <typedef-decl name='spdk_fs_iter' type-id='e2bc7a1c' filepath='blobfs.h' line='26' column='1' id='434a6b2b'/>
    <typedef-decl name='spdk_fs_op_complete' type-id='0955aa0c' filepath='blobfs.h' line='55' column='1' id='e7b26e08'/>
    <typedef-decl name='spdk_fs_op_with_handle_complete' type-id='f41bb6f7' filepath='blobfs.h' line='44' column='1' id='f7be7b2c'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eec'/>
    <pointer-type-def type-id='9790a036' size-in-bits='64' id='e52281d8'/>
    <pointer-type-def type-id='58eb2595' size-in-bits='64' id='f51a5171'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' id='4c29f0d0'/>
    <pointer-type-def type-id='3a1587ff' size-in-bits='64' id='e79cd027'/>
    <pointer-type-def type-id='fe81a337' size-in-bits='64' id='2be9cc7f'/>
    <pointer-type-def type-id='c7372297' size-in-bits='64' id='44388ddf'/>
    <pointer-type-def type-id='c0d240d3' size-in-bits='64' id='d8768e33'/>
    <pointer-type-def type-id='f66058f6' size-in-bits='64' id='e2bc7a1c'/>
    <pointer-type-def type-id='e2bc7a1c' size-in-bits='64' id='24b46302'/>
    <pointer-type-def type-id='7983aec1' size-in-bits='64' id='f74e7df9'/>
    <pointer-type-def type-id='fc1e8637' size-in-bits='64' id='411a020f'/>
    <pointer-type-def type-id='064bb642' size-in-bits='64' id='88395a50'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='5f1f8343' size-in-bits='64' id='d013fa97'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
