<abi-corpus version='2.1' soname='libspdk_thread.so.7.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_trace.so.7.1'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_for_each_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_channel_continue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_is_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_thread_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_exit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_app_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_by_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_active_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_paused_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_timed_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_from_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_interrupt_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_last_tsc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_active_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_paused_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_timed_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_stats' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_has_active_pollers' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_has_pollers' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_is_exited' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_is_idle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_is_running' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_init_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_next_poller_expiration' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_send_critical_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_set_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_set_interrupt_mode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='thread.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <enum-decl name='spdk_interrupt_event_types' id='88d1abf7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_IN' value='1'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_OUT' value='4'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_ET' value='2147483648'/>
    </enum-decl>
    <enum-decl name='spdk_thread_op' id='1380717f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_THREAD_OP_NEW' value='0'/>
      <enumerator name='SPDK_THREAD_OP_RESCHED' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer' size-in-bits='64' is-struct='yes' visibility='default' id='9321bf74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='306e7691' visibility='default' id='79110b08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='136d6f32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ad45e2c8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_channel' size-in-bits='896' is-struct='yes' visibility='default' id='e8e2ad7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small' type-id='88eba988' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='large' type-id='88eba988' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parent' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' size-in-bits='192' is-struct='yes' visibility='default' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='da6a25d9' visibility='default' id='ce92b0c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='29210180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='68f59e9e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_opts' size-in-bits='192' is-struct='yes' visibility='default' id='2b1f9788'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small_pool_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='large_pool_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='small_bufsize' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='large_bufsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool' size-in-bits='384' is-struct='yes' visibility='default' id='88eba988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='564ba9df' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='306e7691' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cache_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue' type-id='49599bfc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_poller_stats' size-in-bits='128' is-struct='yes' visibility='default' id='cb2c3d4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='run_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='busy_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' size-in-bits='128' is-struct='yes' visibility='default' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_thread_stats' size-in-bits='128' is-struct='yes' visibility='default' id='06899014'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='busy_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idle_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='136d6f32' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_channel_for_each_cpl' type-id='7957efd5' id='38c48f04'/>
    <typedef-decl name='spdk_channel_msg' type-id='8ced1cce' id='fce5caf0'/>
    <typedef-decl name='spdk_interrupt_fn' type-id='b9b212f5' id='d841131b'/>
    <typedef-decl name='spdk_io_channel_create_cb' type-id='585e1de9' id='7c63ffcc'/>
    <typedef-decl name='spdk_io_channel_destroy_cb' type-id='debb4ee8' id='7e998c02'/>
    <typedef-decl name='spdk_io_device_unregister_cb' type-id='b7f9d8e6' id='ee92dcdf'/>
    <typedef-decl name='spdk_iobuf_buffer_stailq_t' type-id='79110b08' id='306e7691'/>
    <typedef-decl name='spdk_iobuf_entry_stailq_t' type-id='ce92b0c6' id='da6a25d9'/>
    <typedef-decl name='spdk_iobuf_finish_cb' type-id='b7f9d8e6' id='54a757f6'/>
    <typedef-decl name='spdk_iobuf_for_each_entry_fn' type-id='029f6c42' id='acf1b6cc'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='fa35b1b9' id='8b006695'/>
    <typedef-decl name='spdk_msg_fn' type-id='b7f9d8e6' id='de128c99'/>
    <typedef-decl name='spdk_new_thread_fn' type-id='ced30f5e' id='cf6adfe1'/>
    <typedef-decl name='spdk_poller_fn' type-id='b9b212f5' id='6aa9ba7a'/>
    <typedef-decl name='spdk_poller_set_interrupt_mode_cb' type-id='32a99b79' id='5d15a824'/>
    <typedef-decl name='spdk_thread_op_fn' type-id='6588d7a0' id='fd7a9268'/>
    <typedef-decl name='spdk_thread_op_supported_fn' type-id='24118130' id='34a4e98f'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <pointer-type-def type-id='c11e252e' size-in-bits='64' id='24118130'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='aec5215a' const='yes' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' id='75291c35'/>
    <qualified-type-def type-id='2b1f9788' const='yes' id='d9f751c7'/>
    <pointer-type-def type-id='d9f751c7' size-in-bits='64' id='0d55f817'/>
    <qualified-type-def type-id='ef0f6b10' const='yes' id='33b441b3'/>
    <pointer-type-def type-id='33b441b3' size-in-bits='64' id='fdc343db'/>
    <pointer-type-def type-id='1a50f708' size-in-bits='64' id='029f6c42'/>
    <pointer-type-def type-id='c448161c' size-in-bits='64' id='ced30f5e'/>
    <pointer-type-def type-id='034ff13e' size-in-bits='64' id='6588d7a0'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='0a8179f4' size-in-bits='64' id='75c2ad82'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' id='d5319498'/>
    <pointer-type-def type-id='b9eb5d13' size-in-bits='64' id='aaf85c13'/>
    <pointer-type-def type-id='aaf85c13' size-in-bits='64' id='5df92dbb'/>
