<abi-corpus version='2.1' soname='libspdk_reduce.so.4.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_reduce_vol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_params' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_uuid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_print_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_readv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='reduce.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_backing_dev' size-in-bits='448' is-struct='yes' visibility='default' filepath='reduce.h' line='86' column='1' id='cac77be0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='readv' type-id='deeea449' visibility='default' filepath='reduce.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='writev' type-id='deeea449' visibility='default' filepath='reduce.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unmap' type-id='38d656d0' visibility='default' filepath='reduce.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='compress' type-id='a0eaa756' visibility='default' filepath='reduce.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decompress' type-id='a0eaa756' visibility='default' filepath='reduce.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='reduce.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='sgl_in' type-id='c894953d' visibility='default' filepath='reduce.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='424'>
        <var-decl name='sgl_out' type-id='c894953d' visibility='default' filepath='reduce.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_cb_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='reduce.h' line='80' column='1' id='e8c5eb18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='output_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='f73e6af3' visibility='default' filepath='reduce.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='reduce.h' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_params' size-in-bits='320' is-struct='yes' visibility='default' filepath='reduce.h' line='21' column='1' id='0b287997'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='reduce.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backing_io_unit_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='logical_block_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='chunk_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vol_size' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='uuid.h' line='21' column='1' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eec' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eec' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_reduce_dev_cpl' type-id='1ed1e4cd' filepath='reduce.h' line='78' column='1' id='f73e6af3'/>
    <typedef-decl name='spdk_reduce_vol_op_complete' type-id='1ed1e4cd' filepath='reduce.h' line='61' column='1' id='3d61569b'/>
    <typedef-decl name='spdk_reduce_vol_op_with_handle_complete' type-id='dfc70b88' filepath='reduce.h' line='62' column='1' id='3eca1faf'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eec' id='848d0938'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='uuid.h' line='22' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eec'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='0b287997' const='yes' id='67adba22'/>
    <pointer-type-def type-id='67adba22' size-in-bits='64' id='3e7bda98'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='cac77be0' size-in-bits='64' id='5822c6f6'/>
    <pointer-type-def type-id='cc95dfe4' size-in-bits='64' id='28881962'/>
    <pointer-type-def type-id='e8c5eb18' size-in-bits='64' id='a41aa92e'/>
    <pointer-type-def type-id='0b287997' size-in-bits='64' id='e453fa8f'/>
    <pointer-type-def type-id='df337ec4' size-in-bits='64' id='a0eaa756'/>
    <pointer-type-def type-id='a99844e5' size-in-bits='64' id='deeea449'/>
    <pointer-type-def type-id='90a823c6' size-in-bits='64' id='38d656d0'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='cb78485e' size-in-bits='64' id='dfc70b88'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_reduce_vol' is-struct='yes' visibility='default' filepath='reduce.c' line='115' column='1' is-declaration-only='yes' id='cc95dfe4'/>
    <function-decl name='spdk_reduce_vol_get_uuid' mangled-name='spdk_reduce_vol_get_uuid' filepath='reduce.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_uuid'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='277' column='1'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_init' mangled-name='spdk_reduce_vol_init' filepath='reduce.c' line='544' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_init'>
      <parameter type-id='e453fa8f' name='params' filepath='reduce.c' line='544' column='1'/>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='545' column='1'/>
      <parameter type-id='80f4b756' name='pm_file_dir' filepath='reduce.c' line='546' column='1'/>
      <parameter type-id='3eca1faf' name='cb_fn' filepath='reduce.c' line='547' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='547' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_load' mangled-name='spdk_reduce_vol_load' filepath='reduce.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_load'>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='812' column='1'/>
      <parameter type-id='3eca1faf' name='cb_fn' filepath='reduce.c' line='813' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='813' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_unload' mangled-name='spdk_reduce_vol_unload' filepath='reduce.c' line='877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_unload'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='877' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='878' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='878' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_destroy' mangled-name='spdk_reduce_vol_destroy' filepath='reduce.c' line='961' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_destroy'>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='961' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='962' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='962' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_readv' mangled-name='spdk_reduce_vol_readv' filepath='reduce.c' line='1568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_readv'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1568' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='reduce.c' line='1569' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='reduce.c' line='1569' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='reduce.c' line='1569' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='reduce.c' line='1569' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='1570' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='1570' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_writev' mangled-name='spdk_reduce_vol_writev' filepath='reduce.c' line='1657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_writev'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1657' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='reduce.c' line='1658' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='reduce.c' line='1658' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='reduce.c' line='1658' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='reduce.c' line='1658' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='1659' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='1659' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_get_params' mangled-name='spdk_reduce_vol_get_params' filepath='reduce.c' line='1709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_params'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1709' column='1'/>
      <return type-id='3e7bda98'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_print_info' mangled-name='spdk_reduce_vol_print_info' filepath='reduce.c' line='1715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_print_info'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1715' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='df337ec4'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='a99844e5'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='90a823c6'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cb78485e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='28881962'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
