<abi-corpus version='2.1' soname='libspdk_jsonrpc.so.4.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_jsonrpc_begin_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_create_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_get_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_send_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_conn_add_close_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_conn_del_close_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_end_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_end_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_get_conn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_bool_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_shutdown' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='jsonrpc_client.c' language='LANG_C99'>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <pointer-type-def type-id='658455c7' size-in-bits='64' id='63dc953f'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_jsonrpc_begin_request' mangled-name='spdk_jsonrpc_begin_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_request'>
      <parameter type-id='63dc953f' name='request'/>
      <parameter type-id='3ff5601b' name='id'/>
      <parameter type-id='80f4b756' name='method'/>
      <return type-id='b8e14bfe'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_request' mangled-name='spdk_jsonrpc_end_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_request'>
      <parameter type-id='63dc953f' name='request'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client_request' is-struct='yes' visibility='default' is-declaration-only='yes' id='658455c7'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_client_tcp.c' language='LANG_C99'>
    <class-decl name='spdk_jsonrpc_client_response' size-in-bits='256' is-struct='yes' visibility='default' id='1361d8dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='8505e504' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='8505e504' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='result' type-id='8505e504' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error' type-id='8505e504' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='9fc5272e' size-in-bits='64' id='8505e504'/>
    <pointer-type-def type-id='9d9bbaf1' size-in-bits='64' id='6137db59'/>
    <pointer-type-def type-id='1361d8dd' size-in-bits='64' id='f9dbe2ed'/>
    <function-decl name='spdk_jsonrpc_client_connect' mangled-name='spdk_jsonrpc_client_connect' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_connect'>
      <parameter type-id='80f4b756' name='addr'/>
      <parameter type-id='95e97e5e' name='addr_family'/>
      <return type-id='6137db59'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_close' mangled-name='spdk_jsonrpc_client_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_close'>
      <parameter type-id='6137db59' name='client'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_create_request' mangled-name='spdk_jsonrpc_client_create_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_create_request'>
      <return type-id='63dc953f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_request' mangled-name='spdk_jsonrpc_client_free_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_request'>
      <parameter type-id='63dc953f' name='req'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_poll' mangled-name='spdk_jsonrpc_client_poll' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_poll'>
      <parameter type-id='6137db59' name='client'/>
      <parameter type-id='95e97e5e' name='timeout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_send_request' mangled-name='spdk_jsonrpc_client_send_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_send_request'>
      <parameter type-id='6137db59' name='client'/>
      <parameter type-id='63dc953f' name='req'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_get_response' mangled-name='spdk_jsonrpc_client_get_response' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_get_response'>
      <parameter type-id='6137db59' name='client'/>
      <return type-id='f9dbe2ed'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_response' mangled-name='spdk_jsonrpc_client_free_response' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_response'>
      <parameter type-id='f9dbe2ed' name='resp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client' is-struct='yes' visibility='default' is-declaration-only='yes' id='9d9bbaf1'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='2ae61989' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b637'/>
    <pointer-type-def type-id='c4c192e4' size-in-bits='64' id='7923cb22'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61989'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_jsonrpc_request' is-struct='yes' visibility='default' is-declaration-only='yes' id='1c42476f'/>
    <class-decl name='spdk_jsonrpc_server_conn' is-struct='yes' visibility='default' is-declaration-only='yes' id='c4c192e4'/>
    <function-decl name='spdk_jsonrpc_get_conn' mangled-name='spdk_jsonrpc_get_conn' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_get_conn'>
      <parameter type-id='42a6b637' name='request'/>
      <return type-id='7923cb22'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_begin_result' mangled-name='spdk_jsonrpc_begin_result' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_result'>
      <parameter type-id='42a6b637' name='request'/>
      <return type-id='b8e14bfe'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_result' mangled-name='spdk_jsonrpc_end_result' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_result'>
      <parameter type-id='42a6b637' name='request'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_bool_response' mangled-name='spdk_jsonrpc_send_bool_response' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_bool_response'>
      <parameter type-id='42a6b637' name='request'/>
      <parameter type-id='c894953d' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response' mangled-name='spdk_jsonrpc_send_error_response' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response'>
      <parameter type-id='42a6b637' name='request'/>
      <parameter type-id='95e97e5e' name='error_code'/>
      <parameter type-id='80f4b756' name='msg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response_fmt' mangled-name='spdk_jsonrpc_send_error_response_fmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response_fmt'>
      <parameter type-id='42a6b637' name='request'/>
      <parameter type-id='95e97e5e' name='error_code'/>
      <parameter type-id='80f4b756' name='fmt'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server_tcp.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' id='f01a039e'>
      <subrange length='14' type-id='f0981eeb' id='48882d96'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__socklen_t' type-id='f0981eec' id='83f97a0a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='sa_family_t' type-id='f0981eed' id='376fda66'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' id='6b2697b0'/>
    <typedef-decl name='spdk_jsonrpc_conn_closed_fn' type-id='6ebf3e6f' id='36baf675'/>
    <typedef-decl name='spdk_jsonrpc_handle_request_fn' type-id='6bd53efe' id='3effb642'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='64' id='5c0abad8'/>
    <pointer-type-def type-id='79c1ff35' size-in-bits='64' id='3c05c735'/>
    <pointer-type-def type-id='fef343e4' size-in-bits='64' id='6bd53efe'/>
    <pointer-type-def type-id='953077c3' size-in-bits='64' id='6ebf3e6f'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_jsonrpc_server' is-struct='yes' visibility='default' is-declaration-only='yes' id='79c1ff35'/>
    <function-decl name='spdk_jsonrpc_server_listen' mangled-name='spdk_jsonrpc_server_listen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_listen'>
      <parameter type-id='95e97e5e' name='domain'/>
      <parameter type-id='95e97e5e' name='protocol'/>
      <parameter type-id='5c0abad8' name='listen_addr'/>
      <parameter type-id='6b2697b0' name='addrlen'/>
      <parameter type-id='3effb642' name='handle_request'/>
      <return type-id='3c05c735'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_server_shutdown' mangled-name='spdk_jsonrpc_server_shutdown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_shutdown'>
      <parameter type-id='3c05c735' name='server'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_conn_add_close_cb' mangled-name='spdk_jsonrpc_conn_add_close_cb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_conn_add_close_cb'>
      <parameter type-id='7923cb22' name='conn'/>
      <parameter type-id='36baf675' name='cb'/>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_conn_del_close_cb' mangled-name='spdk_jsonrpc_conn_del_close_cb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_conn_del_close_cb'>
      <parameter type-id='7923cb22' name='conn'/>
      <parameter type-id='36baf675' name='cb'/>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_server_poll' mangled-name='spdk_jsonrpc_server_poll' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_poll'>
      <parameter type-id='3c05c735' name='server'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='fef343e4'>
      <parameter type-id='42a6b637'/>
      <parameter type-id='3ee1fff1'/>
      <parameter type-id='3ee1fff1'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='953077c3'>
      <parameter type-id='7923cb22'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
