<abi-corpus version='2.1' soname='libspdk_bdev.so.11.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.2'/>
    <dependency name='libspdk_notify.so.4.0'/>
    <dependency name='libspdk_trace.so.7.1'/>
    <dependency name='libspdk_dma.so.2.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_add_io_stat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del_all' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_channel_get_histogram' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_bdev_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_unregister_by_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_wait_for_examine' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_blocks_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_zeroes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_zeroes_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zcopy_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zcopy_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_append' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_append_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_appendv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_appendv_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_management' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_bdev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_bdev_leaf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_nvme_translate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='bdev.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='spdk_bdev_claim_type' filepath='bdev_module.h' line='165' column='1' id='e323b446'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_CLAIM_NONE' value='0'/>
      <enumerator name='SPDK_BDEV_CLAIM_EXCL_WRITE' value='1'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_event_type' filepath='bdev.h' line='40' column='1' id='3add6f5a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_EVENT_REMOVE' value='0'/>
      <enumerator name='SPDK_BDEV_EVENT_RESIZE' value='1'/>
      <enumerator name='SPDK_BDEV_EVENT_MEDIA_MANAGEMENT' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_status' filepath='bdev_module.h' line='279' column='1' id='11906e0e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_AIO_ERROR' value='-8'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_ABORTED' value='-7'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FIRST_FUSED_FAILED' value='-6'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_MISCOMPARE' value='-5'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NOMEM' value='-4'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SCSI_ERROR' value='-3'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NVME_ERROR' value='-2'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FAILED' value='-1'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_PENDING' value='0'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SUCCESS' value='1'/>
      <enumerator name='SPDK_MIN_BDEV_IO_STATUS' value='-8'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_type' filepath='bdev.h' line='102' column='1' id='9cd6c10c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_READ' value='1'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE' value='2'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_UNMAP' value='3'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_FLUSH' value='4'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_RESET' value='5'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_ADMIN' value='6'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO' value='7'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO_MD' value='8'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE_ZEROES' value='9'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZCOPY' value='10'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_GET_ZONE_INFO' value='11'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_MANAGEMENT' value='12'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_APPEND' value='13'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE' value='14'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE_AND_WRITE' value='15'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ABORT' value='16'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_HOLE' value='17'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_DATA' value='18'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COPY' value='19'/>
      <enumerator name='SPDK_BDEV_NUM_IO_TYPES' value='20'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_qos_rate_limit_type' filepath='bdev.h' line='127' column='1' id='3270d5b4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_QOS_RW_IOPS_RATE_LIMIT' value='0'/>
      <enumerator name='SPDK_BDEV_QOS_RW_BPS_RATE_LIMIT' value='1'/>
      <enumerator name='SPDK_BDEV_QOS_R_BPS_RATE_LIMIT' value='2'/>
      <enumerator name='SPDK_BDEV_QOS_W_BPS_RATE_LIMIT' value='3'/>
      <enumerator name='SPDK_BDEV_QOS_NUM_RATE_LIMIT_TYPES' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_reset_stat_mode' filepath='bdev_module.h' line='1503' column='1' id='c463dc5d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_RESET_STAT_ALL' value='0'/>
      <enumerator name='SPDK_BDEV_RESET_STAT_MAXMIN' value='1'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_status' filepath='bdev.h' line='89' column='1' id='7f167725'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_BDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_BDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_zone_action' filepath='bdev_zone.h' line='34' column='1' id='85264f60'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_CLOSE' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_FINISH' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_OPEN' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_RESET' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_OFFLINE' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_dif_check_type' filepath='dif.h' line='27' column='1' id='91a2c9e2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_REFTAG' value='1'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_APPTAG' value='2'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_GUARD' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_dif_type' filepath='dif.h' line='20' column='1' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_scsi_sense' filepath='scsi_spec.h' line='43' column='1' id='00418730'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_SENSE_NO_SENSE' value='0'/>
      <enumerator name='SPDK_SCSI_SENSE_RECOVERED_ERROR' value='1'/>
      <enumerator name='SPDK_SCSI_SENSE_NOT_READY' value='2'/>
      <enumerator name='SPDK_SCSI_SENSE_MEDIUM_ERROR' value='3'/>
      <enumerator name='SPDK_SCSI_SENSE_HARDWARE_ERROR' value='4'/>
      <enumerator name='SPDK_SCSI_SENSE_ILLEGAL_REQUEST' value='5'/>
      <enumerator name='SPDK_SCSI_SENSE_UNIT_ATTENTION' value='6'/>
      <enumerator name='SPDK_SCSI_SENSE_DATA_PROTECT' value='7'/>
      <enumerator name='SPDK_SCSI_SENSE_BLANK_CHECK' value='8'/>
      <enumerator name='SPDK_SCSI_SENSE_VENDOR_SPECIFIC' value='9'/>
      <enumerator name='SPDK_SCSI_SENSE_COPY_ABORTED' value='10'/>
      <enumerator name='SPDK_SCSI_SENSE_ABORTED_COMMAND' value='11'/>
      <enumerator name='SPDK_SCSI_SENSE_VOLUME_OVERFLOW' value='13'/>
      <enumerator name='SPDK_SCSI_SENSE_MISCOMPARE' value='14'/>
    </enum-decl>
    <enum-decl name='spdk_scsi_status' filepath='scsi_spec.h' line='29' column='1' id='aabad29c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_STATUS_GOOD' value='0'/>
      <enumerator name='SPDK_SCSI_STATUS_CHECK_CONDITION' value='2'/>
      <enumerator name='SPDK_SCSI_STATUS_CONDITION_MET' value='4'/>
      <enumerator name='SPDK_SCSI_STATUS_BUSY' value='8'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE' value='16'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE_CONDITION_MET' value='20'/>
      <enumerator name='SPDK_SCSI_STATUS_RESERVATION_CONFLICT' value='24'/>
      <enumerator name='SPDK_SCSI_STATUS_Obsolete' value='34'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_SET_FULL' value='40'/>
      <enumerator name='SPDK_SCSI_STATUS_ACA_ACTIVE' value='48'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_ABORTED' value='64'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4096' id='d0b1608e'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='__bdev_internal_claim_v1' size-in-bits='64' is-struct='yes' visibility='default' filepath='bdev_module.h' line='544' column='1' id='2ed5d19b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='550' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_fields' size-in-bits='2112' is-struct='yes' visibility='default' filepath='bdev_module.h' line='516' column='1' id='0dc6d312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qos' type-id='c0bd1bdf' visibility='default' filepath='bdev_module.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qos_mod_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='7f167725' visibility='default' filepath='bdev_module.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='claim_type' type-id='e323b446' visibility='default' filepath='bdev_module.h' line='540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='claim' type-id='8de368de' visibility='default' filepath='bdev_module.h' line='552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unregister_cb' type-id='10afdbb3' visibility='default' filepath='bdev_module.h' line='555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unregister_td' type-id='f8fcfe66' visibility='default' filepath='bdev_module.h' line='561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='open_descs' type-id='e7f43f72' visibility='default' filepath='bdev_module.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='bdev_module.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reset_in_progress' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='qd_poller' type-id='bf13de54' visibility='default' filepath='bdev_module.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='qd_desc' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='period' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='new_period' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='temporary_queue_depth' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='measured_queue_depth' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='io_time' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='weighted_io_time' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='stat' type-id='08cc63f9' visibility='default' filepath='bdev_module.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='qd_poll_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1480'>
        <var-decl name='histogram_enabled' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='602' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1488'>
        <var-decl name='histogram_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='locked_ranges' type-id='905ae936' visibility='default' filepath='bdev_module.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='pending_locked_ranges' type-id='905ae936' visibility='default' filepath='bdev_module.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='bdev_name' type-id='5baf3205' visibility='default' filepath='bdev_module.h' line='614' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_io_internal_fields' size-in-bits='2496' is-struct='yes' visibility='default' filepath='bdev_module.h' line='780' column='1' id='e7a9259f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='63c91ce9' visibility='default' filepath='bdev_module.h' line='782' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_submit_ch' type-id='63c91ce9' visibility='default' filepath='bdev_module.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb' type-id='a720f07e' visibility='default' filepath='bdev_module.h' line='791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='caller_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='submit_tsc' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='error' type-id='ac5ab595' visibility='default' filepath='bdev_module.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='in_submit_request' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='830' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='status' type-id='ee31ee44' visibility='default' filepath='bdev_module.h' line='833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='buf_len' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bounce_iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bounce_md_iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='orig_md_iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='845' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='orig_iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='get_aux_buf_cb' type-id='030e7a71' visibility='default' filepath='bdev_module.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_buf_cb' type-id='cb1f5f5e' visibility='default' filepath='bdev_module.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='bdev_module.h' line='855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='buf_link' type-id='e7f43f75' visibility='default' filepath='bdev_module.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ch_link' type-id='e7f43f74' visibility='default' filepath='bdev_module.h' line='861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='iobuf' type-id='71e32ba2' visibility='default' filepath='bdev_module.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='waitq_entry' type-id='56e41d71' visibility='default' filepath='bdev_module.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='ext_opts' type-id='faf6ec89' visibility='default' filepath='bdev_module.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='ext_opts_copy' type-id='b07aafe1' visibility='default' filepath='bdev_module.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='data_transfer_cpl' type-id='1ed1e4cd' visibility='default' filepath='bdev_module.h' line='876' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_module_internal_fields' size-in-bits='320' is-struct='yes' visibility='default' filepath='bdev_module.h' line='146' column='1' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f76' visibility='default' filepath='bdev_module.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lba_range_tailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='905ae936' visibility='default' filepath='bdev_module.h' line='316' column='1' id='088b1745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default' filepath='bdev_module.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default' filepath='bdev_module.h' line='316' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev' size-in-bits='3648' is-struct='yes' visibility='default' filepath='bdev_module.h' line='318' column='1' id='f6507fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aliases' type-id='ad35c6ef' visibility='default' filepath='bdev_module.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='product_name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_cache' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='split_on_write_unit' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='write_unit_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='required_alignment' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='600'>
        <var-decl name='split_on_optimal_io_boundary' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='optimal_io_boundary' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_segment_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='max_num_segments' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='max_unmap' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_unmap_segments' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_zeroes' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='max_copy' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='bdev_module.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='md_len' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default' filepath='bdev_module.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='dif_is_head_of_md' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dif_check_flags' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='zoned' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='zone_size' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='max_zone_append_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='max_open_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_active_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='optimal_open_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='media_events' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='reset_io_drain_timeout' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='module' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='fn_table' type-id='9750090a' visibility='default' filepath='bdev_module.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='internal' type-id='0dc6d312' visibility='default' filepath='bdev_module.h' line='615' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_alias' size-in-bits='448' is-struct='yes' visibility='default' filepath='bdev_module.h' line='309' column='1' id='5b4f6d22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alias' type-id='5baf3205' visibility='default' filepath='bdev_module.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tailq' type-id='e7f43f77' visibility='default' filepath='bdev_module.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_aliases_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='bdev_module.h' line='326' column='1' id='ad35c6ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='6e513b50' visibility='default' filepath='bdev_module.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='23e0a10e' visibility='default' filepath='bdev_module.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='bdev.h' line='213' column='1' id='b07aafe1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='bdev.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='metadata' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='224' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_fn_table' size-in-bits='704' is-struct='yes' visibility='default' filepath='bdev_module.h' line='215' column='1' id='bcf92cc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='b9b212f5' visibility='default' filepath='bdev_module.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='ce046974' visibility='default' filepath='bdev_module.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_type_supported' type-id='dd06e335' visibility='default' filepath='bdev_module.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_io_channel' type-id='ddc2673d' visibility='default' filepath='bdev_module.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dump_info_json' type-id='4184f7d2' visibility='default' filepath='bdev_module.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_config_json' type-id='e4c0e0eb' visibility='default' filepath='bdev_module.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_spin_time' type-id='857b42bb' visibility='default' filepath='bdev_module.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_module_ctx' type-id='5ad9edb6' visibility='default' filepath='bdev_module.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_memory_domains' type-id='19c4f5a3' visibility='default' filepath='bdev_module.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reset_device_stat' type-id='b7f9d8e6' visibility='default' filepath='bdev_module.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dump_device_stat_json' type-id='e87c492d' visibility='default' filepath='bdev_module.h' line='275' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io' size-in-bits='7936' is-struct='yes' visibility='default' filepath='bdev_module.h' line='644' column='1' id='68ee9836'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='num_retries' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_iov' type-id='d0b1608e' visibility='default' filepath='bdev_module.h' line='658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='u' type-id='ac5ab596' visibility='default' filepath='bdev_module.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='module_link' type-id='e7f43f74' visibility='default' filepath='bdev_module.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='internal' type-id='e7a9259f' visibility='default' filepath='bdev_module.h' line='877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default' filepath='bdev_module.h' line='882' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_stat' size-in-bits='1408' is-struct='yes' visibility='default' filepath='bdev.h' line='155' column='1' id='21c89d01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bytes_read' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_read_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bytes_written' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_write_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bytes_unmapped' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_unmap_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bytes_copied' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_copy_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='max_read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='min_read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='min_write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='min_unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ticks_rate' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='io_error' type-id='0bc48c8c' visibility='default' filepath='bdev.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='bdev.h' line='1790' column='1' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='1791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='1792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='1793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f78' visibility='default' filepath='bdev.h' line='1794' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_media_event' size-in-bits='128' is-struct='yes' visibility='default' filepath='bdev.h' line='47' column='1' id='66579779'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module' size-in-bits='960' is-struct='yes' visibility='default' filepath='bdev_module.h' line='37' column='1' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default' filepath='bdev_module.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='eb9d423e' visibility='default' filepath='bdev_module.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='bdev_module.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='1db260e5' visibility='default' filepath='bdev_module.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='f1f36be0' visibility='default' filepath='bdev_module.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='f1f36be0' visibility='default' filepath='bdev_module.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default' filepath='bdev_module.h' line='161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_name' size-in-bits='320' is-struct='yes' visibility='default' filepath='bdev_module.h' line='303' column='1' id='5baf3205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f79' visibility='default' filepath='bdev_module.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='bdev.h' line='186' column='1' id='60908454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev_io_pool_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bdev_io_cache_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev_auto_examine' type-id='c894953d' visibility='default' filepath='bdev.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='reserved9' type-id='d3538ec5' visibility='default' filepath='bdev.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='small_buf_pool_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='large_buf_pool_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_histogram_data' size-in-bits='128' is-struct='yes' visibility='default' filepath='histogram_data.h' line='59' column='1' id='9e5a028f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bucket_shift' type-id='8f92235e' visibility='default' filepath='histogram_data.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bucket' type-id='5d6479ae' visibility='default' filepath='histogram_data.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='thread.h' line='972' column='1' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default' filepath='thread.h' line='973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f7a' visibility='default' filepath='thread.h' line='975' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1256' column='1' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab597' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1302' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='610' column='1' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' size-in-bits='128' is-struct='yes' visibility='default' filepath='thread.h' line='915' column='1' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='916' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='917' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='uuid.h' line='21' column='1' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab59c' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='661' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fused_iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fused_iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ext_opts' type-id='faf6ec89' visibility='default' filepath='bdev_module.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stored_user_cb' type-id='a720f07e' visibility='default' filepath='bdev_module.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='split_remaining_num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='split_current_offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='split_outstanding' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='zcopy' type-id='e7f43f7c' visibility='default' filepath='bdev_module.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='abort' type-id='e7f43f7d' visibility='default' filepath='bdev_module.h' line='716' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='seek' type-id='e7f43f7e' visibility='default' filepath='bdev_module.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='copy' type-id='e7f43f7f' visibility='default' filepath='bdev_module.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='566' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7cbf4535' visibility='default' filepath='bdev_module.h' line='566' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='311' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='6e513b50' visibility='default' filepath='bdev_module.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='23e0a10e' visibility='default' filepath='bdev_module.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='564' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3ecde4cf' visibility='default' filepath='bdev_module.h' line='564' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='738' column='1' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_to_abort' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='740' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='858' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='858' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='774' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='774' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ab7fe902' visibility='default' filepath='bdev_module.h' line='774' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev.h' line='1794' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='1794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='1794' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='160' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default' filepath='bdev_module.h' line='160' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='306' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='728' column='1' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch_ref' type-id='a7e01876' visibility='default' filepath='bdev_module.h' line='730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait_poller' type-id='e7f43f82' visibility='default' filepath='bdev_module.h' line='736' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='thread.h' line='975' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default' filepath='thread.h' line='975' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='742' column='1' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd' type-id='a0e8c12d' visibility='default' filepath='bdev_module.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nbytes' type-id='b59d7dce' visibility='default' filepath='bdev_module.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='md_len' type-id='b59d7dce' visibility='default' filepath='bdev_module.h' line='756' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='879' column='1' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='881' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='884' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='731' column='1' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='bdev_module.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stop_time_tsc' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='735' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='694' column='1' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='707' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='801' column='1' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sct' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='805' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='807' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1030' column='1' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1035' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='851' column='1' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1180' column='1' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1196' column='1' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='987' column='1' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1089' column='1' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1094' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1081' column='1' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1083' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1085' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1218' column='1' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1225' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='833' column='1' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='930' column='1' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='932' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='619' column='1' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='623' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1038' column='1' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1042' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1047' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1233' column='1' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1109' column='1' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='801' column='1' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='806' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1057' column='1' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1063' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1065' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='736' column='1' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1189' column='1' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1152' column='1' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1170' column='1' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1177' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1160' column='1' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='719' column='1' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1020' column='1' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1023' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1068' column='1' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1075' column='1' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1077' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1078' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1136' column='1' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1144' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1001' column='1' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1115' column='1' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1125' column='1' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1097' column='1' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1050' column='1' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1052' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1054' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='816' column='1' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='770' column='1' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='750' column='1' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='787' column='1' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='626' column='1' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='630' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='718' column='1' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='720' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1276' column='1' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='723' column='1' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='725' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='758' column='1' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zone_action' type-id='85264f60' visibility='default' filepath='bdev_module.h' line='766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='769' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='863' column='1' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='868' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='700' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='populate' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='commit' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='start' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='708' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='613' column='1' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='616' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='810' column='1' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sk' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='asc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ascq' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='818' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='711' column='1' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='28577a57' filepath='types.h' line='37' column='1' id='2171a512'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='int8_t' type-id='2171a512' filepath='stdint-intn.h' line='24' column='1' id='ee31ee44'/>
    <typedef-decl name='lba_range_tailq_t' type-id='088b1745' filepath='bdev_module.h' line='316' column='1' id='905ae936'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' filepath='pthreadtypes.h' line='103' column='1' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_event_cb_t' type-id='dfce451f' filepath='bdev.h' line='73' column='1' id='3de10a34'/>
    <typedef-decl name='spdk_bdev_fini_cb' type-id='b7f9d8e6' filepath='bdev.h' line='275' column='1' id='c0b39e85'/>
    <typedef-decl name='spdk_bdev_for_each_channel_done' type-id='fe752d21' filepath='bdev.h' line='2032' column='1' id='6877d703'/>
    <typedef-decl name='spdk_bdev_for_each_channel_msg' type-id='36a570ca' filepath='bdev.h' line='2022' column='1' id='8dfa98e0'/>
    <typedef-decl name='spdk_bdev_for_each_io_cb' type-id='1ed1e4cd' filepath='bdev_module.h' line='1447' column='1' id='2a89b26d'/>
    <typedef-decl name='spdk_bdev_get_current_qd_cb' type-id='8ab02eeb' filepath='bdev_module.h' line='1466' column='1' id='9ffc5ccb'/>
    <typedef-decl name='spdk_bdev_get_device_stat_cb' type-id='a82436b9' filepath='bdev.h' line='276' column='1' id='75d8d625'/>
    <typedef-decl name='spdk_bdev_histogram_data_cb' type-id='cbfe2c2f' filepath='bdev.h' line='1924' column='1' id='fb45a108'/>
    <typedef-decl name='spdk_bdev_histogram_status_cb' type-id='1ed1e4cd' filepath='bdev.h' line='1923' column='1' id='7598a612'/>
    <typedef-decl name='spdk_bdev_init_cb' type-id='1ed1e4cd' filepath='bdev.h' line='268' column='1' id='549b7513'/>
    <typedef-decl name='spdk_bdev_io_completion_cb' type-id='0818f3c5' filepath='bdev.h' line='149' column='1' id='a720f07e'/>
    <typedef-decl name='spdk_bdev_io_fn' type-id='da953866' filepath='bdev_module.h' line='1446' column='1' id='767f193c'/>
    <typedef-decl name='spdk_bdev_io_get_aux_buf_cb' type-id='47423596' filepath='bdev_module.h' line='638' column='1' id='030e7a71'/>
    <typedef-decl name='spdk_bdev_io_get_buf_cb' type-id='adc98f44' filepath='bdev_module.h' line='627' column='1' id='cb1f5f5e'/>
    <typedef-decl name='spdk_bdev_io_timeout_cb' type-id='8a3a2bff' filepath='bdev.h' line='285' column='1' id='85d4a35d'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' filepath='bdev.h' line='1785' column='1' id='065af103'/>
    <typedef-decl name='spdk_bdev_unregister_cb' type-id='1ed1e4cd' filepath='bdev_module.h' line='206' column='1' id='10afdbb3'/>
    <typedef-decl name='spdk_bdev_wait_for_examine_cb' type-id='b7f9d8e6' filepath='bdev.h' line='238' column='1' id='0cadf036'/>
    <typedef-decl name='spdk_dif_type_t' type-id='388e2dcf' filepath='bdev.c' line='4212' column='1' id='82daf048'/>
    <typedef-decl name='spdk_for_each_bdev_fn' type-id='dcd53af5' filepath='bdev.h' line='396' column='1' id='8e1b2c43'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='fa35b1b9' filepath='thread.h' line='969' column='1' id='8b006695'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='infinite' id='048fe7bc'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <union-decl name='__bdev_internal_claim' size-in-bits='64' visibility='default' filepath='bdev_module.h' line='543' column='1' id='8de368de'>
      <data-member access='public'>
        <var-decl name='v1' type-id='2ed5d19b' visibility='default' filepath='bdev_module.h' line='551' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1028' column='1' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1029' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='1036' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43f92' visibility='default' filepath='nvme_spec.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1055' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43f96' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43f9e' visibility='default' filepath='nvme_spec.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43f9f' visibility='default' filepath='nvme_spec.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43f8d' visibility='default' filepath='nvme_spec.h' line='1087' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='1107' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43f94' visibility='default' filepath='nvme_spec.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='1123' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fa0' visibility='default' filepath='nvme_spec.h' line='1145' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1149' column='1' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1150' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f99' visibility='default' filepath='nvme_spec.h' line='1158' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43f9b' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43f9a' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='1187' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43f98' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1203' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1207' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1208' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1209' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1212' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1213' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1215' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1216' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43f8e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1230' column='1' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43f93' visibility='default' filepath='nvme_spec.h' line='1252' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' filepath='nvme_spec.h' line='860' column='1' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fad' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='692' column='1' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='693' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f85' visibility='default' filepath='nvme_spec.h' line='708' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='877' column='1' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f84' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='768' column='1' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='769' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='778' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='985' column='1' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='986' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='992' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='814' column='1' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='815' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='824' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='831' column='1' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='832' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8f' visibility='default' filepath='nvme_spec.h' line='841' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='928' column='1' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='929' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f90' visibility='default' filepath='nvme_spec.h' line='933' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='734' column='1' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='735' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f97' visibility='default' filepath='nvme_spec.h' line='741' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='799' column='1' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='800' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f95' visibility='default' filepath='nvme_spec.h' line='807' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='717' column='1' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='718' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9c' visibility='default' filepath='nvme_spec.h' line='727' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='999' column='1' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='1010' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1018' column='1' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1019' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='748' column='1' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='749' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='761' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='785' column='1' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='786' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='792' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='849' column='1' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f88' visibility='default' filepath='nvme_spec.h' line='856' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='960' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='660' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='bdev' type-id='e7f43f7b' visibility='default' filepath='bdev_module.h' line='727' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='reset' type-id='e7f43f81' visibility='default' filepath='bdev_module.h' line='737' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43f80' visibility='default' filepath='bdev_module.h' line='741' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_passthru' type-id='e7f43f83' visibility='default' filepath='bdev_module.h' line='757' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='zone_mgmt' type-id='e7f43fac' visibility='default' filepath='bdev_module.h' line='770' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='800' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='nvme' type-id='e7f43f86' visibility='default' filepath='bdev_module.h' line='808' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='e7f43faf' visibility='default' filepath='bdev_module.h' line='819' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='aio_result' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='821' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1275' column='1' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fab' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='612' column='1' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fae' visibility='default' filepath='nvme_spec.h' line='617' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43f91' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1285' column='1' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default' filepath='nvme_spec.h' line='1287' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1290' column='1' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default' filepath='nvme_spec.h' line='1292' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1295' column='1' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1296' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='uuid.h' line='22' column='1' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='083b2f99' size-in-bits='64' id='dd06e335'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='f6507fdd' const='yes' id='778a632a'/>
    <pointer-type-def type-id='778a632a' size-in-bits='64' id='2ed9d900'/>
    <qualified-type-def type-id='ad35c6ef' const='yes' id='fc18994a'/>
    <pointer-type-def type-id='fc18994a' size-in-bits='64' id='3ab97220'/>
    <qualified-type-def type-id='bcf92cc1' const='yes' id='73f42124'/>
    <pointer-type-def type-id='73f42124' size-in-bits='64' id='9750090a'/>
    <qualified-type-def type-id='68ee9836' const='yes' id='0f6d3567'/>
    <pointer-type-def type-id='0f6d3567' size-in-bits='64' id='95eae837'/>
    <qualified-type-def type-id='66579779' const='yes' id='a9077006'/>
    <pointer-type-def type-id='a9077006' size-in-bits='64' id='42b59544'/>
    <qualified-type-def type-id='a0e8c12d' const='yes' id='9fe70d7e'/>
    <pointer-type-def type-id='9fe70d7e' size-in-bits='64' id='0cb9fb3c'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='276427e1' size-in-bits='64' id='1db260e5'/>
    <pointer-type-def type-id='ad11f404' size-in-bits='64' id='eb9d423e'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='35697d21' size-in-bits='64' id='dcd53af5'/>
    <pointer-type-def type-id='afa6aed4' size-in-bits='64' id='da953866'/>
    <pointer-type-def type-id='bbbd7ee8' size-in-bits='64' id='4184f7d2'/>
    <pointer-type-def type-id='4c7d72bf' size-in-bits='64' id='19c4f5a3'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='cc4b1be9' size-in-bits='64' id='5d3cb3f9'/>
    <pointer-type-def type-id='55c06e10' size-in-bits='64' id='65b579a6'/>
    <pointer-type-def type-id='65b579a6' size-in-bits='64' id='a8ae5764'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7b7cfb3d' size-in-bits='64' id='7cbf4535'/>
    <pointer-type-def type-id='5b4f6d22' size-in-bits='64' id='6e513b50'/>
    <pointer-type-def type-id='6e513b50' size-in-bits='64' id='23e0a10e'/>
    <pointer-type-def type-id='b8a34da1' size-in-bits='64' id='63c91ce9'/>
    <pointer-type-def type-id='8b0b3e5c' size-in-bits='64' id='1616ecea'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='0094857f' size-in-bits='64' id='3ecde4cf'/>
    <pointer-type-def type-id='b07aafe1' size-in-bits='64' id='faf6ec89'/>
    <pointer-type-def type-id='68ee9836' size-in-bits='64' id='378e9c1c'/>
    <pointer-type-def type-id='378e9c1c' size-in-bits='64' id='ab7fe902'/>
    <pointer-type-def type-id='50304e26' size-in-bits='64' id='0bc48c8c'/>
    <pointer-type-def type-id='21c89d01' size-in-bits='64' id='08cc63f9'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='66579779' size-in-bits='64' id='5ed322e1'/>
    <pointer-type-def type-id='3384ef92' size-in-bits='64' id='b509a840'/>
    <pointer-type-def type-id='b509a840' size-in-bits='64' id='68341ede'/>
    <pointer-type-def type-id='5baf3205' size-in-bits='64' id='b0e2c7a5'/>
    <pointer-type-def type-id='60908454' size-in-bits='64' id='f495ac72'/>
    <pointer-type-def type-id='eb57c427' size-in-bits='64' id='c0bd1bdf'/>
    <pointer-type-def type-id='9e5a028f' size-in-bits='64' id='72176057'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='ff41ade1' size-in-bits='64' id='ddc2673d'/>
    <pointer-type-def type-id='71e32ba2' size-in-bits='64' id='29210180'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='97785d3f' size-in-bits='64' id='857b42bb'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='e46f9253' size-in-bits='64' id='dfce451f'/>
    <pointer-type-def type-id='ce3367a6' size-in-bits='64' id='f1f36be0'/>
    <pointer-type-def type-id='0ea372f5' size-in-bits='64' id='a82436b9'/>
    <pointer-type-def type-id='8e4c24e7' size-in-bits='64' id='e4c0e0eb'/>
    <pointer-type-def type-id='a971260f' size-in-bits='64' id='8ab02eeb'/>
    <pointer-type-def type-id='b8266255' size-in-bits='64' id='fe752d21'/>
    <pointer-type-def type-id='c111c508' size-in-bits='64' id='36a570ca'/>
    <pointer-type-def type-id='8e4e1999' size-in-bits='64' id='0818f3c5'/>
    <pointer-type-def type-id='6e648722' size-in-bits='64' id='ce046974'/>
    <pointer-type-def type-id='340a4f32' size-in-bits='64' id='adc98f44'/>
    <pointer-type-def type-id='6f151b7c' size-in-bits='64' id='47423596'/>
    <pointer-type-def type-id='84d13285' size-in-bits='64' id='fa35b1b9'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='1b3c02f3' size-in-bits='64' id='cbfe2c2f'/>
    <pointer-type-def type-id='44b9313b' size-in-bits='64' id='8a3a2bff'/>
    <pointer-type-def type-id='4c5ca311' size-in-bits='64' id='e87c492d'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' id='5ad9edb6'/>
    <qualified-type-def type-id='95e97e5e' volatile='yes' id='e024ff18'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='lba_range' is-struct='yes' visibility='default' filepath='bdev.c' line='124' column='1' is-declaration-only='yes' id='55c06e10'/>
    <class-decl name='spdk_bdev_qos' is-struct='yes' visibility='default' filepath='bdev.c' line='171' column='1' is-declaration-only='yes' id='eb57c427'/>
    <class-decl name='spdk_bdev_channel' is-struct='yes' visibility='default' filepath='bdev.c' line='250' column='1' is-declaration-only='yes' id='b8a34da1'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' filepath='bdev.c' line='301' column='1' is-declaration-only='yes' id='43454627'/>
    <class-decl name='spdk_bdev_channel_iter' is-struct='yes' visibility='default' filepath='bdev.c' line='336' column='1' is-declaration-only='yes' id='8b0b3e5c'/>
    <class-decl name='spdk_bdev_io_error_stat' is-struct='yes' visibility='default' filepath='bdev.c' line='343' column='1' is-declaration-only='yes' id='50304e26'/>
    <function-decl name='spdk_bdev_get_opts' mangled-name='spdk_bdev_get_opts' filepath='bdev.c' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_opts'>
      <parameter type-id='f495ac72' name='opts' filepath='bdev.c' line='385' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='bdev.c' line='385' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_opts' mangled-name='spdk_bdev_set_opts' filepath='bdev.c' line='422' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_opts'>
      <parameter type-id='f495ac72' name='opts' filepath='bdev.c' line='422' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_by_name' mangled-name='spdk_bdev_get_by_name' filepath='bdev.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_by_name'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='503' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_wait_for_examine' mangled-name='spdk_bdev_wait_for_examine' filepath='bdev.c' line='571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_wait_for_examine'>
      <parameter type-id='0cadf036' name='cb_fn' filepath='bdev.c' line='571' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='571' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_examine' mangled-name='spdk_bdev_examine' filepath='bdev.c' line='691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_examine'>
      <parameter type-id='80f4b756' name='name' filepath='bdev.c' line='691' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_first' mangled-name='spdk_bdev_first' filepath='bdev.c' line='743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next' mangled-name='spdk_bdev_next' filepath='bdev.c' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next'>
      <parameter type-id='7b7cfb3d' name='prev' filepath='bdev.c' line='756' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_first_leaf' mangled-name='spdk_bdev_first_leaf' filepath='bdev.c' line='783' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first_leaf'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next_leaf' mangled-name='spdk_bdev_next_leaf' filepath='bdev.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next_leaf'>
      <parameter type-id='7b7cfb3d' name='prev' filepath='bdev.c' line='797' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_buf' mangled-name='spdk_bdev_io_set_buf' filepath='bdev.c' line='817' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='817' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='817' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='bdev.c' line='817' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_md_buf' mangled-name='spdk_bdev_io_set_md_buf' filepath='bdev.c' line='836' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_md_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='836' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='836' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='bdev.c' line='836' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_put_aux_buf' mangled-name='spdk_bdev_io_put_aux_buf' filepath='bdev.c' line='1079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_put_aux_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1079' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='1079' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_buf' mangled-name='spdk_bdev_io_get_buf' filepath='bdev.c' line='1311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1311' column='1'/>
      <parameter type-id='cb1f5f5e' name='cb' filepath='bdev.c' line='1311' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='bdev.c' line='1311' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aux_buf' mangled-name='spdk_bdev_io_get_aux_buf' filepath='bdev.c' line='1354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aux_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1354' column='1'/>
      <parameter type-id='030e7a71' name='cb' filepath='bdev.c' line='1354' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_subsystem_config_json' mangled-name='spdk_bdev_subsystem_config_json' filepath='bdev.c' line='1408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_subsystem_config_json'>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='1408' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_init_done' mangled-name='spdk_bdev_module_init_done' filepath='bdev.c' line='1588' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_init_done'>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='1588' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_examine_done' mangled-name='spdk_bdev_module_examine_done' filepath='bdev.c' line='1595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_examine_done'>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='1595' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_initialize' mangled-name='spdk_bdev_initialize' filepath='bdev.c' line='1645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_initialize'>
      <parameter type-id='549b7513' name='cb_fn' filepath='bdev.c' line='1645' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='1645' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_done' mangled-name='spdk_bdev_module_fini_done' filepath='bdev.c' line='1784' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_done'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_start_done' mangled-name='spdk_bdev_module_fini_start_done' filepath='bdev.c' line='1897' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_start_done'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_finish' mangled-name='spdk_bdev_finish' filepath='bdev.c' line='1913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_finish'>
      <parameter type-id='c0b39e85' name='cb_fn' filepath='bdev.c' line='1913' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='1913' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_free_io' mangled-name='spdk_bdev_free_io' filepath='bdev.c' line='1955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_free_io'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1955' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_type_supported' mangled-name='spdk_bdev_io_type_supported' filepath='bdev.c' line='3106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_type_supported'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='3106' column='1'/>
      <parameter type-id='9cd6c10c' name='io_type' filepath='bdev.c' line='3106' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_submit_tsc' mangled-name='spdk_bdev_io_get_submit_tsc' filepath='bdev.c' line='3127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_submit_tsc'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='3127' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_dump_info_json' mangled-name='spdk_bdev_dump_info_json' filepath='bdev.c' line='3133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_dump_info_json'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='3133' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='3133' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_timeout' mangled-name='spdk_bdev_set_timeout' filepath='bdev.c' line='3398' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_timeout'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='3398' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_in_sec' filepath='bdev.c' line='3398' column='1'/>
      <parameter type-id='85d4a35d' name='cb_fn' filepath='bdev.c' line='3399' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='3399' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_add_io_stat' mangled-name='spdk_bdev_add_io_stat' filepath='bdev.c' line='3722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_add_io_stat'>
      <parameter type-id='08cc63f9' name='total' filepath='bdev.c' line='3722' column='1'/>
      <parameter type-id='08cc63f9' name='add' filepath='bdev.c' line='3722' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_reset_io_stat' mangled-name='spdk_bdev_reset_io_stat' filepath='bdev.c' line='3774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_reset_io_stat'>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='3774' column='1'/>
      <parameter type-id='c463dc5d' name='mode' filepath='bdev.c' line='3774' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_dump_io_stat_json' mangled-name='spdk_bdev_dump_io_stat_json' filepath='bdev.c' line='3842' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_dump_io_stat_json'>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='3842' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='3842' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_add' mangled-name='spdk_bdev_alias_add' filepath='bdev.c' line='3971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_add'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='3971' column='1'/>
      <parameter type-id='80f4b756' name='alias' filepath='bdev.c' line='3971' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del' mangled-name='spdk_bdev_alias_del' filepath='bdev.c' line='4017' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4017' column='1'/>
      <parameter type-id='80f4b756' name='alias' filepath='bdev.c' line='4017' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del_all' mangled-name='spdk_bdev_alias_del_all' filepath='bdev.c' line='4030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del_all'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4030' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_channel' mangled-name='spdk_bdev_get_io_channel' filepath='bdev.c' line='4042' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_channel'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4042' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_ctx' mangled-name='spdk_bdev_get_module_ctx' filepath='bdev.c' line='4048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_ctx'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4048' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_name' mangled-name='spdk_bdev_get_module_name' filepath='bdev.c' line='4061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_name'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4061' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_name' mangled-name='spdk_bdev_get_name' filepath='bdev.c' line='4067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_name'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4067' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_product_name' mangled-name='spdk_bdev_get_product_name' filepath='bdev.c' line='4073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_product_name'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4073' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_aliases' mangled-name='spdk_bdev_get_aliases' filepath='bdev.c' line='4079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_aliases'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4079' column='1'/>
      <return type-id='3ab97220'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_block_size' mangled-name='spdk_bdev_get_block_size' filepath='bdev.c' line='4085' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_block_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4085' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_write_unit_size' mangled-name='spdk_bdev_get_write_unit_size' filepath='bdev.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_write_unit_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4091' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_num_blocks' mangled-name='spdk_bdev_get_num_blocks' filepath='bdev.c' line='4097' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_num_blocks'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4097' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rpc_type' mangled-name='spdk_bdev_get_qos_rpc_type' filepath='bdev.c' line='4103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rpc_type'>
      <parameter type-id='3270d5b4' name='type' filepath='bdev.c' line='4103' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rate_limits' mangled-name='spdk_bdev_get_qos_rate_limits' filepath='bdev.c' line='4109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rate_limits'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4109' column='1'/>
      <parameter type-id='5d6479ae' name='limits' filepath='bdev.c' line='4109' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_buf_align' mangled-name='spdk_bdev_get_buf_align' filepath='bdev.c' line='4132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_buf_align'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4132' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_optimal_io_boundary' mangled-name='spdk_bdev_get_optimal_io_boundary' filepath='bdev.c' line='4138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_optimal_io_boundary'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4138' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_has_write_cache' mangled-name='spdk_bdev_has_write_cache' filepath='bdev.c' line='4144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_has_write_cache'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4144' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_uuid' mangled-name='spdk_bdev_get_uuid' filepath='bdev.c' line='4150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_uuid'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4150' column='1'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_acwu' mangled-name='spdk_bdev_get_acwu' filepath='bdev.c' line='4156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_acwu'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4156' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_md_size' mangled-name='spdk_bdev_get_md_size' filepath='bdev.c' line='4162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_md_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4162' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_interleaved' mangled-name='spdk_bdev_is_md_interleaved' filepath='bdev.c' line='4168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_interleaved'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4168' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_separate' mangled-name='spdk_bdev_is_md_separate' filepath='bdev.c' line='4174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_separate'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4174' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_zoned' mangled-name='spdk_bdev_is_zoned' filepath='bdev.c' line='4180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_zoned'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4180' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_data_block_size' mangled-name='spdk_bdev_get_data_block_size' filepath='bdev.c' line='4186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_data_block_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4186' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_physical_block_size' mangled-name='spdk_bdev_get_physical_block_size' filepath='bdev.c' line='4196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_physical_block_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4196' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_dif_type' mangled-name='spdk_bdev_get_dif_type' filepath='bdev.c' line='4215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_dif_type'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4215' column='1'/>
      <return type-id='82daf048'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_head_of_md' mangled-name='spdk_bdev_is_dif_head_of_md' filepath='bdev.c' line='4225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_head_of_md'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4225' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_check_enabled' mangled-name='spdk_bdev_is_dif_check_enabled' filepath='bdev.c' line='4235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_check_enabled'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4235' column='1'/>
      <parameter type-id='91a2c9e2' name='check_type' filepath='bdev.c' line='4236' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_copy' mangled-name='spdk_bdev_get_max_copy' filepath='bdev.c' line='4255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_copy'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4255' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd' mangled-name='spdk_bdev_get_qd' filepath='bdev.c' line='4261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4261' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd_sampling_period' mangled-name='spdk_bdev_get_qd_sampling_period' filepath='bdev.c' line='4267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd_sampling_period'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4267' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_weighted_io_time' mangled-name='spdk_bdev_get_weighted_io_time' filepath='bdev.c' line='4273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_weighted_io_time'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4273' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_time' mangled-name='spdk_bdev_get_io_time' filepath='bdev.c' line='4279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_time'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='4279' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_qd_sampling_period' mangled-name='spdk_bdev_set_qd_sampling_period' filepath='bdev.c' line='4354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_qd_sampling_period'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4354' column='1'/>
      <parameter type-id='9c313c2d' name='period' filepath='bdev.c' line='4354' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_current_qd' mangled-name='spdk_bdev_get_current_qd' filepath='bdev.c' line='4414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_current_qd'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4414' column='1'/>
      <parameter type-id='9ffc5ccb' name='cb_fn' filepath='bdev.c' line='4414' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4415' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_notify_blockcnt_change' mangled-name='spdk_bdev_notify_blockcnt_change' filepath='bdev.c' line='4459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_notify_blockcnt_change'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4459' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='bdev.c' line='4459' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_seek_data' mangled-name='spdk_bdev_seek_data' filepath='bdev.c' line='4589' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_seek_data'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4589' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4589' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4590' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4591' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4591' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_seek_hole' mangled-name='spdk_bdev_seek_hole' filepath='bdev.c' line='4597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_seek_hole'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4597' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4597' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4598' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4599' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4599' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_seek_offset' mangled-name='spdk_bdev_io_get_seek_offset' filepath='bdev.c' line='4605' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_seek_offset'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='4605' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_read' mangled-name='spdk_bdev_read' filepath='bdev.c' line='4646' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4646' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4646' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4647' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='4647' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='bdev.c' line='4647' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4648' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4648' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks' mangled-name='spdk_bdev_read_blocks' filepath='bdev.c' line='4661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4661' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4661' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4662' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4662' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4662' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4663' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4663' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks_with_md' mangled-name='spdk_bdev_read_blocks_with_md' filepath='bdev.c' line='4669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4669' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4669' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4670' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='4670' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4670' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4670' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4671' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4671' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv' mangled-name='spdk_bdev_readv' filepath='bdev.c' line='4690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4690' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4690' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4691' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4691' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='4692' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='bdev.c' line='4692' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4693' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4693' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks' mangled-name='spdk_bdev_readv_blocks' filepath='bdev.c' line='4742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4742' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4742' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4743' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4743' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4744' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4744' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4745' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4745' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_with_md' mangled-name='spdk_bdev_readv_blocks_with_md' filepath='bdev.c' line='4752' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4752' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4752' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4753' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4753' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='4753' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4754' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4754' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4755' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4755' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_ext' mangled-name='spdk_bdev_readv_blocks_ext' filepath='bdev.c' line='4785' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_ext'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4785' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4785' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4786' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4786' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4787' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4787' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4788' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4788' column='1'/>
      <parameter type-id='faf6ec89' name='opts' filepath='bdev.c' line='4789' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write' mangled-name='spdk_bdev_write' filepath='bdev.c' line='4852' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4852' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4852' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4853' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='4853' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='bdev.c' line='4853' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4854' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4854' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks' mangled-name='spdk_bdev_write_blocks' filepath='bdev.c' line='4867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4867' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4867' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4868' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4868' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4868' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4869' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4869' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks_with_md' mangled-name='spdk_bdev_write_blocks_with_md' filepath='bdev.c' line='4876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4876' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4876' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='4877' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='4877' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4877' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4877' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4878' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4878' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev' mangled-name='spdk_bdev_writev' filepath='bdev.c' line='4938' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4938' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4938' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4939' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4939' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='4940' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='bdev.c' line='4940' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4941' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4941' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks' mangled-name='spdk_bdev_writev_blocks' filepath='bdev.c' line='4954' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4954' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4954' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4955' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4955' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4956' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4956' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4957' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4957' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_with_md' mangled-name='spdk_bdev_writev_blocks_with_md' filepath='bdev.c' line='4964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4964' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4964' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4965' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4965' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='4965' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4966' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4966' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4967' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4967' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_ext' mangled-name='spdk_bdev_writev_blocks_ext' filepath='bdev.c' line='4982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_ext'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4982' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='4982' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='4983' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='4983' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='4984' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='4984' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='4985' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4985' column='1'/>
      <parameter type-id='faf6ec89' name='opts' filepath='bdev.c' line='4986' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks' mangled-name='spdk_bdev_comparev_blocks' filepath='bdev.c' line='5111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5111' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5111' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='5112' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='5112' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5113' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5113' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5114' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5114' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks_with_md' mangled-name='spdk_bdev_comparev_blocks_with_md' filepath='bdev.c' line='5121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5121' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5121' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='5122' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='5122' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='5122' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5123' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5123' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5124' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5124' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks' mangled-name='spdk_bdev_compare_blocks' filepath='bdev.c' line='5180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5180' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5180' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='5181' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5181' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5181' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5182' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5182' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks_with_md' mangled-name='spdk_bdev_compare_blocks_with_md' filepath='bdev.c' line='5189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5189' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5189' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='5190' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='5190' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5190' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5190' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5191' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5191' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_and_writev_blocks' mangled-name='spdk_bdev_comparev_and_writev_blocks' filepath='bdev.c' line='5315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_and_writev_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5315' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5315' column='1'/>
      <parameter type-id='cc4b1be9' name='compare_iov' filepath='bdev.c' line='5316' column='1'/>
      <parameter type-id='95e97e5e' name='compare_iovcnt' filepath='bdev.c' line='5316' column='1'/>
      <parameter type-id='cc4b1be9' name='write_iov' filepath='bdev.c' line='5317' column='1'/>
      <parameter type-id='95e97e5e' name='write_iovcnt' filepath='bdev.c' line='5317' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5318' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5318' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5319' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5319' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_start' mangled-name='spdk_bdev_zcopy_start' filepath='bdev.c' line='5365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_start'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5365' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5365' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='5366' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='5366' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5367' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5367' column='1'/>
      <parameter type-id='c894953d' name='populate' filepath='bdev.c' line='5368' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5369' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5369' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_end' mangled-name='spdk_bdev_zcopy_end' filepath='bdev.c' line='5412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_end'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='5412' column='1'/>
      <parameter type-id='c894953d' name='commit' filepath='bdev.c' line='5412' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5413' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5413' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes' mangled-name='spdk_bdev_write_zeroes' filepath='bdev.c' line='5431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5431' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5431' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='5432' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='bdev.c' line='5432' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5433' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5433' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes_blocks' mangled-name='spdk_bdev_write_zeroes_blocks' filepath='bdev.c' line='5446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5446' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5446' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5447' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5447' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5448' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5448' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap' mangled-name='spdk_bdev_unmap' filepath='bdev.c' line='5496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5496' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5496' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='5497' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='bdev.c' line='5497' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5498' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5498' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap_blocks' mangled-name='spdk_bdev_unmap_blocks' filepath='bdev.c' line='5511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5511' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5511' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5512' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5512' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5513' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5513' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush' mangled-name='spdk_bdev_flush' filepath='bdev.c' line='5556' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5556' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5556' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='bdev.c' line='5557' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='bdev.c' line='5557' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5558' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5558' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush_blocks' mangled-name='spdk_bdev_flush_blocks' filepath='bdev.c' line='5571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5571' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5571' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5572' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='5572' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5573' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5573' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_reset' mangled-name='spdk_bdev_reset' filepath='bdev.c' line='5761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_reset'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5761' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5761' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5762' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5762' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_stat' mangled-name='spdk_bdev_get_io_stat' filepath='bdev.c' line='5793' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_stat'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5793' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5793' column='1'/>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='5794' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_device_stat' mangled-name='spdk_bdev_get_device_stat' filepath='bdev.c' line='5823' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_device_stat'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5823' column='1'/>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='5823' column='1'/>
      <parameter type-id='75d8d625' name='cb' filepath='bdev.c' line='5824' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5824' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_admin_passthru' mangled-name='spdk_bdev_nvme_admin_passthru' filepath='bdev.c' line='5912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_admin_passthru'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5912' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5912' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='5913' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='5913' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='5913' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5914' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5914' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru' mangled-name='spdk_bdev_nvme_io_passthru' filepath='bdev.c' line='5949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5949' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5949' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='5950' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='5950' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='5950' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5951' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5951' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru_md' mangled-name='spdk_bdev_nvme_io_passthru_md' filepath='bdev.c' line='5991' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5991' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5991' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='5992' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='5992' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='5992' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='5992' column='1'/>
      <parameter type-id='b59d7dce' name='md_len' filepath='bdev.c' line='5992' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5993' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5993' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_abort' mangled-name='spdk_bdev_abort' filepath='bdev.c' line='6213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_abort'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6213' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6213' column='1'/>
      <parameter type-id='eaa32e2f' name='bio_cb_arg' filepath='bdev.c' line='6214' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6215' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6215' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_queue_io_wait' mangled-name='spdk_bdev_queue_io_wait' filepath='bdev.c' line='6253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_queue_io_wait'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='6253' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6253' column='1'/>
      <parameter type-id='2c737c29' name='entry' filepath='bdev.c' line='6254' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete' mangled-name='spdk_bdev_io_complete' filepath='bdev.c' line='6463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6463' column='1'/>
      <parameter type-id='11906e0e' name='status' filepath='bdev.c' line='6463' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_scsi_status' mangled-name='spdk_bdev_io_complete_scsi_status' filepath='bdev.c' line='6506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_scsi_status'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6506' column='1'/>
      <parameter type-id='aabad29c' name='sc' filepath='bdev.c' line='6506' column='1'/>
      <parameter type-id='00418730' name='sk' filepath='bdev.c' line='6507' column='1'/>
      <parameter type-id='b96825af' name='asc' filepath='bdev.c' line='6507' column='1'/>
      <parameter type-id='b96825af' name='ascq' filepath='bdev.c' line='6507' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_scsi_status' mangled-name='spdk_bdev_io_get_scsi_status' filepath='bdev.c' line='6523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_scsi_status'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='6523' column='1'/>
      <parameter type-id='7292109c' name='sc' filepath='bdev.c' line='6524' column='1'/>
      <parameter type-id='7292109c' name='sk' filepath='bdev.c' line='6524' column='1'/>
      <parameter type-id='7292109c' name='asc' filepath='bdev.c' line='6524' column='1'/>
      <parameter type-id='7292109c' name='ascq' filepath='bdev.c' line='6524' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_aio_status' mangled-name='spdk_bdev_io_complete_aio_status' filepath='bdev.c' line='6557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_aio_status'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6557' column='1'/>
      <parameter type-id='95e97e5e' name='aio_result' filepath='bdev.c' line='6557' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aio_status' mangled-name='spdk_bdev_io_get_aio_status' filepath='bdev.c' line='6571' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aio_status'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='6571' column='1'/>
      <parameter type-id='7292109c' name='aio_result' filepath='bdev.c' line='6571' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_nvme_status' mangled-name='spdk_bdev_io_complete_nvme_status' filepath='bdev.c' line='6585' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_nvme_status'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6585' column='1'/>
      <parameter type-id='8f92235e' name='cdw0' filepath='bdev.c' line='6585' column='1'/>
      <parameter type-id='95e97e5e' name='sct' filepath='bdev.c' line='6585' column='1'/>
      <parameter type-id='95e97e5e' name='sc' filepath='bdev.c' line='6585' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_status' mangled-name='spdk_bdev_io_get_nvme_status' filepath='bdev.c' line='6603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_status'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='6603' column='1'/>
      <parameter type-id='90421557' name='cdw0' filepath='bdev.c' line='6603' column='1'/>
      <parameter type-id='7292109c' name='sct' filepath='bdev.c' line='6603' column='1'/>
      <parameter type-id='7292109c' name='sc' filepath='bdev.c' line='6603' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_fused_status' mangled-name='spdk_bdev_io_get_nvme_fused_status' filepath='bdev.c' line='6638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_fused_status'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='6638' column='1'/>
      <parameter type-id='90421557' name='cdw0' filepath='bdev.c' line='6638' column='1'/>
      <parameter type-id='7292109c' name='first_sct' filepath='bdev.c' line='6639' column='1'/>
      <parameter type-id='7292109c' name='first_sc' filepath='bdev.c' line='6639' column='1'/>
      <parameter type-id='7292109c' name='second_sct' filepath='bdev.c' line='6639' column='1'/>
      <parameter type-id='7292109c' name='second_sc' filepath='bdev.c' line='6639' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_thread' mangled-name='spdk_bdev_io_get_thread' filepath='bdev.c' line='6691' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_thread'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6691' column='1'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_io_channel' mangled-name='spdk_bdev_io_get_io_channel' filepath='bdev.c' line='6697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_io_channel'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6697' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_destruct_done' mangled-name='spdk_bdev_destruct_done' filepath='bdev.c' line='6849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_destruct_done'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='6849' column='1'/>
      <parameter type-id='95e97e5e' name='bdeverrno' filepath='bdev.c' line='6849' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister' mangled-name='spdk_bdev_unregister' filepath='bdev.c' line='6964' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='6964' column='1'/>
      <parameter type-id='10afdbb3' name='cb_fn' filepath='bdev.c' line='6964' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6964' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister_by_name' mangled-name='spdk_bdev_unregister_by_name' filepath='bdev.c' line='7004' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister_by_name'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='7004' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='7004' column='1'/>
      <parameter type-id='10afdbb3' name='cb_fn' filepath='bdev.c' line='7005' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7005' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_ext' mangled-name='spdk_bdev_open_ext' filepath='bdev.c' line='7141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_ext'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='7141' column='1'/>
      <parameter type-id='c894953d' name='write' filepath='bdev.c' line='7141' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='bdev.c' line='7141' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='bdev.c' line='7142' column='1'/>
      <parameter type-id='3ecde4cf' name='_desc' filepath='bdev.c' line='7142' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_close' mangled-name='spdk_bdev_close' filepath='bdev.c' line='7227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_close'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7227' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_register' mangled-name='spdk_bdev_register' filepath='bdev.c' line='7261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_register'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7261' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_claim_bdev' mangled-name='spdk_bdev_module_claim_bdev' filepath='bdev.c' line='7302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_claim_bdev'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7302' column='1'/>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7302' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='7303' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_release_bdev' mangled-name='spdk_bdev_module_release_bdev' filepath='bdev.c' line='7326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_release_bdev'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7326' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_bdev' mangled-name='spdk_bdev_desc_get_bdev' filepath='bdev.c' line='7339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_bdev'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7339' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev' mangled-name='spdk_for_each_bdev' filepath='bdev.c' line='7346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='bdev.c' line='7346' column='1'/>
      <parameter type-id='8e1b2c43' name='fn' filepath='bdev.c' line='7346' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev_leaf' mangled-name='spdk_for_each_bdev_leaf' filepath='bdev.c' line='7390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev_leaf'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='bdev.c' line='7390' column='1'/>
      <parameter type-id='8e1b2c43' name='fn' filepath='bdev.c' line='7390' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_iovec' mangled-name='spdk_bdev_io_get_iovec' filepath='bdev.c' line='7434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_iovec'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7434' column='1'/>
      <parameter type-id='5d3cb3f9' name='iovp' filepath='bdev.c' line='7434' column='1'/>
      <parameter type-id='7292109c' name='iovcntp' filepath='bdev.c' line='7434' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_md_buf' mangled-name='spdk_bdev_io_get_md_buf' filepath='bdev.c' line='7465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_md_buf'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7465' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_cb_arg' mangled-name='spdk_bdev_io_get_cb_arg' filepath='bdev.c' line='7484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_cb_arg'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7484' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_list_add' mangled-name='spdk_bdev_module_list_add' filepath='bdev.c' line='7495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_list_add'>
      <parameter type-id='b509a840' name='bdev_module' filepath='bdev.c' line='7495' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_list_find' mangled-name='spdk_bdev_module_list_find' filepath='bdev.c' line='7518' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_list_find'>
      <parameter type-id='80f4b756' name='name' filepath='bdev.c' line='7518' column='1'/>
      <return type-id='b509a840'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_qos_rate_limits' mangled-name='spdk_bdev_set_qos_rate_limits' filepath='bdev.c' line='7723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_qos_rate_limits'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7723' column='1'/>
      <parameter type-id='5d6479ae' name='limits' filepath='bdev.c' line='7723' column='1'/>
      <parameter type-id='1ed1e4cd' name='cb_fn' filepath='bdev.c' line='7724' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7724' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_histogram_enable' mangled-name='spdk_bdev_histogram_enable' filepath='bdev.c' line='7899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_histogram_enable'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7899' column='1'/>
      <parameter type-id='7598a612' name='cb_fn' filepath='bdev.c' line='7899' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7900' column='1'/>
      <parameter type-id='c894953d' name='enable' filepath='bdev.c' line='7900' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_histogram_get' mangled-name='spdk_bdev_histogram_get' filepath='bdev.c' line='7973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_histogram_get'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7973' column='1'/>
      <parameter type-id='72176057' name='histogram' filepath='bdev.c' line='7973' column='1'/>
      <parameter type-id='fb45a108' name='cb_fn' filepath='bdev.c' line='7974' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7975' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_channel_get_histogram' mangled-name='spdk_bdev_channel_get_histogram' filepath='bdev.c' line='7996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_channel_get_histogram'>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7996' column='1'/>
      <parameter type-id='fb45a108' name='cb_fn' filepath='bdev.c' line='7996' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7997' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_media_events' mangled-name='spdk_bdev_get_media_events' filepath='bdev.c' line='8011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_media_events'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='8011' column='1'/>
      <parameter type-id='5ed322e1' name='events' filepath='bdev.c' line='8011' column='1'/>
      <parameter type-id='b59d7dce' name='max_events' filepath='bdev.c' line='8012' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_bdev_push_media_events' mangled-name='spdk_bdev_push_media_events' filepath='bdev.c' line='8032' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_push_media_events'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8032' column='1'/>
      <parameter type-id='42b59544' name='events' filepath='bdev.c' line='8032' column='1'/>
      <parameter type-id='b59d7dce' name='num_events' filepath='bdev.c' line='8033' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_notify_media_management' mangled-name='spdk_bdev_notify_media_management' filepath='bdev.c' line='8072' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_notify_media_management'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8072' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_memory_domains' mangled-name='spdk_bdev_get_memory_domains' filepath='bdev.c' line='8415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_memory_domains'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8415' column='1'/>
      <parameter type-id='1fc0b044' name='domains' filepath='bdev.c' line='8415' column='1'/>
      <parameter type-id='95e97e5e' name='array_size' filepath='bdev.c' line='8416' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_for_each_bdev_io' mangled-name='spdk_bdev_for_each_bdev_io' filepath='bdev.c' line='8465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_for_each_bdev_io'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8465' column='1'/>
      <parameter type-id='eaa32e2f' name='_ctx' filepath='bdev.c' line='8465' column='1'/>
      <parameter type-id='767f193c' name='fn' filepath='bdev.c' line='8465' column='1'/>
      <parameter type-id='2a89b26d' name='cb' filepath='bdev.c' line='8466' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_for_each_channel_continue' mangled-name='spdk_bdev_for_each_channel_continue' filepath='bdev.c' line='8488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_for_each_channel_continue'>
      <parameter type-id='1616ecea' name='iter' filepath='bdev.c' line='8488' column='1'/>
      <parameter type-id='95e97e5e' name='status' filepath='bdev.c' line='8488' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_for_each_channel' mangled-name='spdk_bdev_for_each_channel' filepath='bdev.c' line='8525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_for_each_channel'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8525' column='1'/>
      <parameter type-id='8dfa98e0' name='fn' filepath='bdev.c' line='8525' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='bdev.c' line='8526' column='1'/>
      <parameter type-id='6877d703' name='cpl' filepath='bdev.c' line='8526' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_copy_blocks' mangled-name='spdk_bdev_copy_blocks' filepath='bdev.c' line='8548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_copy_blocks'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='8548' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='8548' column='1'/>
      <parameter type-id='9c313c2d' name='dst_offset_blocks' filepath='bdev.c' line='8549' column='1'/>
      <parameter type-id='9c313c2d' name='src_offset_blocks' filepath='bdev.c' line='8549' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='8549' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='8550' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='8550' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='083b2f99'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9cd6c10c'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='276427e1'>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ad11f404'>
      <parameter type-id='b8e14bfe'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='35697d21'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='afa6aed4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='bbbd7ee8'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='4c7d72bf'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='1fc0b044'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ff41ade1'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='a7e01876'/>
    </function-type>
    <function-type size-in-bits='64' id='97785d3f'>
      <parameter type-id='a7e01876'/>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='e46f9253'>
      <parameter type-id='3add6f5a'/>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='ce3367a6'>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0ea372f5'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='08cc63f9'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='8e4c24e7'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='a971260f'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='b8266255'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c111c508'>
      <parameter type-id='1616ecea'/>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='8e4e1999'>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='c894953d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6e648722'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='340a4f32'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6f151b7c'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='84d13285'>
      <parameter type-id='29210180'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='1b3c02f3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='72176057'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='44b9313b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='4c5ca311'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='bdev_zone.c' language='LANG_C99'>
    <enum-decl name='spdk_bdev_zone_state' filepath='bdev_zone.h' line='42' column='1' id='71661f17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_EMPTY' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_IMP_OPEN' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_OPEN' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_FULL' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_CLOSED' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_READ_ONLY' value='4'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_OFFLINE' value='5'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_EXP_OPEN' value='6'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_NOT_WP' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_zone_type' filepath='bdev_zone.h' line='28' column='1' id='7f630d42'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_TYPE_CNV' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_TYPE_SEQWR' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_TYPE_SEQWP' value='3'/>
    </enum-decl>
    <class-decl name='spdk_bdev_zone_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='bdev_zone.h' line='55' column='1' id='2099fa15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default' filepath='bdev_zone.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_pointer' type-id='9c313c2d' visibility='default' filepath='bdev_zone.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='capacity' type-id='9c313c2d' visibility='default' filepath='bdev_zone.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='state' type-id='71661f17' visibility='default' filepath='bdev_zone.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='type' type-id='7f630d42' visibility='default' filepath='bdev_zone.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='2099fa15' size-in-bits='64' id='7cdde6d5'/>
    <class-decl name='lba_range' is-struct='yes' visibility='default' is-declaration-only='yes' id='55c06e11'/>
    <class-decl name='spdk_bdev_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='b8a34da2'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454628'/>
    <class-decl name='spdk_bdev_io_error_stat' is-struct='yes' visibility='default' is-declaration-only='yes' id='50304e27'/>
    <class-decl name='spdk_bdev_qos' is-struct='yes' visibility='default' is-declaration-only='yes' id='eb57c428'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c1'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3ff'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b11'/>
    <function-decl name='spdk_bdev_get_zone_size' mangled-name='spdk_bdev_get_zone_size' filepath='bdev_zone.c' line='15' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='15' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_num_zones' mangled-name='spdk_bdev_get_num_zones' filepath='bdev_zone.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_num_zones'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='21' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_zone_id' mangled-name='spdk_bdev_get_zone_id' filepath='bdev_zone.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_id'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='27' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev_zone.c' line='27' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_zone_append_size' mangled-name='spdk_bdev_get_max_zone_append_size' filepath='bdev_zone.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_zone_append_size'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='43' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_open_zones' mangled-name='spdk_bdev_get_max_open_zones' filepath='bdev_zone.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_open_zones'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='49' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_active_zones' mangled-name='spdk_bdev_get_max_active_zones' filepath='bdev_zone.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_active_zones'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='55' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_optimal_open_zones' mangled-name='spdk_bdev_get_optimal_open_zones' filepath='bdev_zone.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_optimal_open_zones'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev_zone.c' line='61' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_zone_info' mangled-name='spdk_bdev_get_zone_info' filepath='bdev_zone.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_info'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='67' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='67' column='1'/>
      <parameter type-id='9c313c2d' name='zone_id' filepath='bdev_zone.c' line='68' column='1'/>
      <parameter type-id='b59d7dce' name='num_zones' filepath='bdev_zone.c' line='68' column='1'/>
      <parameter type-id='7cdde6d5' name='info' filepath='bdev_zone.c' line='68' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='69' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='69' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_management' mangled-name='spdk_bdev_zone_management' filepath='bdev_zone.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_management'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='93' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='93' column='1'/>
      <parameter type-id='9c313c2d' name='zone_id' filepath='bdev_zone.c' line='94' column='1'/>
      <parameter type-id='85264f60' name='action' filepath='bdev_zone.c' line='94' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='95' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='95' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_append' mangled-name='spdk_bdev_zone_append' filepath='bdev_zone.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_append'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='149' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='149' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev_zone.c' line='150' column='1'/>
      <parameter type-id='9c313c2d' name='start_lba' filepath='bdev_zone.c' line='150' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev_zone.c' line='150' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='151' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='151' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_append_with_md' mangled-name='spdk_bdev_zone_append_with_md' filepath='bdev_zone.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_append_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='158' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='158' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev_zone.c' line='159' column='1'/>
      <parameter type-id='eaa32e2f' name='md' filepath='bdev_zone.c' line='159' column='1'/>
      <parameter type-id='9c313c2d' name='start_lba' filepath='bdev_zone.c' line='159' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev_zone.c' line='159' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='160' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='160' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_appendv_with_md' mangled-name='spdk_bdev_zone_appendv_with_md' filepath='bdev_zone.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_appendv_with_md'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='167' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='167' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev_zone.c' line='168' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev_zone.c' line='168' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev_zone.c' line='168' column='1'/>
      <parameter type-id='9c313c2d' name='zone_id' filepath='bdev_zone.c' line='168' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev_zone.c' line='169' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='169' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='170' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_appendv' mangled-name='spdk_bdev_zone_appendv' filepath='bdev_zone.c' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_appendv'>
      <parameter type-id='0094857f' name='desc' filepath='bdev_zone.c' line='196' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev_zone.c' line='196' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='bdev_zone.c' line='197' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev_zone.c' line='197' column='1'/>
      <parameter type-id='9c313c2d' name='zone_id' filepath='bdev_zone.c' line='197' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev_zone.c' line='197' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev_zone.c' line='198' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev_zone.c' line='198' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_append_location' mangled-name='spdk_bdev_io_get_append_location' filepath='bdev_zone.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_append_location'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev_zone.c' line='205' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='part.c' language='LANG_C99'>
    <class-decl name='bdev_part_internal_fields' size-in-bits='3776' is-struct='yes' visibility='default' filepath='bdev_module.h' line='1260' column='1' id='a0706784'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='f6507fdd' visibility='default' filepath='bdev_module.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3648'>
        <var-decl name='base' type-id='948e8325' visibility='default' filepath='bdev_module.h' line='1266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='1269' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bdev_part_tailq' size-in-bits='128' is-struct='yes' visibility='default' filepath='bdev_module.h' line='1278' column='1' id='57aace16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='b2d359d7' visibility='default' filepath='bdev_module.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='7fb6a947' visibility='default' filepath='bdev_module.h' line='1278' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_part' size-in-bits='3904' is-struct='yes' visibility='default' filepath='bdev_module.h' line='1252' column='1' id='5d5897ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43fb0' visibility='default' filepath='bdev_module.h' line='1254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='a0706784' visibility='default' filepath='bdev_module.h' line='1270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_part_channel' size-in-bits='128' is-struct='yes' visibility='default' filepath='bdev_module.h' line='1273' column='1' id='424b838b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='part' type-id='b2d359d7' visibility='default' filepath='bdev_module.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base_ch' type-id='a7e01876' visibility='default' filepath='bdev_module.h' line='1275' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='1254' column='1' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b2d359d7' visibility='default' filepath='bdev_module.h' line='1254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7fb6a947' visibility='default' filepath='bdev_module.h' line='1254' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_part_base_free_fn' type-id='b7f9d8e6' filepath='bdev_module.h' line='1250' column='1' id='79353cea'/>
    <typedef-decl name='spdk_bdev_remove_cb_t' type-id='b7f9d8e6' filepath='bdev.h' line='64' column='1' id='1f14c83e'/>
    <typedef-decl name='spdk_io_channel_create_cb' type-id='585e1de9' filepath='thread.h' line='162' column='1' id='7c63ffcc'/>
    <typedef-decl name='spdk_io_channel_destroy_cb' type-id='debb4ee8' filepath='thread.h' line='170' column='1' id='7e998c02'/>
    <pointer-type-def type-id='57aace16' size-in-bits='64' id='aa57e01c'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='bcf92cc1' size-in-bits='64' id='2cac5009'/>
    <pointer-type-def type-id='5d5897ff' size-in-bits='64' id='b2d359d7'/>
    <pointer-type-def type-id='b2d359d7' size-in-bits='64' id='7fb6a947'/>
    <pointer-type-def type-id='2c424625' size-in-bits='64' id='948e8325'/>
    <pointer-type-def type-id='948e8325' size-in-bits='64' id='eb58509d'/>
    <pointer-type-def type-id='424b838b' size-in-bits='64' id='5f7b130b'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454629'/>
    <class-decl name='spdk_bdev_part_base' is-struct='yes' visibility='default' filepath='part.c' line='19' column='1' is-declaration-only='yes' id='2c424625'/>
    <function-decl name='spdk_bdev_part_base_get_bdev' mangled-name='spdk_bdev_part_base_get_bdev' filepath='part.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_bdev'>
      <parameter type-id='948e8325' name='part_base' filepath='part.c' line='37' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_desc' mangled-name='spdk_bdev_part_base_get_desc' filepath='part.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_desc'>
      <parameter type-id='948e8325' name='part_base' filepath='part.c' line='43' column='1'/>
      <return type-id='0094857f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_tailq' mangled-name='spdk_bdev_part_base_get_tailq' filepath='part.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_tailq'>
      <parameter type-id='948e8325' name='part_base' filepath='part.c' line='49' column='1'/>
      <return type-id='aa57e01c'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_ctx' mangled-name='spdk_bdev_part_base_get_ctx' filepath='part.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_ctx'>
      <parameter type-id='948e8325' name='part_base' filepath='part.c' line='55' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_bdev_name' mangled-name='spdk_bdev_part_base_get_bdev_name' filepath='part.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_bdev_name'>
      <parameter type-id='948e8325' name='part_base' filepath='part.c' line='61' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_free' mangled-name='spdk_bdev_part_base_free' filepath='part.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_free'>
      <parameter type-id='948e8325' name='base' filepath='part.c' line='75' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
