<abi-corpus version='2.1' soname='libspdk_vfu_tgt.so.1.0'>
  <elf-needed>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.2'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vfu_create_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_delete_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_get_pci_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_intx_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_msix_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_by_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_endpoint_private' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_get_vfu_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_map_one' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_register_endpoint_ops' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_set_socket_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_unmap_sg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='tgt_endpoint.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='f0981eeb' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <array-type-def dimensions='1' type-id='99021309' size-in-bits='13440' id='734814fe'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ea28250a' size-in-bits='1024' id='24a581cc'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='cap_hdr' size-in-bits='16' is-struct='yes' visibility='default' id='4e111596'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='next' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mpba' size-in-bits='32' is-struct='yes' visibility='default' id='13b7d115'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pbir' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='pbao' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='msixcap' size-in-bits='96' is-struct='yes' visibility='default' id='34cef360'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hdr' type-id='4e111596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mxc' type-id='76b62ef1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mtab' type-id='a78ceedf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mpba' type-id='13b7d115' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mtab' size-in-bits='32' is-struct='yes' visibility='default' id='a78ceedf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tbir' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='to' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mxc' size-in-bits='16' is-struct='yes' visibility='default' id='76b62ef1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ts' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='fm' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='mxe' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pc' size-in-bits='16' is-struct='yes' visibility='default' id='b7e9be2c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vs' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='pmec' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='res' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='dsi' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='auxc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='d1s' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='d2s' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='psup' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pmcap' size-in-bits='64' is-struct='yes' visibility='default' id='f74f6b06'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hdr' type-id='4e111596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pc' type-id='b7e9be2c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pmcs' type-id='592b7adc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='pmcsr_bse' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='data' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pmcs' size-in-bits='16' is-struct='yes' visibility='default' id='592b7adc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxcap' size-in-bits='480' is-struct='yes' visibility='default' id='db1684d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hdr' type-id='4e111596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pxcaps' type-id='8472c7e0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pxdcap' type-id='081647d1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pxdc' type-id='3480fe09' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='pxds' type-id='4f71c1c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='pxlcap' type-id='60615469' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pxlc' type-id='24946c91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='pxls' type-id='3f5e20e0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pxscap' type-id='2c43489a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='pxsc' type-id='5fa5b65b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='pxss' type-id='4fa59d2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='pxrc' type-id='47a9622a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='pxrcap' type-id='53e78cb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pxrs' type-id='57a97b5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='pxdcap2' type-id='9e132a59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pxdc2' type-id='e21036e1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='pxds2' type-id='0a145c8e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='pxlcap2' type-id='1437cb41' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pxlc2' type-id='13558386' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='pxls2' type-id='932daa96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='pxscap2' type-id='55eb6078' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pxsc2' type-id='fade274b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='pxss2' type-id='7ab64e5b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxcaps' size-in-bits='16' is-struct='yes' visibility='default' id='8472c7e0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ver' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='dpt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='si' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='imn' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='res1' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxdcap' size-in-bits='32' is-struct='yes' visibility='default' id='081647d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='pfs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='etfs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='l0sl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='l1l' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='res1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rer' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='res2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='csplv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='cspls' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='flrc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='res3' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxdcap2' size-in-bits='32' is-struct='yes' visibility='default' id='9e132a59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ctds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='arifs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='aors' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='aocs32' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='aocs64' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='ccs128' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='nprpr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ltrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='tphcs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='obffs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='effs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='eetps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='meetp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='res1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxds' size-in-bits='16' is-struct='yes' visibility='default' id='4f71c1c8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxds2' size-in-bits='16' is-struct='yes' visibility='default' id='0a145c8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxlc2' size-in-bits='16' is-struct='yes' visibility='default' id='13558386'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxlcap' size-in-bits='32' is-struct='yes' visibility='default' id='60615469'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxlcap2' size-in-bits='32' is-struct='yes' visibility='default' id='1437cb41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxls' size-in-bits='16' is-struct='yes' visibility='default' id='3f5e20e0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxls2' size-in-bits='16' is-struct='yes' visibility='default' id='932daa96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxrc' size-in-bits='16' is-struct='yes' visibility='default' id='47a9622a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxrcap' size-in-bits='16' is-struct='yes' visibility='default' id='53e78cb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxrs' size-in-bits='32' is-struct='yes' visibility='default' id='57a97b5a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxsc' size-in-bits='16' is-struct='yes' visibility='default' id='5fa5b65b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxsc2' size-in-bits='16' is-struct='yes' visibility='default' id='fade274b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxscap' size-in-bits='32' is-struct='yes' visibility='default' id='2c43489a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxscap2' size-in-bits='32' is-struct='yes' visibility='default' id='55eb6078'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxss' size-in-bits='16' is-struct='yes' visibility='default' id='4fa59d2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pxss2' size-in-bits='16' is-struct='yes' visibility='default' id='7ab64e5b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stuff' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_endpoint' size-in-bits='35072' is-struct='yes' visibility='default' id='fba903dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='uuid' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33280'>
        <var-decl name='ops' type-id='b2332df6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34432'>
        <var-decl name='vfu_ctx' type-id='54925d5d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34496'>
        <var-decl name='endpoint_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34560'>
        <var-decl name='accept_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34624'>
        <var-decl name='vfu_ctx_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34688'>
        <var-decl name='is_attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34752'>
        <var-decl name='msix' type-id='ea883f56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34816'>
        <var-decl name='pci_config_space' type-id='00ecb7da' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34880'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34944'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_endpoint_ops' size-in-bits='1152' is-struct='yes' visibility='default' id='b2332df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='init' type-id='8f91df7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_device_info' type-id='3d411fd3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_vendor_capability' type-id='ab594408' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attach_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='detach_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destruct' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='post_memory_add' type-id='e8c2de89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pre_memory_remove' type-id='e8c2de89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='reset_device' type-id='8260a369' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='quiesce_device' type-id='8260a369' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_device' size-in-bits='14272' is-struct='yes' visibility='default' id='1f9584df'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='class' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='pmcap' type-id='f74f6b06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='pxcap' type-id='db1684d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msixcap' type-id='34cef360' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='nr_vendor_caps' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='intr_ipin' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nr_int_irqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nr_msix_irqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='regions' type-id='734814fe' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_region' size-in-bits='1344' is-struct='yes' visibility='default' id='99021309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_sparse_mmaps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmaps' type-id='24a581cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='access_cb' type-id='82c8d56f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_sparse_mmap' size-in-bits='128' is-struct='yes' visibility='default' id='ea28250a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vfu_pci_config_space_t' size-in-bits='2048' is-struct='yes' naming-typedef-id='b3c091b5' visibility='default' id='56c30d7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='extended' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='58857d8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='0124cde5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aspmc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='rsvdp1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rcb' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ld' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='rl' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='ccc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='es' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='clkreq_en' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='hawd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='lbmie' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='labie' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='rsvdp2' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cere' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nfere' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='fere' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='urre' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ero' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='mps' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ete' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='pfe' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='appme' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ens' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='mrrs' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='iflr' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='res1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='nsfrst' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='res2' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pmee' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='dse' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='dsc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='pmes' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='did' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssid' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='did' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sid' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='comp_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='comp_timout_dis' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='ari' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='atomic_req' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='atomic_egress_block' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ido_req_en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='ido_cmp_en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='ltr_en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='obff_en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='end_end_tlp_prefix_block' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='24' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bcc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='scc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pi' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iline' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ipin' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iose' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='mse' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='bme' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='sce' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='mwie' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='vga' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='pee' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='zero' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='see' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fbe' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='id' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='res1' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='24' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pi' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='scc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bcc' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='region_type' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='locatable' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='prefetchable' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='base_address' type-id='f0981eec' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='region_type' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='base_address' type-id='f0981eec' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='res1' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='is' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='cl' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='c66' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='res2' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fbc' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dpd' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='devt' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='sta' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='rta' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='rma' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='sse' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dpe' type-id='f0981eec' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='3f7dab04' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cmd' type-id='bb0edd19' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='sts' type-id='c2c891d1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rid' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='cc' type-id='cf6b6313' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cls' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='mlt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='htype' type-id='b499d57d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='bist' type-id='fc2d8c97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bars' type-id='0a98adbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ccptr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ss' type-id='33837333' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='erom' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cap' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='424'>
        <var-decl name='res1' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='intr' type-id='d63b5440' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='mgnt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='504'>
        <var-decl name='mlat' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__loff_t' type-id='724e4de6' id='00c9d214'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' id='724e4de6'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' id='41060289'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='dma_sg_t' type-id='06003cec' id='14b05be2'/>
    <typedef-decl name='loff_t' type-id='00c9d214' id='69bf7bee'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_vfu_access_cb' type-id='3c1d4cd4' id='82c8d56f'/>
    <typedef-decl name='spdk_vfu_fini_cb' type-id='953b12f8' id='2c76d06d'/>
    <typedef-decl name='spdk_vfu_init_cb' type-id='03347643' id='c88628db'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='vfu_bar_t' type-id='969dbcc6' id='8c09f436'/>
    <typedef-decl name='vfu_ctx_t' type-id='7f626116' id='543ad5de'/>
    <typedef-decl name='vfu_pci_config_space_t' type-id='56c30d7c' id='b3c091b5'/>
    <typedef-decl name='vfu_pci_hdr_bist_t' type-id='17882ca7' id='fc2d8c97'/>
    <typedef-decl name='vfu_pci_hdr_cc_t' type-id='6dca03a3' id='cf6b6313'/>
    <typedef-decl name='vfu_pci_hdr_cmd_t' type-id='177ad5c9' id='bb0edd19'/>
    <typedef-decl name='vfu_pci_hdr_htype_t' type-id='ec04048d' id='b499d57d'/>
    <typedef-decl name='vfu_pci_hdr_id_t' type-id='19635a14' id='3f7dab04'/>
    <typedef-decl name='vfu_pci_hdr_intr_t' type-id='efbaef10' id='d63b5440'/>
    <typedef-decl name='vfu_pci_hdr_ss_t' type-id='ef299d03' id='33837333'/>
    <typedef-decl name='vfu_pci_hdr_sts_t' type-id='58bf2aa1' id='c2c891d1'/>
    <typedef-decl name='vfu_pci_hdr_t' type-id='0a671ffa' id='9a4f936a'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='512' id='b4ced8f2'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='infinite' id='048fe7bc'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <union-decl name='pxdc' size-in-bits='16' visibility='default' id='3480fe09'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f76' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pxdc2' size-in-bits='16' visibility='default' id='e21036e1'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f7a' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pxlc' size-in-bits='16' visibility='default' id='24946c91'>
