<abi-corpus version='2.1' soname='libspdk_accel.so.11.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_rpc.so.4.2'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_dma.so.2.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_accel_append_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_decrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_encrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_append_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_assign_opc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_crypto_key_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_crypto_key_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_crypto_key_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_get_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_get_opc_module_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_initialize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_module_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_module_list_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_put_buf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_sequence_reverse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_decrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_dualcast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_encrypt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_task_complete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='accel.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='accel_opcode' id='83b0f1c7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ACCEL_OPC_COPY' value='0'/>
      <enumerator name='ACCEL_OPC_FILL' value='1'/>
      <enumerator name='ACCEL_OPC_DUALCAST' value='2'/>
      <enumerator name='ACCEL_OPC_COMPARE' value='3'/>
      <enumerator name='ACCEL_OPC_CRC32C' value='4'/>
      <enumerator name='ACCEL_OPC_COPY_CRC32C' value='5'/>
      <enumerator name='ACCEL_OPC_COMPRESS' value='6'/>
      <enumerator name='ACCEL_OPC_DECOMPRESS' value='7'/>
      <enumerator name='ACCEL_OPC_ENCRYPT' value='8'/>
      <enumerator name='ACCEL_OPC_DECRYPT' value='9'/>
      <enumerator name='ACCEL_OPC_LAST' value='10'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='512' id='0a8b64b1'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_bounce_buffer' size-in-bits='384' is-struct='yes' visibility='default' id='213755d0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='orig_iovcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='orig_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='orig_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iov' type-id='0f042891' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_crypto_key' size-in-bits='768' is-struct='yes' visibility='default' id='7e6118f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priv' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key2' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='key2_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='module_if' type-id='b78a11b9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='param' type-id='ee9bdf6b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_crypto_key_create_param' size-in-bits='256' is-struct='yes' visibility='default' id='ee9bdf6b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cipher' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hex_key' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hex_key2' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key_name' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_module_if' size-in-bits='832' is-struct='yes' visibility='default' id='c7a04c81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module_fini' type-id='b7f9d8e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='write_config_json' type-id='582528d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_ctx_size' type-id='0838a534' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='supports_opcode' type-id='161d0d48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_io_channel' type-id='94a5300d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='submit_tasks' type-id='17aa1e6d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='crypto_key_init' type-id='d00898aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='crypto_key_deinit' type-id='701e506f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_memory_domains' type-id='4966e857' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_task' size-in-bits='2752' is-struct='yes' visibility='default' id='a817e78c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='accel_ch' type-id='4d4d5eba' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='e2a47d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='step_cb_fn' type-id='e7d92aa4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='step_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='src_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='src_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dst_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dst_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='s' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bounce' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='op_code' type-id='83b0f1c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='iv' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='status' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='aux_iovs' type-id='0a8b64b1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='link' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='seq_link' type-id='e7f43f76' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s' type-id='213755d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='d' type-id='213755d0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='043cb572' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='03917988' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b78a11b9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8159aa69' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='10ebab0a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2fe6360' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_accel_completion_cb' type-id='1ed1e4cd' id='e2a47d34'/>
    <typedef-decl name='spdk_accel_fini_cb' type-id='b7f9d8e6' id='e5aecfa2'/>
    <typedef-decl name='spdk_accel_step_cb' type-id='b7f9d8e6' id='e7d92aa4'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='d2' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fill_pattern' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='crypto_key' type-id='043cb572' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='d' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='s2' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='crc_dst' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='output_size' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <pointer-type-def type-id='7d858f4c' size-in-bits='64' id='4d4d5eba'/>
    <pointer-type-def type-id='6aeec1b6' size-in-bits='64' id='161d0d48'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='ee9bdf6b' const='yes' id='27a7b922'/>
    <pointer-type-def type-id='27a7b922' size-in-bits='64' id='75084798'/>
    <pointer-type-def type-id='276427e1' size-in-bits='64' id='1db260e5'/>
    <pointer-type-def type-id='1b090520' size-in-bits='64' id='d00898aa'/>
    <pointer-type-def type-id='2a0300f1' size-in-bits='64' id='17aa1e6d'/>
    <pointer-type-def type-id='1a309423' size-in-bits='64' id='4966e857'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='7e6118f4' size-in-bits='64' id='043cb572'/>
    <pointer-type-def type-id='043cb572' size-in-bits='64' id='03917988'/>
    <pointer-type-def type-id='c7a04c81' size-in-bits='64' id='b78a11b9'/>
