<abi-corpus version='2.1' soname='libspdk_scsi.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libspdk_thread.so.7.1'/>
    <dependency name='libspdk_json.so.4.1'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.2'/>
    <dependency name='libspdk_trace.so.7.1'/>
    <dependency name='libspdk_bdev.so.11.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_scsi_dev_add_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_lun_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_port' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_allocate_io_channels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_scsi_dev_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_next_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_has_pending_tasks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_queue_mgmt_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_queue_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_allocate_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_free_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_bdev_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_dif_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_id_fmt_to_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_id_int_to_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_is_removing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_set_iscsi_transport_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_build_sense_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_copy_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_gather_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_process_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_process_null_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_put' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_scatter_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_set_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dev.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2040' id='11641789'>
      <subrange length='255' type-id='f0981eeb' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <enum-decl name='spdk_scsi_pr_type_code' id='aac81fe7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_PR_WRITE_EXCLUSIVE' value='1'/>
      <enumerator name='SPDK_SCSI_PR_EXCLUSIVE_ACCESS' value='3'/>
      <enumerator name='SPDK_SCSI_PR_WRITE_EXCLUSIVE_REGS_ONLY' value='5'/>
      <enumerator name='SPDK_SCSI_PR_EXCLUSIVE_ACCESS_REGS_ONLY' value='6'/>
      <enumerator name='SPDK_SCSI_PR_WRITE_EXCLUSIVE_ALL_REGS' value='7'/>
      <enumerator name='SPDK_SCSI_PR_EXCLUSIVE_ACCESS_ALL_REGS' value='8'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='ae540668' size-in-bits='17152' id='6e8fb506'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='mgmt_tasks' size-in-bits='128' is-struct='yes' visibility='default' id='c826b319'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='12b36f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c6784462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pending_mgmt_tasks' size-in-bits='128' is-struct='yes' visibility='default' id='968673ed'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='12b36f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c6784462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='pending_tasks' size-in-bits='128' is-struct='yes' visibility='default' id='85cf9bb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='12b36f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c6784462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_dev' size-in-bits='19712' is-struct='yes' visibility='default' id='74e6cc2e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='is_allocated' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='remove_cb' type-id='d48d236f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='remove_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='name' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='luns' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='num_ports' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='port' type-id='6e8fb506' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19648'>
        <var-decl name='protocol_id' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_lun' size-in-bits='8704' is-struct='yes' visibility='default' id='1677014e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev' type-id='491ccef4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bdev_desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='io_channel' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hotremove_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='hotremove_cb' type-id='03369d06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='hotremove_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='resize_cb' type-id='03369d06' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='resize_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='reg_head' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pr_generation' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='reservation' type-id='6138fbf0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='scsi2_holder' type-id='6028f257' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7808'>
        <var-decl name='open_descs' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='tasks' type-id='1a045c75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8064'>
        <var-decl name='pending_tasks' type-id='85cf9bb9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='mgmt_tasks' type-id='c826b319' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='pending_mgmt_tasks' type-id='968673ed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='reset_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='tailq' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='resizing' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_lun_desc' size-in-bits='320' is-struct='yes' visibility='default' id='544a7a5e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lun' type-id='ae62b094' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hotremove_cb' type-id='4a415871' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hotremove_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f77' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_port' size-in-bits='4288' is-struct='yes' visibility='default' id='ae540668'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='is_used' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='index' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='transport_id_len' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_id' type-id='11641789' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2200'>
        <var-decl name='name' type-id='11641789' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_pr_registrant' size-in-bits='6528' is-struct='yes' visibility='default' id='6028f257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rkey' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='relative_target_port_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='transport_id_len' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='transport_id' type-id='11641789' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2136'>
        <var-decl name='initiator_port_name' type-id='11641789' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='target_port_name' type-id='11641789' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6272'>
        <var-decl name='initiator_port' type-id='bd4f4b0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='target_port' type-id='bd4f4b0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='link' type-id='e7f43f78' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_pr_reservation' size-in-bits='256' is-struct='yes' visibility='default' id='6138fbf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='holder' type-id='0ead57ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rtype' type-id='aac81fe7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='crkey' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_task' size-in-bits='1920' is-struct='yes' visibility='default' id='806d5c76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='function' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='response' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='ae62b094' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='target_port' type-id='bd4f4b0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initiator_port' type-id='bd4f4b0e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpl_fn' type-id='06438a61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_fn' type-id='4d4c0ac2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='transfer_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dxfer_dir' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='data_transferred' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cdb' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='iovcnt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='976'>
        <var-decl name='sense_data' type-id='d0f1c0cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='sense_data_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='bdev_io' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='scsi_link' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='abort_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='tasks' size-in-bits='128' is-struct='yes' visibility='default' id='1a045c75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='12b36f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c6784462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ae62b094' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='435c3b1a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='ae62b094' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='435c3b1a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='0029b6e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='0faac64a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0029b6e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='0faac64a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='0ead57ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='efe1444f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0ead57ff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='efe1444f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='12b36f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c6784462' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eec' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' id='065af103'/>
    <typedef-decl name='spdk_scsi_dev_destruct_cb_t' type-id='1ed1e4cd' id='d48d236f'/>
    <typedef-decl name='spdk_scsi_lun_remove_cb_t' type-id='bfecde55' id='4a415871'/>
    <typedef-decl name='spdk_scsi_task_cpl' type-id='f32ed4d9' id='06438a61'/>
    <typedef-decl name='spdk_scsi_task_free' type-id='f32ed4d9' id='4d4c0ac2'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <qualified-type-def type-id='74e6cc2e' const='yes' id='fef6abad'/>
    <pointer-type-def type-id='fef6abad' size-in-bits='64' id='e5500585'/>
    <qualified-type-def type-id='1677014e' const='yes' id='4db60f3d'/>
    <pointer-type-def type-id='4db60f3d' size-in-bits='64' id='6c99c135'/>
    <qualified-type-def type-id='ae540668' const='yes' id='3cb8ef61'/>
    <pointer-type-def type-id='3cb8ef61' size-in-bits='64' id='e220b311'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='74e6cc2e' size-in-bits='64' id='491ccef4'/>
    <pointer-type-def type-id='1677014e' size-in-bits='64' id='ae62b094'/>
    <pointer-type-def type-id='ae62b094' size-in-bits='64' id='435c3b1a'/>
    <pointer-type-def type-id='544a7a5e' size-in-bits='64' id='0029b6e4'/>
    <pointer-type-def type-id='0029b6e4' size-in-bits='64' id='0faac64a'/>
    <pointer-type-def type-id='ae540668' size-in-bits='64' id='bd4f4b0e'/>
    <pointer-type-def type-id='6028f257' size-in-bits='64' id='0ead57ff'/>
    <pointer-type-def type-id='0ead57ff' size-in-bits='64' id='efe1444f'/>
    <pointer-type-def type-id='806d5c76' size-in-bits='64' id='12b36f7c'/>
    <pointer-type-def type-id='12b36f7c' size-in-bits='64' id='c6784462'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='bb054cbc' size-in-bits='64' id='03369d06'/>
    <pointer-type-def type-id='dd5b8639' size-in-bits='64' id='bfecde55'/>
    <pointer-type-def type-id='0ed3c515' size-in-bits='64' id='f32ed4d9'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454627'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_scsi_dev_destruct' mangled-name='spdk_scsi_dev_destruct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_destruct'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='d48d236f' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun' mangled-name='spdk_scsi_dev_add_lun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <parameter type-id='95e97e5e' name='lun_id'/>
      <parameter type-id='03369d06' name='hotremove_cb'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun_ext' mangled-name='spdk_scsi_dev_add_lun_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun_ext'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <parameter type-id='95e97e5e' name='lun_id'/>
      <parameter type-id='03369d06' name='resize_cb'/>
      <parameter type-id='eaa32e2f' name='resize_ctx'/>
      <parameter type-id='03369d06' name='hotremove_cb'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_lun' mangled-name='spdk_scsi_dev_delete_lun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_lun'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='ae62b094' name='lun'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct' mangled-name='spdk_scsi_dev_construct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7d3cd834' name='bdev_name_list'/>
      <parameter type-id='7292109c' name='lun_id_list'/>
      <parameter type-id='95e97e5e' name='num_luns'/>
      <parameter type-id='b96825af' name='protocol_id'/>
      <parameter type-id='03369d06' name='hotremove_cb'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct_ext' mangled-name='spdk_scsi_dev_construct_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct_ext'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7d3cd834' name='bdev_name_list'/>
      <parameter type-id='7292109c' name='lun_id_list'/>
      <parameter type-id='95e97e5e' name='num_luns'/>
      <parameter type-id='b96825af' name='protocol_id'/>
      <parameter type-id='03369d06' name='resize_cb'/>
      <parameter type-id='eaa32e2f' name='resize_ctx'/>
      <parameter type-id='03369d06' name='hotremove_cb'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_mgmt_task' mangled-name='spdk_scsi_dev_queue_mgmt_task' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_mgmt_task'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='12b36f7c' name='task'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_task' mangled-name='spdk_scsi_dev_queue_task' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_task'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='12b36f7c' name='task'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_port' mangled-name='spdk_scsi_dev_add_port' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_port'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='9c313c2d' name='id'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_port' mangled-name='spdk_scsi_dev_delete_port' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_port'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='9c313c2d' name='id'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_find_port_by_id' mangled-name='spdk_scsi_dev_find_port_by_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_find_port_by_id'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='9c313c2d' name='id'/>
      <return type-id='bd4f4b0e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_free_io_channels' mangled-name='spdk_scsi_dev_free_io_channels' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_free_io_channels'>
      <parameter type-id='491ccef4' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_allocate_io_channels' mangled-name='spdk_scsi_dev_allocate_io_channels' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_allocate_io_channels'>
      <parameter type-id='491ccef4' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_name' mangled-name='spdk_scsi_dev_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_name'>
      <parameter type-id='e5500585' name='dev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_id' mangled-name='spdk_scsi_dev_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_id'>
      <parameter type-id='e5500585' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_lun' mangled-name='spdk_scsi_dev_get_lun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_lun'>
      <parameter type-id='491ccef4' name='dev'/>
      <parameter type-id='95e97e5e' name='lun_id'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_first_lun' mangled-name='spdk_scsi_dev_get_first_lun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_first_lun'>
      <parameter type-id='491ccef4' name='dev'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_next_lun' mangled-name='spdk_scsi_dev_get_next_lun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_next_lun'>
      <parameter type-id='ae62b094' name='prev_lun'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_has_pending_tasks' mangled-name='spdk_scsi_dev_has_pending_tasks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_has_pending_tasks'>
      <parameter type-id='e5500585' name='dev'/>
      <parameter type-id='e220b311' name='initiator_port'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-type size-in-bits='64' id='bb054cbc'>
      <parameter type-id='6c99c135'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='dd5b8639'>
      <parameter type-id='ae62b094'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0ed3c515'>
      <parameter type-id='12b36f7c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='lun.c' language='LANG_C99'>
    <enum-decl name='spdk_dif_type' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_dif_ctx' size-in-bits='384' is-struct='yes' visibility='default' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_guard' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='guard_seed' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <function-decl name='spdk_scsi_lun_open' mangled-name='spdk_scsi_lun_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_open'>
      <parameter type-id='ae62b094' name='lun'/>
      <parameter type-id='4a415871' name='hotremove_cb'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx'/>
      <parameter type-id='0faac64a' name='_desc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_close' mangled-name='spdk_scsi_lun_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_close'>
      <parameter type-id='0029b6e4' name='desc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_allocate_io_channel' mangled-name='spdk_scsi_lun_allocate_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_allocate_io_channel'>
      <parameter type-id='0029b6e4' name='desc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_free_io_channel' mangled-name='spdk_scsi_lun_free_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_free_io_channel'>
      <parameter type-id='0029b6e4' name='desc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_id' mangled-name='spdk_scsi_lun_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_id'>
      <parameter type-id='6c99c135' name='lun'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_bdev_name' mangled-name='spdk_scsi_lun_get_bdev_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_bdev_name'>
      <parameter type-id='6c99c135' name='lun'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_dev' mangled-name='spdk_scsi_lun_get_dev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_dev'>
      <parameter type-id='6c99c135' name='lun'/>
      <return type-id='e5500585'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_is_removing' mangled-name='spdk_scsi_lun_is_removing' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_is_removing'>
      <parameter type-id='6c99c135' name='lun'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_dif_ctx' mangled-name='spdk_scsi_lun_get_dif_ctx' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_dif_ctx'>
      <parameter type-id='ae62b094' name='lun'/>
      <parameter type-id='12b36f7c' name='task'/>
      <parameter type-id='a3141401' name='dif_ctx'/>
      <return type-id='c894953d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='port.c' language='LANG_C99'>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='bd4f4b0e' size-in-bits='64' id='27d349ac'/>
    <function-decl name='spdk_scsi_port_create' mangled-name='spdk_scsi_port_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_create'>
      <parameter type-id='9c313c2d' name='id'/>
      <parameter type-id='149c6638' name='index'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='bd4f4b0e'/>
    </function-decl>
    <function-decl name='spdk_scsi_port_free' mangled-name='spdk_scsi_port_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_free'>
      <parameter type-id='27d349ac' name='pport'/>
