<abi-corpus version='2.1' soname='libspdk_env_dpdk.so.11.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.1'/>
    <dependency name='libspdk_util.so.5.2'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_call_unaffinitized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_delay_us' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_pci_device_get_socket_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_subdevice_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_subvendor_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_vendor_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_is_removed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_unclaim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_driver_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_enumerate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_event_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_for_each_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_get_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_hook_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_idxd_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_ioat_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_nvme_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_register_device_provider' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_register_error_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_unhook_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_unregister_error_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_virtio_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_vmd_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_process_is_primary' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_dequeue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_enqueue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_unaffinitize_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vtophys' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='env.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_ring_type' filepath='env.h' line='559' column='1' id='3bd6ac02'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_RING_TYPE_SP_SC' value='0'/>
      <enumerator name='SPDK_RING_TYPE_MP_SC' value='1'/>
      <enumerator name='SPDK_RING_TYPE_MP_MC' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_mempool_mem_cb_t' type-id='c2cb8a3a' filepath='env.h' line='331' column='1' id='e8857a9b'/>
    <typedef-decl name='spdk_mempool_obj_cb_t' type-id='84941752' filepath='env.h' line='323' column='1' id='69ad4ac3'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='ae574a67' const='yes' id='a94dd646'/>
    <pointer-type-def type-id='a94dd646' size-in-bits='64' id='f1888c04'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='ae574a67' size-in-bits='64' id='564ba9df'/>
    <pointer-type-def type-id='e8857a9b' size-in-bits='64' id='7436b056'/>
    <pointer-type-def type-id='69ad4ac3' size-in-bits='64' id='e7553942'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' id='5ad9edb6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_mempool' is-struct='yes' visibility='default' is-declaration-only='yes' id='ae574a67'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_malloc' mangled-name='spdk_malloc' filepath='env.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_malloc'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='35' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='35' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='35' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='35' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='env.c' line='35' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_zmalloc' mangled-name='spdk_zmalloc' filepath='env.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zmalloc'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='55' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='55' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='55' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='55' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='env.c' line='55' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_realloc' mangled-name='spdk_realloc' filepath='env.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_realloc'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='75' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='75' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='75' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_free' mangled-name='spdk_free' filepath='env.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_free'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='82' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc_socket' mangled-name='spdk_dma_malloc_socket' filepath='env.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc_socket'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='88' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='88' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='88' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='88' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc_socket' mangled-name='spdk_dma_zmalloc_socket' filepath='env.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc_socket'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='94' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='94' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='94' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='94' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc' mangled-name='spdk_dma_malloc' filepath='env.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='100' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='100' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='100' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc' mangled-name='spdk_dma_zmalloc' filepath='env.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='106' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='106' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='106' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_realloc' mangled-name='spdk_dma_realloc' filepath='env.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_realloc'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='112' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='112' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='112' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='env.c' line='112' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_free' mangled-name='spdk_dma_free' filepath='env.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_free'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='125' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve_aligned' mangled-name='spdk_memzone_reserve_aligned' filepath='env.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve_aligned'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='131' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='env.c' line='131' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='131' column='1'/>
      <parameter type-id='f0981eed' name='flags' filepath='env.c' line='132' column='1'/>
      <parameter type-id='f0981eed' name='align' filepath='env.c' line='132' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve' mangled-name='spdk_memzone_reserve' filepath='env.c' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='156' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='env.c' line='156' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='156' column='1'/>
      <parameter type-id='f0981eed' name='flags' filepath='env.c' line='156' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_lookup' mangled-name='spdk_memzone_lookup' filepath='env.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_lookup'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='163' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_free' mangled-name='spdk_memzone_free' filepath='env.c' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_free'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='175' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memzone_dump' mangled-name='spdk_memzone_dump' filepath='env.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_dump'>
      <parameter type-id='822cd80b' name='f' filepath='env.c' line='187' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_create_ctor' mangled-name='spdk_mempool_create_ctor' filepath='env.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create_ctor'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='193' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='193' column='1'/>
      <parameter type-id='b59d7dce' name='ele_size' filepath='env.c' line='194' column='1'/>
      <parameter type-id='b59d7dce' name='cache_size' filepath='env.c' line='194' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='194' column='1'/>
      <parameter type-id='e7553942' name='obj_init' filepath='env.c' line='195' column='1'/>
      <parameter type-id='eaa32e2f' name='obj_init_arg' filepath='env.c' line='195' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_create' mangled-name='spdk_mempool_create' filepath='env.c' line='223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='223' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='223' column='1'/>
      <parameter type-id='b59d7dce' name='ele_size' filepath='env.c' line='224' column='1'/>
      <parameter type-id='b59d7dce' name='cache_size' filepath='env.c' line='224' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='224' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_name' mangled-name='spdk_mempool_get_name' filepath='env.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_name'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='231' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_mempool_free' mangled-name='spdk_mempool_free' filepath='env.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_free'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='237' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get' mangled-name='spdk_mempool_get' filepath='env.c' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='243' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_bulk' mangled-name='spdk_mempool_get_bulk' filepath='env.c' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_bulk'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='256' column='1'/>
      <parameter type-id='63e171df' name='ele_arr' filepath='env.c' line='256' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='256' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mempool_put' mangled-name='spdk_mempool_put' filepath='env.c' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='262' column='1'/>
      <parameter type-id='eaa32e2f' name='ele' filepath='env.c' line='262' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_put_bulk' mangled-name='spdk_mempool_put_bulk' filepath='env.c' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put_bulk'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='268' column='1'/>
      <parameter type-id='63e171df' name='ele_arr' filepath='env.c' line='268' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='268' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_count' mangled-name='spdk_mempool_count' filepath='env.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_count'>
      <parameter type-id='f1888c04' name='pool' filepath='env.c' line='274' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_mempool_obj_iter' mangled-name='spdk_mempool_obj_iter' filepath='env.c' line='280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_obj_iter'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='280' column='1'/>
      <parameter type-id='e7553942' name='obj_cb' filepath='env.c' line='280' column='1'/>
      <parameter type-id='eaa32e2f' name='obj_cb_arg' filepath='env.c' line='281' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_mem_iter' mangled-name='spdk_mempool_mem_iter' filepath='env.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_mem_iter'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='303' column='1'/>
      <parameter type-id='7436b056' name='mem_cb' filepath='env.c' line='303' column='1'/>
      <parameter type-id='eaa32e2f' name='mem_cb_arg' filepath='env.c' line='304' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_lookup' mangled-name='spdk_mempool_lookup' filepath='env.c' line='315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_lookup'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='315' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_process_is_primary' mangled-name='spdk_process_is_primary' filepath='env.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_process_is_primary'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks' mangled-name='spdk_get_ticks' filepath='env.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks_hz' mangled-name='spdk_get_ticks_hz' filepath='env.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks_hz'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_delay_us' mangled-name='spdk_delay_us' filepath='env.c' line='339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_delay_us'>
      <parameter type-id='f0981eed' name='us' filepath='env.c' line='339' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pause' mangled-name='spdk_pause' filepath='env.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pause'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_unaffinitize_thread' mangled-name='spdk_unaffinitize_thread' filepath='env.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unaffinitize_thread'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_call_unaffinitized' mangled-name='spdk_call_unaffinitized' filepath='env.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_call_unaffinitized'>
      <parameter type-id='5ad9edb6' name='cb' filepath='env.c' line='369' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='env.c' line='369' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_ring_create' mangled-name='spdk_ring_create' filepath='env.c' line='390' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_create'>
      <parameter type-id='3bd6ac02' name='type' filepath='env.c' line='390' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='390' column='1'/>
      <parameter type-id='95e97e5e' name='socket_id' filepath='env.c' line='390' column='1'/>
      <return type-id='b2192338'/>
    </function-decl>
    <function-decl name='spdk_ring_free' mangled-name='spdk_ring_free' filepath='env.c' line='417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_free'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='417' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ring_count' mangled-name='spdk_ring_count' filepath='env.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_count'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='423' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_enqueue' mangled-name='spdk_ring_enqueue' filepath='env.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_enqueue'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='429' column='1'/>
      <parameter type-id='63e171df' name='objs' filepath='env.c' line='429' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='429' column='1'/>
      <parameter type-id='78c01427' name='free_space' filepath='env.c' line='430' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_dequeue' mangled-name='spdk_ring_dequeue' filepath='env.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_dequeue'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='437' column='1'/>
      <parameter type-id='63e171df' name='objs' filepath='env.c' line='437' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='437' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_dump_mem_stats' mangled-name='spdk_env_dpdk_dump_mem_stats' filepath='env.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_dump_mem_stats'>
      <parameter type-id='822cd80b' name='file' filepath='env.c' line='443' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='84941752'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c2cb8a3a'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='init.c' language='LANG_C99'>
    <class-decl name='spdk_env_opts' size-in-bits='832' is-struct='yes' visibility='default' filepath='env.h' line='47' column='1' id='ca9dface'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='env.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_mask' type-id='80f4b756' visibility='default' filepath='env.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='shm_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='mem_channel' type-id='95e97e5e' visibility='default' filepath='env.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='main_core' type-id='95e97e5e' visibility='default' filepath='env.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mem_size' type-id='95e97e5e' visibility='default' filepath='env.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='no_pci' type-id='c894953d' visibility='default' filepath='env.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='hugepage_single_segments' type-id='c894953d' visibility='default' filepath='env.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='unlink_hugepage' type-id='c894953d' visibility='default' filepath='env.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_pci_addr' type-id='b59d7dce' visibility='default' filepath='env.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='hugedir' type-id='80f4b756' visibility='default' filepath='env.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pci_blocked' type-id='a714fad8' visibility='default' filepath='env.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pci_allowed' type-id='a714fad8' visibility='default' filepath='env.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='iova_mode' type-id='80f4b756' visibility='default' filepath='env.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='base_virtaddr' type-id='9c313c2d' visibility='default' filepath='env.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='env_context' type-id='eaa32e2f' visibility='default' filepath='env.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='vf_token' type-id='80f4b756' visibility='default' filepath='env.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='ca9dface' const='yes' id='d4ecc0a1'/>
    <pointer-type-def type-id='d4ecc0a1' size-in-bits='64' id='bbb31ad1'/>
    <pointer-type-def type-id='ca9dface' size-in-bits='64' id='52dba564'/>
    <function-decl name='spdk_env_opts_init' mangled-name='spdk_env_opts_init' filepath='init.c' line='92' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_opts_init'>
      <parameter type-id='52dba564' name='opts' filepath='init.c' line='92' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_init' mangled-name='spdk_env_dpdk_post_init' filepath='init.c' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_init'>
      <parameter type-id='c894953d' name='legacy_mem' filepath='init.c' line='491' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_fini' mangled-name='spdk_env_dpdk_post_fini' filepath='init.c' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_init' mangled-name='spdk_env_init' filepath='init.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_init'>
      <parameter type-id='bbb31ad1' name='opts' filepath='init.c' line='527' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_fini' mangled-name='spdk_env_fini' filepath='init.c' line='635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_external_init' mangled-name='spdk_env_dpdk_external_init' filepath='init.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_external_init'>
      <return type-id='c894953d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='memory.c' language='LANG_C99'>
    <enum-decl name='spdk_mem_map_notify_action' filepath='env.h' line='1255' column='1' id='4c36f7b6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_REGISTER' value='0'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_UNREGISTER' value='1'/>
    </enum-decl>
    <class-decl name='spdk_mem_map_ops' size-in-bits='128' is-struct='yes' visibility='default' filepath='env.h' line='1269' column='1' id='23691567'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='notify_cb' type-id='3d8a3989' visibility='default' filepath='env.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='are_contiguous' type-id='8cf6f4bf' visibility='default' filepath='env.h' line='1271' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_mem_map_contiguous_translations' type-id='0f094131' filepath='env.h' line='1264' column='1' id='8cf6f4bf'/>
    <typedef-decl name='spdk_mem_map_notify_cb' type-id='bc7911b1' filepath='env.h' line='1260' column='1' id='3d8a3989'/>
    <qualified-type-def type-id='ba933a44' const='yes' id='36a99011'/>
    <pointer-type-def type-id='36a99011' size-in-bits='64' id='47ee0ce1'/>
    <qualified-type-def type-id='23691567' const='yes' id='a2fd39ea'/>
    <pointer-type-def type-id='a2fd39ea' size-in-bits='64' id='54a1e940'/>
    <pointer-type-def type-id='888809fd' size-in-bits='64' id='0f094131'/>
    <pointer-type-def type-id='9c62c91d' size-in-bits='64' id='bc7911b1'/>
    <pointer-type-def type-id='ba933a44' size-in-bits='64' id='73c19462'/>
    <pointer-type-def type-id='73c19462' size-in-bits='64' id='81bc6d58'/>
    <class-decl name='spdk_mem_map' is-struct='yes' visibility='default' filepath='memory.c' line='100' column='1' is-declaration-only='yes' id='ba933a44'/>
    <function-decl name='spdk_mem_map_alloc' mangled-name='spdk_mem_map_alloc' filepath='memory.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_alloc'>
      <parameter type-id='9c313c2d' name='default_translation' filepath='memory.c' line='255' column='1'/>
      <parameter type-id='54a1e940' name='ops' filepath='memory.c' line='255' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='memory.c' line='255' column='1'/>
      <return type-id='73c19462'/>
    </function-decl>
    <function-decl name='spdk_mem_map_free' mangled-name='spdk_mem_map_free' filepath='memory.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_free'>
      <parameter type-id='81bc6d58' name='pmap' filepath='memory.c' line='298' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mem_register' mangled-name='spdk_mem_register' filepath='memory.c' line='331' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_register'>
      <parameter type-id='eaa32e2f' name='vaddr' filepath='memory.c' line='331' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='memory.c' line='331' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_unregister' mangled-name='spdk_mem_unregister' filepath='memory.c' line='391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_unregister'>
      <parameter type-id='eaa32e2f' name='vaddr' filepath='memory.c' line='391' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='memory.c' line='391' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_set_translation' mangled-name='spdk_mem_map_set_translation' filepath='memory.c' line='574' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_set_translation'>
      <parameter type-id='73c19462' name='map' filepath='memory.c' line='574' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='574' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='memory.c' line='574' column='1'/>
      <parameter type-id='9c313c2d' name='translation' filepath='memory.c' line='575' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_clear_translation' mangled-name='spdk_mem_map_clear_translation' filepath='memory.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_clear_translation'>
      <parameter type-id='73c19462' name='map' filepath='memory.c' line='615' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='615' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='memory.c' line='615' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_translate' mangled-name='spdk_mem_map_translate' filepath='memory.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_translate'>
      <parameter type-id='47ee0ce1' name='map' filepath='memory.c' line='621' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='621' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='memory.c' line='621' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_iommu_is_enabled' mangled-name='spdk_iommu_is_enabled' filepath='memory.c' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iommu_is_enabled'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_vtophys' mangled-name='spdk_vtophys' filepath='memory.c' line='1502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vtophys'>
      <parameter type-id='eaa32e2f' name='buf' filepath='memory.c' line='1502' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='memory.c' line='1502' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_mem_get_fd_and_offset' mangled-name='spdk_mem_get_fd_and_offset' filepath='memory.c' line='1524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_get_fd_and_offset'>
      <parameter type-id='eaa32e2f' name='vaddr' filepath='memory.c' line='1524' column='1'/>
      <parameter type-id='5d6479ae' name='offset' filepath='memory.c' line='1524' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='888809fd'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9c62c91d'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='73c19462'/>
      <parameter type-id='4c36f7b6'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci.c' language='LANG_C99'>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' filepath='env.h' line='678' column='1' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='690' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='env.h' line='639' column='1' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='643' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' filepath='env.h' line='661' column='1' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default' filepath='env.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default' filepath='env.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default' filepath='env.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default' filepath='env.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='691' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device_provider' size-in-bits='320' is-struct='yes' visibility='default' filepath='env.h' line='1195' column='1' id='dec91549'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='env.h' line='1196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attach_cb' type-id='e3c341c5' visibility='default' filepath='env.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='detach_cb' type-id='ce0b566a' visibility='default' filepath='env.h' line='1214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='env.h' line='1216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='env.h' line='646' column='1' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='648' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='651' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='env.h' line='690' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='690' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='env.h' line='1216' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='35ee3f91' visibility='default' filepath='env.h' line='1216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a10e5361' visibility='default' filepath='env.h' line='1216' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eec' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='spdk_pci_enum_cb' type-id='5761ccbf' filepath='env.h' line='704' column='1' id='963d1819'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <qualified-type-def type-id='ec72f59a' const='yes' id='e81a0cd5'/>
    <pointer-type-def type-id='e81a0cd5' size-in-bits='64' id='6002756d'/>
    <qualified-type-def type-id='86ef9a2b' const='yes' id='a69f6a68'/>
    <pointer-type-def type-id='a69f6a68' size-in-bits='64' id='8ef445e6'/>
    <pointer-type-def type-id='630f2781' size-in-bits='64' id='e3c341c5'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='7c9d37e3' size-in-bits='64' id='5761ccbf'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' id='a714fad8'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='dec91549' size-in-bits='64' id='35ee3f91'/>
    <pointer-type-def type-id='35ee3f91' size-in-bits='64' id='a10e5361'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='a41463d8' size-in-bits='64' id='1f08f56e'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='8382c070' size-in-bits='64' id='ce0b566a'/>
    <pointer-type-def type-id='28bf3cba' size-in-bits='64' id='6c70ec84'/>
    <function-decl name='spdk_pci_driver_register' mangled-name='spdk_pci_driver_register' filepath='pci.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_driver_register'>
      <parameter type-id='80f4b756' name='name' filepath='pci.c' line='181' column='1'/>
      <parameter type-id='1f08f56e' name='id_table' filepath='pci.c' line='181' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='pci.c' line='181' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_nvme_get_driver' mangled-name='spdk_pci_nvme_get_driver' filepath='pci.c' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_nvme_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_get_driver' mangled-name='spdk_pci_get_driver' filepath='pci.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_driver'>
      <parameter type-id='80f4b756' name='name' filepath='pci.c' line='205' column='1'/>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_device_detach' mangled-name='spdk_pci_device_detach' filepath='pci.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_detach'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='480' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_attach' mangled-name='spdk_pci_device_attach' filepath='pci.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_attach'>
      <parameter type-id='a10bedff' name='driver' filepath='pci.c' line='595' column='1'/>
      <parameter type-id='963d1819' name='enum_cb' filepath='pci.c' line='596' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='pci.c' line='597' column='1'/>
      <parameter type-id='a714fad8' name='pci_address' filepath='pci.c' line='597' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_enumerate' mangled-name='spdk_pci_enumerate' filepath='pci.c' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_enumerate'>
      <parameter type-id='a10bedff' name='driver' filepath='pci.c' line='675' column='1'/>
      <parameter type-id='963d1819' name='enum_cb' filepath='pci.c' line='676' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='pci.c' line='677' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_for_each_device' mangled-name='spdk_pci_for_each_device' filepath='pci.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_for_each_device'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='pci.c' line='723' column='1'/>
      <parameter type-id='6c70ec84' name='fn' filepath='pci.c' line='723' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_map_bar' mangled-name='spdk_pci_device_map_bar' filepath='pci.c' line='735' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_map_bar'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='735' column='1'/>
      <parameter type-id='8f92235e' name='bar' filepath='pci.c' line='735' column='1'/>
      <parameter type-id='63e171df' name='mapped_addr' filepath='pci.c' line='736' column='1'/>
      <parameter type-id='5d6479ae' name='phys_addr' filepath='pci.c' line='736' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='pci.c' line='736' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unmap_bar' mangled-name='spdk_pci_device_unmap_bar' filepath='pci.c' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unmap_bar'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='773' column='1'/>
      <parameter type-id='8f92235e' name='bar' filepath='pci.c' line='773' column='1'/>
      <parameter type-id='eaa32e2f' name='addr' filepath='pci.c' line='773' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_enable_interrupt' mangled-name='spdk_pci_device_enable_interrupt' filepath='pci.c' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_enable_interrupt'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='790' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_disable_interrupt' mangled-name='spdk_pci_device_disable_interrupt' filepath='pci.c' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_disable_interrupt'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='796' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_interrupt_efd' mangled-name='spdk_pci_device_get_interrupt_efd' filepath='pci.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_interrupt_efd'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='802' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_domain' mangled-name='spdk_pci_device_get_domain' filepath='pci.c' line='808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_domain'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='808' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_bus' mangled-name='spdk_pci_device_get_bus' filepath='pci.c' line='814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_bus'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='814' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_dev' mangled-name='spdk_pci_device_get_dev' filepath='pci.c' line='820' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_dev'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='820' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_func' mangled-name='spdk_pci_device_get_func' filepath='pci.c' line='826' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_func'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='826' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_vendor_id' mangled-name='spdk_pci_device_get_vendor_id' filepath='pci.c' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_vendor_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='832' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_device_id' mangled-name='spdk_pci_device_get_device_id' filepath='pci.c' line='838' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_device_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='838' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subvendor_id' mangled-name='spdk_pci_device_get_subvendor_id' filepath='pci.c' line='844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subvendor_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='844' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subdevice_id' mangled-name='spdk_pci_device_get_subdevice_id' filepath='pci.c' line='850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subdevice_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='850' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_id' mangled-name='spdk_pci_device_get_id' filepath='pci.c' line='856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='856' column='1'/>
      <return type-id='a41463d8'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_socket_id' mangled-name='spdk_pci_device_get_socket_id' filepath='pci.c' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_socket_id'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='862' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read' mangled-name='spdk_pci_device_cfg_read' filepath='pci.c' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='868' column='1'/>
      <parameter type-id='eaa32e2f' name='value' filepath='pci.c' line='868' column='1'/>
      <parameter type-id='8f92235e' name='len' filepath='pci.c' line='868' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='868' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write' mangled-name='spdk_pci_device_cfg_write' filepath='pci.c' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='874' column='1'/>
      <parameter type-id='eaa32e2f' name='value' filepath='pci.c' line='874' column='1'/>
      <parameter type-id='8f92235e' name='len' filepath='pci.c' line='874' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='874' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read8' mangled-name='spdk_pci_device_cfg_read8' filepath='pci.c' line='880' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read8'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='880' column='1'/>
      <parameter type-id='ae3e8ca6' name='value' filepath='pci.c' line='880' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='880' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write8' mangled-name='spdk_pci_device_cfg_write8' filepath='pci.c' line='886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write8'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='886' column='1'/>
      <parameter type-id='b96825af' name='value' filepath='pci.c' line='886' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='886' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read16' mangled-name='spdk_pci_device_cfg_read16' filepath='pci.c' line='892' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read16'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='892' column='1'/>
      <parameter type-id='8a121f49' name='value' filepath='pci.c' line='892' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='892' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write16' mangled-name='spdk_pci_device_cfg_write16' filepath='pci.c' line='898' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write16'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='898' column='1'/>
      <parameter type-id='149c6638' name='value' filepath='pci.c' line='898' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='898' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read32' mangled-name='spdk_pci_device_cfg_read32' filepath='pci.c' line='904' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read32'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='904' column='1'/>
      <parameter type-id='90421557' name='value' filepath='pci.c' line='904' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='904' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write32' mangled-name='spdk_pci_device_cfg_write32' filepath='pci.c' line='910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write32'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='910' column='1'/>
      <parameter type-id='8f92235e' name='value' filepath='pci.c' line='910' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='910' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_serial_number' mangled-name='spdk_pci_device_get_serial_number' filepath='pci.c' line='916' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_serial_number'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='916' column='1'/>
      <parameter type-id='26a90f95' name='sn' filepath='pci.c' line='916' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='pci.c' line='916' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_addr' mangled-name='spdk_pci_device_get_addr' filepath='pci.c' line='961' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_addr'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='961' column='1'/>
      <return type-id='ec72f59a'/>
    </function-decl>
    <function-decl name='spdk_pci_device_is_removed' mangled-name='spdk_pci_device_is_removed' filepath='pci.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_is_removed'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='967' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_compare' mangled-name='spdk_pci_addr_compare' filepath='pci.c' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_compare'>
      <parameter type-id='6002756d' name='a1' filepath='pci.c' line='973' column='1'/>
      <parameter type-id='6002756d' name='a2' filepath='pci.c' line='973' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_claim' mangled-name='spdk_pci_device_claim' filepath='pci.c' line='998' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_claim'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='998' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unclaim' mangled-name='spdk_pci_device_unclaim' filepath='pci.c' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unclaim'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1052' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_parse' mangled-name='spdk_pci_addr_parse' filepath='pci.c' line='1079' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_parse'>
      <parameter type-id='a714fad8' name='addr' filepath='pci.c' line='1079' column='1'/>
      <parameter type-id='80f4b756' name='bdf' filepath='pci.c' line='1079' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_fmt' mangled-name='spdk_pci_addr_fmt' filepath='pci.c' line='1116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_fmt'>
      <parameter type-id='26a90f95' name='bdf' filepath='pci.c' line='1116' column='1'/>
      <parameter type-id='b59d7dce' name='sz' filepath='pci.c' line='1116' column='1'/>
      <parameter type-id='6002756d' name='addr' filepath='pci.c' line='1116' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_hook_device' mangled-name='spdk_pci_hook_device' filepath='pci.c' line='1132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_hook_device'>
      <parameter type-id='a10bedff' name='drv' filepath='pci.c' line='1132' column='1'/>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1132' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_unhook_device' mangled-name='spdk_pci_unhook_device' filepath='pci.c' line='1157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_unhook_device'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1157' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_register_device_provider' mangled-name='spdk_pci_register_device_provider' filepath='pci.c' line='1164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_device_provider'>
      <parameter type-id='35ee3f91' name='provider' filepath='pci.c' line='1164' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_type' mangled-name='spdk_pci_device_get_type' filepath='pci.c' line='1170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_type'>
      <parameter type-id='8ef445e6' name='dev' filepath='pci.c' line='1170' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_pci_device_allow' mangled-name='spdk_pci_device_allow' filepath='pci.c' line='1176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_allow'>
      <parameter type-id='a714fad8' name='pci_addr' filepath='pci.c' line='1176' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' filepath='pci_dpdk.h' line='17' column='1' is-declaration-only='yes' id='469e1bd7'/>
    <function-type size-in-bits='64' id='630f2781'>
      <parameter type-id='6002756d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='7c9d37e3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8382c070'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='28bf3cba'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci_event.c' language='LANG_C99'>
    <enum-decl name='spdk_pci_event_type' filepath='env.h' line='1386' column='1' id='09d5c853'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_UEVENT_ADD' value='0'/>
      <enumerator name='SPDK_UEVENT_REMOVE' value='1'/>
    </enum-decl>
    <class-decl name='spdk_pci_event' size-in-bits='96' is-struct='yes' visibility='default' filepath='env.h' line='1391' column='1' id='c488f7e7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='09d5c853' visibility='default' filepath='env.h' line='1392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='traddr' type-id='ec72f59a' visibility='default' filepath='env.h' line='1393' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c488f7e7' size-in-bits='64' id='f0aa383f'/>
    <function-decl name='spdk_pci_event_listen' mangled-name='spdk_pci_event_listen' filepath='pci_event.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_event_listen'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_get_event' mangled-name='spdk_pci_get_event' filepath='pci_event.c' line='196' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_event'>
      <parameter type-id='95e97e5e' name='fd' filepath='pci_event.c' line='196' column='1'/>
      <parameter type-id='f0aa383f' name='event' filepath='pci_event.c' line='196' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_idxd.c' language='LANG_C99'>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd8'/>
    <function-decl name='spdk_pci_idxd_get_driver' mangled-name='spdk_pci_idxd_get_driver' filepath='pci_idxd.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_idxd_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_ioat.c' language='LANG_C99'>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd9'/>
    <function-decl name='spdk_pci_ioat_get_driver' mangled-name='spdk_pci_ioat_get_driver' filepath='pci_ioat.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_ioat_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_virtio.c' language='LANG_C99'>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bda'/>
    <function-decl name='spdk_pci_virtio_get_driver' mangled-name='spdk_pci_virtio_get_driver' filepath='pci_virtio.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_virtio_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_vmd.c' language='LANG_C99'>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bdb'/>
    <function-decl name='spdk_pci_vmd_get_driver' mangled-name='spdk_pci_vmd_get_driver' filepath='pci_vmd.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_vmd_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sigbus_handler.c' language='LANG_C99'>
    <typedef-decl name='spdk_pci_error_handler' type-id='debb4ee8' filepath='env.h' line='1396' column='1' id='bb61f2cb'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <function-decl name='spdk_pci_register_error_handler' mangled-name='spdk_pci_register_error_handler' filepath='sigbus_handler.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_error_handler'>
      <parameter type-id='bb61f2cb' name='sighandler' filepath='sigbus_handler.c' line='55' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='sigbus_handler.c' line='55' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
