<abi-corpus version='2.4' soname='libspdk_dma.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_memory_domain_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_context' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_dma_device_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_dma_device_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_system_domain' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_user_context' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_invalidate_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_memzero' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_pull_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_push_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_data_transfer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_invalidate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_memzero' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_pull' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_push' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_translation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_transfer_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_translate_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' version='GLIBC_2.14' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pthread_mutex_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pthread_mutex_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='dma.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <enum-decl name='spdk_dma_device_type' size-in-bits='32' alignment-in-bits='32' filepath='dma.h' line='26' column='1' hash='462d48cc2e989cbf' id='26ce2e0f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_RDMA' value='0'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_DMA' value='1'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_ACCEL' value='2'/>
      <enumerator name='SPDK_DMA_DEVICE_VENDOR_SPECIFIC_TYPE_START' value='1000'/>
      <enumerator name='SPDK_DMA_DEVICE_VENDOR_SPECIFIC_TYPE_END' value='1999'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_ctx' is-struct='yes' visibility='default' size-in-bits='192' filepath='dma.h' line='202' column='1' hash='6b8f79e7998dac0c' id='baa327a6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='dma.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='user_ctx_size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='210' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_translation_ctx' is-struct='yes' visibility='default' size-in-bits='128' filepath='dma.h' line='129' column='1' hash='838ae262d4ee6c2f' id='9a027dfa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_translation_result' is-struct='yes' visibility='default' size-in-bits='448' filepath='dma.h' line='108' column='1' hash='9d15a0751bd88903' id='02f29580'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='8f92235e' visibility='default' filepath='dma.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='dma.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='dma.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dst_domain' type-id='e5ecc906' visibility='default' filepath='dma.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='dma.h' line='122' column='1' hash='d12ce694f4f4adf9' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lkey' type-id='8f92235e' visibility='default' filepath='dma.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='dma.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='dma.h' line='133' column='1' hash='23cbba028467b437#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ibv_qp' type-id='eaa32e2f' visibility='default' filepath='dma.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='size_t' type-id='f0981eec' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_dma_device_type_t' type-id='26ce2e0f' size-in-bits='32' alignment-in-bits='32' filepath='dma.c' line='191' column='1' hash='462d48cc2e989cbf' id='a130b758'/>
    <typedef-decl name='spdk_memory_domain_data_cpl_cb' type-id='82328a76' size-in-bits='64' filepath='dma.h' line='53' column='1' hash='fd7a63c0c6c822c4' id='de59bad4'/>
    <typedef-decl name='spdk_memory_domain_invalidate_data_cb' type-id='60de251e' size-in-bits='64' filepath='dma.h' line='191' column='1' hash='fd7a63c0c6c822c4' id='d7e37058'/>
    <typedef-decl name='spdk_memory_domain_memzero_cb' type-id='8f522403' size-in-bits='64' filepath='dma.h' line='105' column='1' hash='fd7a63c0c6c822c4' id='23f1d9ff'/>
    <typedef-decl name='spdk_memory_domain_pull_data_cb' type-id='bdb07d45' size-in-bits='64' filepath='dma.h' line='70' column='1' hash='fd7a63c0c6c822c4' id='e64189f6'/>
    <typedef-decl name='spdk_memory_domain_push_data_cb' type-id='bdb07d45' size-in-bits='64' filepath='dma.h' line='89' column='1' hash='fd7a63c0c6c822c4' id='8e19cbfd'/>
    <typedef-decl name='spdk_memory_domain_transfer_data_cb' type-id='8c11060d' size-in-bits='64' filepath='dma.h' line='158' column='1' hash='fd7a63c0c6c822c4' id='dd1b4a8e'/>
    <typedef-decl name='spdk_memory_domain_translate_memory_cb' type-id='8554db6a' size-in-bits='64' filepath='dma.h' line='178' column='1' hash='fd7a63c0c6c822c4' id='8054d482'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='dma.h' line='121' column='1' hash='dd8296d4b6dced70' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='rdma' type-id='e7f43f72' visibility='default' filepath='dma.h' line='125' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='dma.h' line='132' column='1' hash='dd8296d4b6dced70#2' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='rdma' type-id='e7f43f73' visibility='default' filepath='dma.h' line='136' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eec'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='d328048a' size-in-bits='64' hash='fd7a63c0c6c822c4' id='bdb07d45'/>
    <pointer-type-def type-id='939fe0ce' size-in-bits='64' hash='fd7a63c0c6c822c4' id='8c11060d'/>
    <pointer-type-def type-id='961bf758' size-in-bits='64' hash='fd7a63c0c6c822c4' id='8f522403'/>
    <pointer-type-def type-id='955c1579' size-in-bits='64' hash='fd7a63c0c6c822c4' id='8554db6a'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' hash='54c1e9f81ec7a1db' id='78c01427'/>
