<abi-corpus version='2.4' soname='libspdk_vhost.so.8.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_json.so.6.1'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.7.0'/>
    <dependency name='libspdk_bdev.so.17.0'/>
    <dependency name='libspdk_scsi.so.9.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vhost_blk_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_find' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_vhost_driver_get_protocol_features' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_driver_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_driver_set_features' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_driver_set_protocol_features' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_driver_start' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_driver_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_extern_callback_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_ifname' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_mem_table' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_negotiated_features' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_vhost_ring_inflight' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_vhost_vring' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_vring_base' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_get_vring_base_from_inflight' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_log_used_vring' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_log_write' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_set_inflight_desc_packed' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_set_inflight_desc_split' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_set_last_inflight_io_packed' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_set_last_inflight_io_split' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_set_vring_base' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vhost_vring_call_nonblock' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_current_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_first_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_next_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_iommu_is_enabled' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='rte_vhost_user.c' language='LANG_C11'>
    <function-decl name='spdk_vhost_set_socket_path' mangled-name='spdk_vhost_set_socket_path' filepath='rte_vhost_user.c' line='1742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_socket_path' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='__xpg_basename' filepath='rte_vhost_user.c' line='1742' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vhost.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='spdk_cpuset' is-struct='yes' visibility='default' size-in-bits='3080' filepath='cpuset.h' line='25' column='1' hash='c4979574ded471d6' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='spdk_vhost_fini_cb' type-id='c640490b' size-in-bits='64' filepath='vhost.h' line='32' column='1' hash='fd7a63c0c6c822c4' id='c30658ee'/>
    <typedef-decl name='spdk_vhost_init_cb' type-id='67912dc2' size-in-bits='64' filepath='vhost.h' line='29' column='1' hash='fd7a63c0c6c822c4' id='e7e0eab8'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='aec5215a' const='yes' hash='9ec73d88b6bfc7ef' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' hash='18395ee449757275' id='75291c35'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <pointer-type-def type-id='f712e2b7' size-in-bits='64' hash='fd7a63c0c6c822c4' id='67912dc2'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c640490b'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='4e8a23c0' size-in-bits='64' id='05d247e6'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_vhost_dev_next' mangled-name='spdk_vhost_dev_next' filepath='vhost.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_next' hash='7f32ffea222edbe7'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='39' column='1'/>
      <return type-id='05d247e6'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_find' mangled-name='spdk_vhost_dev_find' filepath='vhost.c' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_find' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='ctrlr_name' filepath='vhost.c' line='49' column='1'/>
      <return type-id='05d247e6'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_get_name' mangled-name='spdk_vhost_dev_get_name' filepath='vhost.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_get_name' hash='53885bde0aa65efe'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='203' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_get_cpumask' mangled-name='spdk_vhost_dev_get_cpumask' filepath='vhost.c' line='210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_get_cpumask' hash='22d8a5d442207f43'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='210' column='1'/>
      <return type-id='75291c35'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_remove' mangled-name='spdk_vhost_dev_remove' filepath='vhost.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_remove' hash='388da3fa973fde78'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='224' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_set_coalescing' mangled-name='spdk_vhost_set_coalescing' filepath='vhost.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_coalescing' hash='54152ac49ee16d47'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='230' column='1'/>
      <parameter type-id='8f92235e' name='delay_base_us' filepath='vhost.c' line='230' column='1'/>
      <parameter type-id='8f92235e' name='iops_threshold' filepath='vhost.c' line='231' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_get_coalescing' mangled-name='spdk_vhost_get_coalescing' filepath='vhost.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_get_coalescing' hash='bd18c238b012c8ba'>
      <parameter type-id='05d247e6' name='vdev' filepath='vhost.c' line='238' column='1'/>
      <parameter type-id='90421557' name='delay_base_us' filepath='vhost.c' line='238' column='1'/>
      <parameter type-id='90421557' name='iops_threshold' filepath='vhost.c' line='239' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_lock' mangled-name='spdk_vhost_lock' filepath='vhost.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_lock' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_trylock' mangled-name='spdk_vhost_trylock' filepath='vhost.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_trylock' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_unlock' mangled-name='spdk_vhost_unlock' filepath='vhost.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_unlock' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_init' mangled-name='spdk_vhost_scsi_init' filepath='vhost.c' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_init' hash='5695f5ce05a4c55f'>
      <parameter type-id='e7e0eab8' name='init_cb' filepath='vhost.c' line='304' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_init' mangled-name='spdk_vhost_blk_init' filepath='vhost.c' line='304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_init' hash='5695f5ce05a4c55f'>
      <parameter type-id='e7e0eab8' name='init_cb' filepath='vhost.c' line='304' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_fini' mangled-name='spdk_vhost_scsi_fini' filepath='vhost.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_fini' hash='5695f5ce05a4c55f'>
      <parameter type-id='c30658ee' name='fini_cb' filepath='vhost.c' line='344' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_fini' mangled-name='spdk_vhost_blk_fini' filepath='vhost.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_fini' hash='5695f5ce05a4c55f'>
      <parameter type-id='c30658ee' name='fini_cb' filepath='vhost.c' line='344' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_config_json' mangled-name='spdk_vhost_scsi_config_json' filepath='vhost.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_config_json' hash='7f32ffea222edbe7'>
      <parameter type-id='b8e14bfe' name='w' filepath='vhost.c' line='414' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_config_json' mangled-name='spdk_vhost_blk_config_json' filepath='vhost.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_config_json' hash='7f32ffea222edbe7'>
      <parameter type-id='b8e14bfe' name='w' filepath='vhost.c' line='414' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_vhost_dev' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='vhost_internal.h' line='199' column='1' id='4e8a23c0'/>
    <type-decl name='void' id='48b5725f'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='f712e2b7'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='30a82da4'>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='vhost_blk.c' language='LANG_C11'>
    <enum-decl name='spdk_json_val_type' size-in-bits='32' alignment-in-bits='32' filepath='json.h' line='21' column='1' hash='4b975249c4c2bd4a' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='spdk_json_val' is-struct='yes' visibility='default' size-in-bits='128' filepath='json.h' line='36' column='1' hash='8563d681b49b84d7' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <qualified-type-def type-id='9fc5272e' const='yes' hash='58b78b3cb252e033' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' hash='04e62bb6175e0f38' id='3ee1fff1'/>
    <function-decl name='spdk_vhost_blk_construct' mangled-name='spdk_vhost_blk_construct' filepath='vhost_blk.c' line='1616' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_construct' hash='44e98b9379063bf7'>
      <parameter type-id='80f4b756' name='name' filepath='vhost_blk.c' line='1616' column='1'/>
      <parameter type-id='80f4b756' name='cpumask' filepath='vhost_blk.c' line='1616' column='1'/>
      <parameter type-id='80f4b756' name='dev_name' filepath='vhost_blk.c' line='1616' column='1'/>
      <parameter type-id='80f4b756' name='transport' filepath='vhost_blk.c' line='1617' column='1'/>
      <parameter type-id='3ee1fff1' name='params' filepath='vhost_blk.c' line='1617' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vhost_scsi.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eed' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_vhost_event_fn' type-id='6b6f06b1' size-in-bits='64' filepath='vhost.h' line='151' column='1' hash='fd7a63c0c6c822c4' id='f068ad8b'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eed'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <pointer-type-def type-id='81637ba4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='6b6f06b1'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='74e6cc2e' size-in-bits='64' id='491ccef4'/>
    <pointer-type-def type-id='4e8a23c0' size-in-bits='64' id='05d247e7'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_scsi_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='74e6cc2e'/>
    <function-decl name='spdk_vhost_scsi_dev_construct' mangled-name='spdk_vhost_scsi_dev_construct' filepath='vhost_scsi.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_construct' hash='5f03b5b551b5a51f'>
      <parameter type-id='80f4b756' name='name' filepath='vhost_scsi.c' line='930' column='1'/>
      <parameter type-id='80f4b756' name='cpumask' filepath='vhost_scsi.c' line='930' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_dev_construct_no_start' mangled-name='spdk_vhost_scsi_dev_construct_no_start' filepath='vhost_scsi.c' line='930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_construct_no_start' hash='5f03b5b551b5a51f'>
      <parameter type-id='80f4b756' name='name' filepath='vhost_scsi.c' line='930' column='1'/>
      <parameter type-id='80f4b756' name='cpumask' filepath='vhost_scsi.c' line='930' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_dev_get_tgt' mangled-name='spdk_vhost_scsi_dev_get_tgt' filepath='vhost_scsi.c' line='971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_get_tgt' hash='b8d5bf705e488ff2'>
      <parameter type-id='05d247e7' name='vdev' filepath='vhost_scsi.c' line='971' column='1'/>
      <parameter type-id='b96825af' name='num' filepath='vhost_scsi.c' line='971' column='1'/>
