<abi-corpus version='2.4' soname='libspdk_bdev.so.17.0'>
  <elf-needed>
    <dependency name='libspdk_accel.so.16.0'/>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_json.so.6.1'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.7.0'/>
    <dependency name='libspdk_notify.so.6.0'/>
    <dependency name='libspdk_trace.so.11.0'/>
    <dependency name='libspdk_dma.so.5.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_add_io_stat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del_all' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_channel_get_histogram' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_trace_unregister_owner' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u32log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate_sha1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_is_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_put' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='bdev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' hash='3e9fefcb964ef6b4' id='16dc656a'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <enum-decl name='spdk_bdev_claim_type' size-in-bits='32' alignment-in-bits='32' filepath='bdev_module.h' line='174' column='1' hash='fcf7beac27970d60' id='e323b446'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_CLAIM_NONE' value='0'/>
      <enumerator name='SPDK_BDEV_CLAIM_EXCL_WRITE' value='1'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_ONE' value='2'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_NONE' value='3'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_SHARED' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_event_type' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='41' column='1' hash='5ba52e2bfb7395aa' id='3add6f5a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_EVENT_REMOVE' value='0'/>
      <enumerator name='SPDK_BDEV_EVENT_RESIZE' value='1'/>
      <enumerator name='SPDK_BDEV_EVENT_MEDIA_MANAGEMENT' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_status' size-in-bits='32' alignment-in-bits='32' filepath='bdev_module.h' line='379' column='1' hash='61d3f932e4b6ec91' id='11906e0e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_AIO_ERROR' value='-8'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_ABORTED' value='-7'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FIRST_FUSED_FAILED' value='-6'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_MISCOMPARE' value='-5'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NOMEM' value='-4'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SCSI_ERROR' value='-3'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NVME_ERROR' value='-2'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FAILED' value='-1'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_PENDING' value='0'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SUCCESS' value='1'/>
      <enumerator name='SPDK_MIN_BDEV_IO_STATUS' value='-8'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_type' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='103' column='1' hash='a5abd01a98e90417' id='9cd6c10c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_READ' value='1'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE' value='2'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_UNMAP' value='3'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_FLUSH' value='4'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_RESET' value='5'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_ADMIN' value='6'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO' value='7'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO_MD' value='8'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE_ZEROES' value='9'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZCOPY' value='10'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_GET_ZONE_INFO' value='11'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_MANAGEMENT' value='12'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_APPEND' value='13'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE' value='14'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE_AND_WRITE' value='15'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ABORT' value='16'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_HOLE' value='17'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_DATA' value='18'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COPY' value='19'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IOV_MD' value='20'/>
      <enumerator name='SPDK_BDEV_NUM_IO_TYPES' value='21'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_qos_rate_limit_type' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='145' column='1' hash='07cee034494e894e' id='3270d5b4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_QOS_RW_IOPS_RATE_LIMIT' value='0'/>
      <enumerator name='SPDK_BDEV_QOS_RW_BPS_RATE_LIMIT' value='1'/>
      <enumerator name='SPDK_BDEV_QOS_R_BPS_RATE_LIMIT' value='2'/>
      <enumerator name='SPDK_BDEV_QOS_W_BPS_RATE_LIMIT' value='3'/>
      <enumerator name='SPDK_BDEV_QOS_NUM_RATE_LIMIT_TYPES' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_reset_stat_mode' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='320' column='1' hash='4dc5b88c1d605717' id='c463dc5d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_RESET_STAT_ALL' value='0'/>
      <enumerator name='SPDK_BDEV_RESET_STAT_MAXMIN' value='1'/>
      <enumerator name='SPDK_BDEV_RESET_STAT_NONE' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_status' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='90' column='1' hash='8b1de756c9b7bf0c' id='7f167725'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_BDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_BDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_zone_action' size-in-bits='32' alignment-in-bits='32' filepath='bdev_zone.h' line='34' column='1' hash='af7c0f10a4b82f7a' id='85264f60'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_CLOSE' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_FINISH' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_OPEN' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_RESET' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_OFFLINE' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_dif_check_type' size-in-bits='32' alignment-in-bits='32' filepath='dif.h' line='44' column='1' hash='fb772dafba17ae32' id='91a2c9e2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_REFTAG' value='1'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_APPTAG' value='2'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_GUARD' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_dif_pi_format' size-in-bits='32' alignment-in-bits='32' filepath='dif.h' line='50' column='1' hash='5a03827420007bb5' id='d940afde'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_16' value='0'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_32' value='1'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_64' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_dif_type' size-in-bits='32' alignment-in-bits='32' filepath='dif.h' line='37' column='1' hash='67f6f95a0f174265' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_scsi_sense' size-in-bits='32' alignment-in-bits='32' filepath='scsi_spec.h' line='47' column='1' hash='2c981be78544d815' id='00418730'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_SENSE_NO_SENSE' value='0'/>
      <enumerator name='SPDK_SCSI_SENSE_RECOVERED_ERROR' value='1'/>
      <enumerator name='SPDK_SCSI_SENSE_NOT_READY' value='2'/>
      <enumerator name='SPDK_SCSI_SENSE_MEDIUM_ERROR' value='3'/>
      <enumerator name='SPDK_SCSI_SENSE_HARDWARE_ERROR' value='4'/>
      <enumerator name='SPDK_SCSI_SENSE_ILLEGAL_REQUEST' value='5'/>
      <enumerator name='SPDK_SCSI_SENSE_UNIT_ATTENTION' value='6'/>
      <enumerator name='SPDK_SCSI_SENSE_DATA_PROTECT' value='7'/>
      <enumerator name='SPDK_SCSI_SENSE_BLANK_CHECK' value='8'/>
      <enumerator name='SPDK_SCSI_SENSE_VENDOR_SPECIFIC' value='9'/>
      <enumerator name='SPDK_SCSI_SENSE_COPY_ABORTED' value='10'/>
      <enumerator name='SPDK_SCSI_SENSE_ABORTED_COMMAND' value='11'/>
      <enumerator name='SPDK_SCSI_SENSE_VOLUME_OVERFLOW' value='13'/>
      <enumerator name='SPDK_SCSI_SENSE_MISCOMPARE' value='14'/>
    </enum-decl>
    <enum-decl name='spdk_scsi_status' size-in-bits='32' alignment-in-bits='32' filepath='scsi_spec.h' line='33' column='1' hash='f35414b60a1a0ca2' id='aabad29c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_STATUS_GOOD' value='0'/>
      <enumerator name='SPDK_SCSI_STATUS_CHECK_CONDITION' value='2'/>
      <enumerator name='SPDK_SCSI_STATUS_CONDITION_MET' value='4'/>
      <enumerator name='SPDK_SCSI_STATUS_BUSY' value='8'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE' value='16'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE_CONDITION_MET' value='20'/>
      <enumerator name='SPDK_SCSI_STATUS_RESERVATION_CONFLICT' value='24'/>
      <enumerator name='SPDK_SCSI_STATUS_Obsolete' value='34'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_SET_FULL' value='40'/>
      <enumerator name='SPDK_SCSI_STATUS_ACA_ACTIVE' value='48'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_ABORTED' value='64'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4096' hash='6b5ab9528239fa07' id='d0b1608e'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='__bdev_internal_claim_v1' is-struct='yes' visibility='default' size-in-bits='64' filepath='bdev_module.h' line='699' column='1' hash='f6307cf2c5798267' id='2ed5d19b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='706' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_claim_v2' is-struct='yes' visibility='default' size-in-bits='192' filepath='bdev_module.h' line='709' column='1' hash='0da27dcb8c2115f5' id='2fd5d32e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='claims' type-id='d8335c47' visibility='default' filepath='bdev_module.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='713' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_fields' is-struct='yes' visibility='default' size-in-bits='2688' filepath='bdev_module.h' line='660' column='1' hash='0a352968140a8df1' id='0dc6d312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qos' type-id='c0bd1bdf' visibility='default' filepath='bdev_module.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qos_mod_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='trace_id' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='status' type-id='7f167725' visibility='default' filepath='bdev_module.h' line='681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='examine_in_progress' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='claim_type' type-id='e323b446' visibility='default' filepath='bdev_module.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='claim' type-id='8de368de' visibility='default' filepath='bdev_module.h' line='715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unregister_cb' type-id='10afdbb3' visibility='default' filepath='bdev_module.h' line='718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='unregister_td' type-id='f8fcfe66' visibility='default' filepath='bdev_module.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='open_descs' type-id='e7f43f72' visibility='default' filepath='bdev_module.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='bdev_module.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='reset_in_progress' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='queued_resets' type-id='676e6b2f' visibility='default' filepath='bdev_module.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='qd_poller' type-id='bf13de54' visibility='default' filepath='bdev_module.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='qd_desc' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='period' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='new_period' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='temporary_queue_depth' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='measured_queue_depth' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='753' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='io_time' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='756' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='weighted_io_time' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='stat' type-id='08cc63f9' visibility='default' filepath='bdev_module.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='qd_poll_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1928'>
        <var-decl name='histogram_enabled' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1936'>
        <var-decl name='histogram_in_progress' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1944'>
        <var-decl name='histogram_io_type' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='histogram_granularity' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='histogram_min_val' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='histogram_max_val' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='locked_ranges' type-id='905ae936' visibility='default' filepath='bdev_module.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='pending_locked_ranges' type-id='905ae936' visibility='default' filepath='bdev_module.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='bdev_name' type-id='5baf3205' visibility='default' filepath='bdev_module.h' line='784' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_module_internal_fields' is-struct='yes' visibility='default' size-in-bits='576' filepath='bdev_module.h' line='149' column='1' hash='63f5be309d0e77f9' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='quiesced_ranges' type-id='e7f43f74' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bdev_io_tailq_t' is-struct='yes' naming-typedef-id='676e6b2f' visibility='default' size-in-bits='128' filepath='bdev_module.h' line='421' column='1' hash='dab363be74ac30ca' id='a79da5e0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ab7fe902' visibility='default' filepath='bdev_module.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='lba_range_tailq_t' is-struct='yes' naming-typedef-id='905ae936' visibility='default' size-in-bits='128' filepath='bdev_module.h' line='423' column='1' hash='4accfbece99da27c' id='088b1745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default' filepath='bdev_module.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default' filepath='bdev_module.h' line='423' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' size-in-bits='4416' filepath='bdev_module.h' line='425' column='1' hash='0b45ed27d35266b2' id='f6507fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aliases' type-id='ad35c6ef' visibility='default' filepath='bdev_module.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='product_name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_cache' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='split_on_write_unit' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='write_unit_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='required_alignment' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='600'>
        <var-decl name='split_on_optimal_io_boundary' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='optimal_io_boundary' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_segment_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='max_num_segments' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='max_unmap' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_unmap_segments' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_zeroes' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='max_copy' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='max_rw_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='bdev_module.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='md_len' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='535' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default' filepath='bdev_module.h' line='550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dif_pi_format' type-id='d940afde' visibility='default' filepath='bdev_module.h' line='558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='dif_is_head_of_md' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='dif_check_flags' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='zoned' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='zone_size' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_zone_append_size' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='max_open_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='max_active_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='optimal_open_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='media_events' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='ctratt' type-id='3ebecae4' visibility='default' filepath='bdev_module.h' line='613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='reset_io_drain_timeout' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='numa' type-id='e7f43f76' visibility='default' filepath='bdev_module.h' line='647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='module' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='fn_table' type-id='9750090a' visibility='default' filepath='bdev_module.h' line='655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='internal' type-id='0dc6d312' visibility='default' filepath='bdev_module.h' line='785' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_alias' is-struct='yes' visibility='default' size-in-bits='448' filepath='bdev_module.h' line='409' column='1' hash='ea9f31ef42593b2e' id='5b4f6d22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alias' type-id='5baf3205' visibility='default' filepath='bdev_module.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tailq' type-id='e7f43f77' visibility='default' filepath='bdev_module.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_aliases_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='bdev_module.h' line='433' column='1' hash='b141b5ecb597e837' id='ad35c6ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='6e513b50' visibility='default' filepath='bdev_module.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='23e0a10e' visibility='default' filepath='bdev_module.h' line='433' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_claim_opts' is-struct='yes' visibility='default' size-in-bits='384' filepath='bdev_module.h' line='206' column='1' hash='7d1732ece5dccab7' id='e83ba9cd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='bdev_module.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='16dc656a' visibility='default' filepath='bdev_module.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='shared_claim_key' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='218' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_enable_histogram_opts' is-struct='yes' visibility='default' size-in-bits='208' filepath='bdev.h' line='131' column='1' hash='f188d344a953bf98' id='3c4ef00f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='min_nsec' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_nsec' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_type' type-id='b96825af' visibility='default' filepath='bdev.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='granularity' type-id='b96825af' visibility='default' filepath='bdev.h' line='140' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_ext_io_opts' is-struct='yes' visibility='default' size-in-bits='416' filepath='bdev.h' line='278' column='1' hash='32f4f2d65770e6fb' id='b07aafe1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='bdev.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='metadata' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default' filepath='bdev.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dif_check_flags_exclude_mask' type-id='8f92235e' visibility='default' filepath='bdev.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nvme_cdw12' type-id='664541c5' visibility='default' filepath='bdev.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvme_cdw13' type-id='65454032' visibility='default' filepath='bdev.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_fn_table' is-struct='yes' visibility='default' size-in-bits='768' filepath='bdev_module.h' line='307' column='1' hash='7ce333de9e53b8da' id='bcf92cc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='c04372aa' visibility='default' filepath='bdev_module.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='c26c29b3' visibility='default' filepath='bdev_module.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_type_supported' type-id='9804fe47' visibility='default' filepath='bdev_module.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_io_channel' type-id='0bad6792' visibility='default' filepath='bdev_module.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dump_info_json' type-id='7b67b143' visibility='default' filepath='bdev_module.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_config_json' type-id='0aba57e8' visibility='default' filepath='bdev_module.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_spin_time' type-id='ca171b4f' visibility='default' filepath='bdev_module.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_module_ctx' type-id='75964865' visibility='default' filepath='bdev_module.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_memory_domains' type-id='d3d1557a' visibility='default' filepath='bdev_module.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reset_device_stat' type-id='61359e15' visibility='default' filepath='bdev_module.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dump_device_stat_json' type-id='28c1e414' visibility='default' filepath='bdev_module.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='accel_sequence_supported' type-id='9804fe47' visibility='default' filepath='bdev_module.h' line='375' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io' is-struct='yes' visibility='default' size-in-bits='9216' filepath='bdev_module.h' line='1091' column='1' hash='633a9ff4e5063a7d' id='68ee9836'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='1093' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1096' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='num_retries' type-id='149c6638' visibility='default' filepath='bdev_module.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_iov' type-id='d0b1608e' visibility='default' filepath='bdev_module.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='reserved2' type-id='d0f1c0cb' visibility='default' filepath='bdev_module.h' line='1111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='bdev_module.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6336'>
        <var-decl name='reserved3' type-id='d7aacc58' visibility='default' filepath='bdev_module.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='internal' type-id='61dcc3d6' visibility='default' filepath='bdev_module.h' line='1128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default' filepath='bdev_module.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_abort_params' is-struct='yes' visibility='default' size-in-bits='64' filepath='bdev_module.h' line='900' column='1' hash='223d52ccccb2804f' id='c93a059e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_to_abort' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='902' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_block_params' is-struct='yes' visibility='default' size-in-bits='1728' filepath='bdev_module.h' line='814' column='1' hash='2424d7f83cf56374' id='3278f957'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='819' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='bdev_module.h' line='828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default' filepath='bdev_module.h' line='832' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fused_iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='fused_iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='dif_check_flags' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nvme_cdw12' type-id='664541c5' visibility='default' filepath='bdev_module.h' line='849' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='nvme_cdw13' type-id='65454032' visibility='default' filepath='bdev_module.h' line='852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='zcopy' type-id='e7f43f78' visibility='default' filepath='bdev_module.h' line='863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='abort' type-id='e7f43f79' visibility='default' filepath='bdev_module.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='seek' type-id='e7f43f7a' visibility='default' filepath='bdev_module.h' line='875' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='copy' type-id='e7f43f7b' visibility='default' filepath='bdev_module.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dif_ctx' type-id='6e011169' visibility='default' filepath='bdev_module.h' line='883' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='dif_err' type-id='035f351a' visibility='default' filepath='bdev_module.h' line='886' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_internal_fields' is-struct='yes' visibility='default' size-in-bits='2560' filepath='bdev_module.h' line='946' column='1' hash='c41687c5aac12f5f' id='61dcc3d6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='63c91ce9' visibility='default' filepath='bdev_module.h' line='948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='f' type-id='ac5ab596' visibility='default' filepath='bdev_module.h' line='974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='status' type-id='ee31ee44' visibility='default' filepath='bdev_module.h' line='977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='retry_state' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='reserved' type-id='0f4ddd0b' visibility='default' filepath='bdev_module.h' line='982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb' type-id='a720f07e' visibility='default' filepath='bdev_module.h' line='988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='caller_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='submit_tsc' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ch_link' type-id='e7f43f7c' visibility='default' filepath='bdev_module.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf_link' type-id='e7f43f7d' visibility='default' filepath='bdev_module.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='error' type-id='ac5ab597' visibility='default' filepath='bdev_module.h' line='1025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='split' type-id='e7f43f7e' visibility='default' filepath='bdev_module.h' line='1039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='buf' type-id='e7f43f7f' visibility='default' filepath='bdev_module.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='bounce_buf' type-id='e7f43f80' visibility='default' filepath='bdev_module.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='get_aux_buf_cb' type-id='030e7a71' visibility='default' filepath='bdev_module.h' line='1059' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='get_buf_cb' type-id='cb1f5f5e' visibility='default' filepath='bdev_module.h' line='1062' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='link' type-id='e7f43f7c' visibility='default' filepath='bdev_module.h' line='1072' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='iobuf' type-id='71e32ba2' visibility='default' filepath='bdev_module.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='waitq_entry' type-id='56e41d71' visibility='default' filepath='bdev_module.h' line='1078' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='bdev_module.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='1082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default' filepath='bdev_module.h' line='1085' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='data_transfer_cpl' type-id='82328a76' visibility='default' filepath='bdev_module.h' line='1088' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_nvme_passthru_params' is-struct='yes' visibility='default' size-in-bits='896' filepath='bdev_module.h' line='905' column='1' hash='66d9f65f041169ea' id='726000dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd' type-id='a0e8c12d' visibility='default' filepath='bdev_module.h' line='907' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='910' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='916' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nbytes' type-id='b59d7dce' visibility='default' filepath='bdev_module.h' line='919' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='922' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='md_len' type-id='b59d7dce' visibility='default' filepath='bdev_module.h' line='925' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_reset_params' is-struct='yes' visibility='default' size-in-bits='192' filepath='bdev_module.h' line='889' column='1' hash='ab1117393c0875b8' id='c84a940d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch_ref' type-id='a7e01876' visibility='default' filepath='bdev_module.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait_poller' type-id='e7f43f81' visibility='default' filepath='bdev_module.h' line='897' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_stat' is-struct='yes' visibility='default' size-in-bits='1408' filepath='bdev.h' line='173' column='1' hash='5715c78db7410753' id='21c89d01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bytes_read' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_read_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bytes_written' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_write_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bytes_unmapped' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_unmap_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bytes_copied' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_copy_ops' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='max_read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='min_read_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='min_write_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='min_unmap_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_copy_latency_ticks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ticks_rate' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='io_error' type-id='0bc48c8c' visibility='default' filepath='bdev.h' line='199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' is-struct='yes' visibility='default' size-in-bits='320' filepath='bdev.h' line='2116' column='1' hash='0e2134e9e32cc6fc' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='2117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='2118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='2119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f82' visibility='default' filepath='bdev.h' line='2120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_zone_mgmt_params' is-struct='yes' visibility='default' size-in-bits='192' filepath='bdev_module.h' line='928' column='1' hash='be3db9e1f50ad830' id='0ddb89f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='930' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_zones' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zone_action' type-id='85264f60' visibility='default' filepath='bdev_module.h' line='936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='939' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_media_event' is-struct='yes' visibility='default' size-in-bits='128' filepath='bdev.h' line='48' column='1' hash='c0966e081a2a3458' id='66579779'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module' is-struct='yes' visibility='default' size-in-bits='1216' filepath='bdev_module.h' line='40' column='1' hash='115c5ab91ffe4c71' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='65e3965a' visibility='default' filepath='bdev_module.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='494cdc6d' visibility='default' filepath='bdev_module.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='bdev_module.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='65e3965a' visibility='default' filepath='bdev_module.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='82f59c11' visibility='default' filepath='bdev_module.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='82f59c11' visibility='default' filepath='bdev_module.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default' filepath='bdev_module.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module_claim' is-struct='yes' visibility='default' size-in-bits='512' filepath='bdev_module.h' line='414' column='1' hash='51f158cde6f35f4e' id='564b2089'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='16dc656a' visibility='default' filepath='bdev_module.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='link' type-id='e7f43f83' visibility='default' filepath='bdev_module.h' line='418' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_name' is-struct='yes' visibility='default' size-in-bits='320' filepath='bdev_module.h' line='403' column='1' hash='b4afc723ee74a7bc' id='5baf3205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='bdev_module.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f84' visibility='default' filepath='bdev_module.h' line='406' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_open_async_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='bdev.h' line='522' column='1' hash='b7a6bbbfdf3f44f1' id='67e84164'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='timeout_ms' type-id='9c313c2d' visibility='default' filepath='bdev.h' line='533' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_open_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='bdev.h' line='455' column='1' hash='6e72d03038545f17' id='58e40e79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hide_metadata' type-id='c894953d' visibility='default' filepath='bdev.h' line='462' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='bdev.h' line='204' column='1' hash='37a3d0b6c7a23f0d' id='60908454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev_io_pool_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bdev_io_cache_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev_auto_examine' type-id='c894953d' visibility='default' filepath='bdev.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='reserved9' type-id='d3538ec5' visibility='default' filepath='bdev.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='bdev.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iobuf_small_cache_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='iobuf_large_cache_size' type-id='8f92235e' visibility='default' filepath='bdev.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx' is-struct='yes' visibility='default' size-in-bits='512' filepath='dif.h' line='65' column='1' hash='3fa86a99bcca3589' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_error' is-struct='yes' visibility='default' size-in-bits='256' filepath='dif.h' line='122' column='1' hash='1c8ca713d84d211b' id='035f351a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='err_type' type-id='b96825af' visibility='default' filepath='dif.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd' type-id='d3538ec5' visibility='default' filepath='dif.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expected' type-id='9c313c2d' visibility='default' filepath='dif.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='actual' type-id='9c313c2d' visibility='default' filepath='dif.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='err_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_histogram_data' is-struct='yes' visibility='default' size-in-bits='192' filepath='histogram_data.h' line='62' column='1' hash='f7768a86f2bdc5fa' id='9e5a028f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='granularity' type-id='8f92235e' visibility='default' filepath='histogram_data.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='min_range' type-id='8f92235e' visibility='default' filepath='histogram_data.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_range' type-id='8f92235e' visibility='default' filepath='histogram_data.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bucket' type-id='5d6479ae' visibility='default' filepath='histogram_data.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' is-struct='yes' visibility='default' size-in-bits='192' filepath='thread.h' line='1113' column='1' hash='3823418d95fd487d' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default' filepath='thread.h' line='1114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f85' visibility='default' filepath='thread.h' line='1116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvme_spec.h' line='1380' column='1' hash='5391b474785ed5b0' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab598' visibility='default' filepath='nvme_spec.h' line='1406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvme_spec.h' line='614' column='1' hash='215b19d231463b5a' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' is-struct='yes' visibility='default' size-in-bits='256' filepath='thread.h' line='1027' column='1' hash='f3654a830a369375' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='1028' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='1029' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='1030' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='1031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='1032' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' is-struct='yes' visibility='default' size-in-bits='128' filepath='uuid.h' line='21' column='1' hash='ad18e2956698a415' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab59e' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='v2_claims' is-struct='yes' visibility='default' size-in-bits='128' filepath='bdev_module.h' line='711' column='1' hash='f2819a1ef5b411cc' id='d8335c47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='87d40811' visibility='default' filepath='bdev_module.h' line='711' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='0dc8f4e1' visibility='default' filepath='bdev_module.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='bdev_module.h' line='1050' column='1' hash='07ff3efe1f2717e6' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='1051' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='md_iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='1052' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='orig_md_iov' type-id='0f042891' visibility='default' filepath='bdev_module.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default' filepath='bdev_module.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='orig_iovcnt' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='1055' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='167' column='1' hash='88a04d14b93cac82#2' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='729' column='1' hash='b9a869da7a7a06ca#3' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7b7cfb3d' visibility='default' filepath='bdev_module.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7cbf4535' visibility='default' filepath='bdev_module.h' line='729' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='411' column='1' hash='05764fdb85bafd47#4' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='6e513b50' visibility='default' filepath='bdev_module.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='23e0a10e' visibility='default' filepath='bdev_module.h' line='411' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='727' column='1' hash='88a04d14b93cac82#5' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0094857f' visibility='default' filepath='bdev_module.h' line='727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3ecde4cf' visibility='default' filepath='bdev_module.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__69' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='1000' column='1' hash='bf9bf0f80be3a68f#6' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='1000' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__68' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='997' column='1' hash='f2aa3552a8c59f21#7' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='378e9c1c' visibility='default' filepath='bdev_module.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ab7fe902' visibility='default' filepath='bdev_module.h' line='997' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__72' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='bdev_module.h' line='1027' column='1' hash='cf5743f0b822d717#8' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stored_user_cb' type-id='a720f07e' visibility='default' filepath='bdev_module.h' line='1029' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remaining_num_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='outstanding' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='1038' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev.h' line='2120' column='1' hash='1d6be5d923ee5c29#9' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='2120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='2120' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='169' column='1' hash='1465e55946c9c912#10' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='418' column='1' hash='93d2e06f4dea3b59#11' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='87d40811' visibility='default' filepath='bdev_module.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='0dc8f4e1' visibility='default' filepath='bdev_module.h' line='418' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='bdev_module.h' line='406' column='1' hash='d194b3e07ac2a7ec#12' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='b0e2c7a5' visibility='default' filepath='bdev_module.h' line='406' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='thread.h' line='1116' column='1' hash='9d88403e96580dfc#14' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default' filepath='thread.h' line='1116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='884' column='1' hash='c003390e9270da18#15' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='893' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='892' column='1' hash='c5922ea1f9c1a709#16' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='bdev_module.h' line='894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stop_time_tsc' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='896' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='699' column='1' hash='548fe5eb1a049464#17' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='712' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__70' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='1004' column='1' hash='6f7cb8d6ca8757ba#18' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sct' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1010' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1092' column='1' hash='8feb1434fa7a9734#19' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1097' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='856' column='1' hash='ad5db448c44eb1fb#20' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='860' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1249' column='1' hash='8199c8f4e6f677b2#21' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__66' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1370' column='1' hash='db2edd28cd5ec2c2#22' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dsm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1375' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1265' column='1' hash='fe2509516d8ecd30#23' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1038' column='1' hash='3756f1ce18a8e2bd#24' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1041' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='992' column='1' hash='725513e69f184d20#25' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='996' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1051' column='1' hash='fb350fe9dce3eee7#26' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1057' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1082' column='1' hash='d7b5e6e248de3766#27' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1085' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1150' column='1' hash='239cebb925f40526#28' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1142' column='1' hash='7806a3c015202516#29' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='bdev_module.h' line='639' column='1' hash='09196fc492c86f85#30' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id_valid' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='id' type-id='3ff5601b' visibility='default' filepath='bdev_module.h' line='646' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1289' column='1' hash='66b466dc71d4538d#31' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='838' column='1' hash='ad35623b1f5cc13e#32' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='935' column='1' hash='ee77dca2c333c6ec#33' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='937' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='623' column='1' hash='a45795c19710272d#34' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1100' column='1' hash='279ac4d514f56a2a#35' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1208' column='1' hash='0af01c7b07646770#36' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1304' column='1' hash='95c154f9396afd9b#37' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1344' column='1' hash='6a6667d200647dbf#38' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='deac' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1323' column='1' hash='2eb288a02832e7b3#39' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1170' column='1' hash='9b10d28a122b47b8#40' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='806' column='1' hash='e79721de7c7902a8#41' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1118' column='1' hash='69d726b7e707ff5c#42' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='741' column='1' hash='6ca700154011a93f#43' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='745' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1258' column='1' hash='8fa8dd0dd6da05dd#44' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1221' column='1' hash='79f4ba2c78b21195#45' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1239' column='1' hash='060e7c2365604933#46' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1246' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1229' column='1' hash='30839990af78bd5b#47' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1067' column='1' hash='7c6ba9817ee43b85#48' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='724' column='1' hash='44d52284d00b720c#49' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1025' column='1' hash='472e59b041146dba#50' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1028' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1129' column='1' hash='1f720e9494b326d7#51' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1136' column='1' hash='c6400045f70b8a0d#52' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1197' column='1' hash='a554a88dd14d33a5#53' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1006' column='1' hash='cfd0a567e075c925#54' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1014' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='bdev.h' line='267' column='1' hash='4247fdcb6f0aca8d#55' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='bdev.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='bdev.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='bdev.h' line='250' column='1' hash='e9305b46c9208fb1#56' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='bdev.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='bdev.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='bdev.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='bdev.h' line='233' column='1' hash='25b8c7a8b14de0f1#57' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='bdev.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default' filepath='bdev.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='bdev.h' line='237' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1176' column='1' hash='8647d62f3d0684a1#58' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1186' column='1' hash='b355179652e4699e#59' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1158' column='1' hash='fc2ac53ee69a6ce7#60' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1111' column='1' hash='6c4054f7320227d6#61' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='821' column='1' hash='992874cbdd060d67#62' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='775' column='1' hash='c497d77219075caf#63' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='755' column='1' hash='e261fc93549fb3a4#64' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='792' column='1' hash='aac10391fdd2048d#65' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='630' column='1' hash='6c41b1621790411f#66' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='634' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='872' column='1' hash='56b196d3a7b3b90b#67' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='874' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1400' column='1' hash='ba6fe5fc0b0982e5#68' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='877' column='1' hash='fe0f4e416f75ac4f#69' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_offset_blocks' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='879' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='868' column='1' hash='6a6041472ff1c837#70' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='874' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__67' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='bdev_module.h' line='951' column='1' hash='09ef953874fe67e7#71' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='has_accel_sequence' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='has_memory_domain' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='957' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='split' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='960' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='has_buf' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='963' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='has_bounce_buf' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='in_submit_request' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='971' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab#72' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43fbb' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__12' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='bdev_module.h' line='854' column='1' hash='bee4d1cd6d8b4aab#73' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='populate' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='commit' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='start' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='862' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='617' column='1' hash='0ca125c4c4058b5d#74' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__71' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='bdev_module.h' line='1013' column='1' hash='333f1af4fc30ea56#75' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sk' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='asc' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1019' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ascq' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='1021' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='865' column='1' hash='9f6984118f780506#76' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='869' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='1041' column='1' hash='39a44d07224c509c#77' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='bdev_module.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default' filepath='bdev_module.h' line='1046' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' size-in-bits='8' filepath='types.h' line='37' column='1' hash='3c595c3350588f18' id='2171a512'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='bdev_io_tailq_t' type-id='a79da5e0' size-in-bits='128' filepath='bdev_module.h' line='421' column='1' id='676e6b2f'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' size-in-bits='8' filepath='stdint-intn.h' line='24' column='1' hash='3c595c3350588f18' id='ee31ee44'/>
    <typedef-decl name='lba_range_tailq_t' type-id='088b1745' size-in-bits='128' filepath='bdev_module.h' line='423' column='1' id='905ae936'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' size-in-bits='32' filepath='pthreadtypes.h' line='103' column='1' hash='ae69415523d5e788' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_event_cb_t' type-id='78d860eb' size-in-bits='64' filepath='bdev.h' line='74' column='1' hash='fd7a63c0c6c822c4' id='3de10a34'/>
    <typedef-decl name='spdk_bdev_fini_cb' type-id='61359e15' size-in-bits='64' filepath='bdev.h' line='364' column='1' hash='fd7a63c0c6c822c4' id='c0b39e85'/>
    <typedef-decl name='spdk_bdev_for_each_channel_done' type-id='63befa86' size-in-bits='64' filepath='bdev.h' line='2384' column='1' hash='fd7a63c0c6c822c4' id='6877d703'/>
    <typedef-decl name='spdk_bdev_for_each_channel_msg' type-id='02f8bb3b' size-in-bits='64' filepath='bdev.h' line='2374' column='1' hash='fd7a63c0c6c822c4' id='8dfa98e0'/>
    <typedef-decl name='spdk_bdev_for_each_io_cb' type-id='82328a76' size-in-bits='64' filepath='bdev_module.h' line='1755' column='1' hash='fd7a63c0c6c822c4' id='2a89b26d'/>
    <typedef-decl name='spdk_bdev_get_current_qd_cb' type-id='cca2f98d' size-in-bits='64' filepath='bdev_module.h' line='1774' column='1' hash='fd7a63c0c6c822c4' id='9ffc5ccb'/>
    <typedef-decl name='spdk_bdev_get_device_stat_cb' type-id='e7effd86' size-in-bits='64' filepath='bdev.h' line='365' column='1' hash='fd7a63c0c6c822c4' id='75d8d625'/>
    <typedef-decl name='spdk_bdev_histogram_data_cb' type-id='77ad7f6c' size-in-bits='64' filepath='bdev.h' line='2252' column='1' hash='fd7a63c0c6c822c4' id='fb45a108'/>
    <typedef-decl name='spdk_bdev_histogram_status_cb' type-id='82328a76' size-in-bits='64' filepath='bdev.h' line='2251' column='1' hash='fd7a63c0c6c822c4' id='7598a612'/>
    <typedef-decl name='spdk_bdev_init_cb' type-id='82328a76' size-in-bits='64' filepath='bdev.h' line='357' column='1' hash='fd7a63c0c6c822c4' id='549b7513'/>
    <typedef-decl name='spdk_bdev_io_completion_cb' type-id='ded68652' size-in-bits='64' filepath='bdev.h' line='167' column='1' hash='fd7a63c0c6c822c4' id='a720f07e'/>
    <typedef-decl name='spdk_bdev_io_fn' type-id='4054e975' size-in-bits='64' filepath='bdev_module.h' line='1754' column='1' hash='fd7a63c0c6c822c4' id='767f193c'/>
    <typedef-decl name='spdk_bdev_io_get_aux_buf_cb' type-id='7d3cc107' size-in-bits='64' filepath='bdev_module.h' line='808' column='1' hash='fd7a63c0c6c822c4' id='030e7a71'/>
    <typedef-decl name='spdk_bdev_io_get_buf_cb' type-id='da0e17ef' size-in-bits='64' filepath='bdev_module.h' line='797' column='1' hash='fd7a63c0c6c822c4' id='cb1f5f5e'/>
    <typedef-decl name='spdk_bdev_io_timeout_cb' type-id='657735e0' size-in-bits='64' filepath='bdev.h' line='374' column='1' hash='fd7a63c0c6c822c4' id='85d4a35d'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='61359e15' size-in-bits='64' filepath='bdev.h' line='2111' column='1' hash='fd7a63c0c6c822c4' id='065af103'/>
    <typedef-decl name='spdk_bdev_open_async_cb_t' type-id='da652544' size-in-bits='64' filepath='bdev.h' line='517' column='1' hash='fd7a63c0c6c822c4' id='832c5abb'/>
    <typedef-decl name='spdk_bdev_quiesce_cb' type-id='82328a76' size-in-bits='64' filepath='bdev_module.h' line='1819' column='1' hash='fd7a63c0c6c822c4' id='40a6f2e4'/>
    <typedef-decl name='spdk_bdev_unregister_cb' type-id='82328a76' size-in-bits='64' filepath='bdev_module.h' line='298' column='1' hash='fd7a63c0c6c822c4' id='10afdbb3'/>
    <typedef-decl name='spdk_bdev_wait_for_examine_cb' type-id='61359e15' size-in-bits='64' filepath='bdev.h' line='318' column='1' hash='fd7a63c0c6c822c4' id='0cadf036'/>
    <typedef-decl name='spdk_dif_pi_format_t' type-id='d940afde' size-in-bits='32' alignment-in-bits='32' filepath='bdev.c' line='5226' column='1' hash='5a03827420007bb5' id='48a27c51'/>
    <typedef-decl name='spdk_dif_type_t' type-id='388e2dcf' size-in-bits='32' alignment-in-bits='32' filepath='bdev.c' line='5225' column='1' hash='67f6f95a0f174265' id='82daf048'/>
    <typedef-decl name='spdk_for_each_bdev_fn' type-id='5f75062e' size-in-bits='64' filepath='bdev.h' line='583' column='1' hash='fd7a63c0c6c822c4' id='8e1b2c43'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='86c1c05e' size-in-bits='64' filepath='thread.h' line='1110' column='1' hash='fd7a63c0c6c822c4' id='8b006695'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' hash='037c09e5626cce93' id='d0f1c0cb'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='320' hash='02b555112baeaec2' id='d7aacc58'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' hash='87dcd7386226cc55' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' hash='953f9801eb087566' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <union-decl name='__bdev_internal_claim' visibility='default' size-in-bits='192' filepath='bdev_module.h' line='697' column='1' hash='921a5583c888cfff' id='8de368de'>
      <data-member access='public'>
        <var-decl name='v1' type-id='2ed5d19b' visibility='default' filepath='bdev_module.h' line='707' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='v2' type-id='2fd5d32e' visibility='default' filepath='bdev_module.h' line='714' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_bdev_nvme_cdw12' visibility='default' size-in-bits='32' filepath='bdev.h' line='247' column='1' hash='1b1e692214862a53' id='664541c5'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='bdev.h' line='248' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fad' visibility='default' filepath='bdev.h' line='255' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_bdev_nvme_cdw13' visibility='default' size-in-bits='32' filepath='bdev.h' line='264' column='1' hash='1c55ab948a69b62a' id='65454032'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='bdev.h' line='265' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fac' visibility='default' filepath='bdev.h' line='271' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_bdev_nvme_ctratt' visibility='default' size-in-bits='32' filepath='bdev.h' line='230' column='1' hash='14c58c11530c9fc9' id='3ebecae4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='bdev.h' line='231' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fae' visibility='default' filepath='bdev.h' line='238' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1090' column='1' hash='f729993487cda28e' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43f98' visibility='default' filepath='nvme_spec.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fb2' visibility='default' filepath='nvme_spec.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43f9f' visibility='default' filepath='nvme_spec.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43f93' visibility='default' filepath='nvme_spec.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43f92' visibility='default' filepath='nvme_spec.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43faf' visibility='default' filepath='nvme_spec.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fb0' visibility='default' filepath='nvme_spec.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43f99' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1218' column='1' hash='c6f24a4417ec38ae' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='1256' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43f8d' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1283' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1284' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1285' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default' filepath='nvme_spec.h' line='1287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43f94' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1301' column='1' hash='409f50359a910183' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43f9a' visibility='default' filepath='nvme_spec.h' line='1321' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43f9c' visibility='default' filepath='nvme_spec.h' line='1342' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write_zeroes' type-id='e7f43f9b' visibility='default' filepath='nvme_spec.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default' filepath='nvme_spec.h' line='1362' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default' filepath='nvme_spec.h' line='1363' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw13' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1367' column='1' hash='07c32d403035ba47' id='9683a609'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1368' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='1376' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' visibility='default' size-in-bits='8' filepath='nvme_spec.h' line='865' column='1' hash='b194772d5bf0827f' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb9' visibility='default' filepath='nvme_spec.h' line='875' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='697' column='1' hash='44475d80415793ca' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='713' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='882' column='1' hash='b02e6967552029f4' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f86' visibility='default' filepath='nvme_spec.h' line='894' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='773' column='1' hash='f0de7008476a1512' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='774' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb4' visibility='default' filepath='nvme_spec.h' line='783' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1036' column='1' hash='c76756b07e5ea163' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8e' visibility='default' filepath='nvme_spec.h' line='1042' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1049' column='1' hash='42632b5a443edf37' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f90' visibility='default' filepath='nvme_spec.h' line='1058' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1065' column='1' hash='a6348cbe8cd5c862' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1073' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1080' column='1' hash='d0d5826be39cc841' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f91' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='990' column='1' hash='418fe3865b0daf94' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8f' visibility='default' filepath='nvme_spec.h' line='997' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='819' column='1' hash='e2d9e57a46b61039' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='820' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb3' visibility='default' filepath='nvme_spec.h' line='829' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='836' column='1' hash='73897c16e3d2eec5' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f95' visibility='default' filepath='nvme_spec.h' line='846' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='933' column='1' hash='426ac8873573abb9' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='934' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f96' visibility='default' filepath='nvme_spec.h' line='938' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='739' column='1' hash='ccac3eb052b5bf75' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa0' visibility='default' filepath='nvme_spec.h' line='746' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='804' column='1' hash='21b1a862c233b552' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='805' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9e' visibility='default' filepath='nvme_spec.h' line='812' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='722' column='1' hash='91f449230aa78a07' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='723' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='732' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1004' column='1' hash='e7d28a5a2732c962' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fab' visibility='default' filepath='nvme_spec.h' line='1015' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1023' column='1' hash='f8eb99c82fc1cc49' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='1029' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='753' column='1' hash='e07ef12254b4bb9e' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='754' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb5' visibility='default' filepath='nvme_spec.h' line='766' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='790' column='1' hash='cb8fe3c5aab3fa2d' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb6' visibility='default' filepath='nvme_spec.h' line='797' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='854' column='1' hash='fa2b0cbfb10fd99e' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='1728' is-anonymous='yes' filepath='bdev_module.h' line='1114' column='1' hash='db6320a892515bcd' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='bdev' type-id='3278f957' visibility='default' filepath='bdev_module.h' line='1115' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='reset' type-id='c84a940d' visibility='default' filepath='bdev_module.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='c93a059e' visibility='default' filepath='bdev_module.h' line='1117' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_passthru' type-id='726000dd' visibility='default' filepath='bdev_module.h' line='1118' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='zone_mgmt' type-id='0ddb89f6' visibility='default' filepath='bdev_module.h' line='1119' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='bdev_module.h' line='1003' column='1' hash='b60b06ae3d4f6ec8#2' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='nvme' type-id='e7f43f88' visibility='default' filepath='bdev_module.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='e7f43fbd' visibility='default' filepath='bdev_module.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='aio_result' type-id='95e97e5e' visibility='default' filepath='bdev_module.h' line='1024' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1399' column='1' hash='816ecb30b0290a0d#3' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fb8' visibility='default' filepath='nvme_spec.h' line='1403' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1405' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='bdev_module.h' line='950' column='1' hash='63ce20cbb3ded05b#4' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43fba' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='bdev_module.h' line='973' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='616' column='1' hash='a4f7edd433d5d683#5' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fbc' visibility='default' filepath='nvme_spec.h' line='621' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43f97' visibility='default' filepath='nvme_spec.h' line='628' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fb7' visibility='default' filepath='nvme_spec.h' line='635' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1409' column='1' hash='da1c95d1e3eef926#6' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default' filepath='nvme_spec.h' line='1411' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1414' column='1' hash='4a7be3dda6ac3828#7' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default' filepath='nvme_spec.h' line='1416' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1419' column='1' hash='2f03c919c9633549#8' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default' filepath='nvme_spec.h' line='1421' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1424' column='1' hash='c676782a7293be7f#9' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1425' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw13_bits' type-id='9683a609' visibility='default' filepath='nvme_spec.h' line='1426' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='uuid.h' line='22' column='1' hash='83563518080289b9#10' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='ce148c48' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9804fe47'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='f6507fdd' const='yes' hash='1d6ec319e07131b3' id='778a632a'/>
    <pointer-type-def type-id='778a632a' size-in-bits='64' hash='835706f99d675a14' id='2ed9d900'/>
    <qualified-type-def type-id='ad35c6ef' const='yes' hash='faffdbd0d439ac19' id='fc18994a'/>
    <pointer-type-def type-id='fc18994a' size-in-bits='64' hash='a5f298522ab679f5' id='3ab97220'/>
    <qualified-type-def type-id='bcf92cc1' const='yes' hash='0807d589d0cae6ec' id='73f42124'/>
    <pointer-type-def type-id='73f42124' size-in-bits='64' hash='b2c64a4ed99f5b4a' id='9750090a'/>
    <qualified-type-def type-id='68ee9836' const='yes' hash='be2bf10ba82f6666' id='0f6d3567'/>
    <pointer-type-def type-id='0f6d3567' size-in-bits='64' hash='b7504693659a2d06' id='95eae837'/>
    <qualified-type-def type-id='66579779' const='yes' hash='91cde9e0bb949f17' id='a9077006'/>
    <pointer-type-def type-id='a9077006' size-in-bits='64' hash='5863d4789bd53105' id='42b59544'/>
    <qualified-type-def type-id='a0e8c12d' const='yes' hash='0e7e0d4fe7fff5ae' id='9fe70d7e'/>
    <pointer-type-def type-id='9fe70d7e' size-in-bits='64' hash='1132b0dad5e15ab9' id='0cb9fb3c'/>
    <qualified-type-def type-id='429c70d3' const='yes' hash='7e397e1f3d0802a3' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' hash='8dd43daba5434137' id='c2482856'/>
    <pointer-type-def type-id='ad11f404' size-in-bits='64' hash='fd7a63c0c6c822c4' id='494cdc6d'/>
    <pointer-type-def type-id='b39d85cf' size-in-bits='64' hash='fd7a63c0c6c822c4' id='65e3965a'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c04372aa'/>
    <pointer-type-def type-id='35697d21' size-in-bits='64' hash='fd7a63c0c6c822c4' id='5f75062e'/>
    <pointer-type-def type-id='afa6aed4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4054e975'/>
    <pointer-type-def type-id='bbbd7ee8' size-in-bits='64' hash='fd7a63c0c6c822c4' id='7b67b143'/>
    <pointer-type-def type-id='4c7d72bf' size-in-bits='64' hash='fd7a63c0c6c822c4' id='d3d1557a'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='cc4b1be9' size-in-bits='64' hash='8de6cf6a3609be5f' id='5d3cb3f9'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' hash='7843d734ca1a697b' id='7b7cfb3d'/>
    <pointer-type-def type-id='7b7cfb3d' size-in-bits='64' hash='6233882fbfec1a8f' id='7cbf4535'/>
    <pointer-type-def type-id='5b4f6d22' size-in-bits='64' hash='d8532003f0fba7f9' id='6e513b50'/>
    <pointer-type-def type-id='6e513b50' size-in-bits='64' hash='731936f57bd77a33' id='23e0a10e'/>
    <pointer-type-def type-id='e83ba9cd' size-in-bits='64' hash='ee88b9424b6af4fb' id='d1fbfd3d'/>
    <pointer-type-def type-id='3c4ef00f' size-in-bits='64' hash='9d19c2a3045e20a1' id='6a0b3d87'/>
    <pointer-type-def type-id='b07aafe1' size-in-bits='64' hash='da13773f765bbdca' id='faf6ec89'/>
    <pointer-type-def type-id='68ee9836' size-in-bits='64' hash='95cc5412fcf6bc7b' id='378e9c1c'/>
    <pointer-type-def type-id='378e9c1c' size-in-bits='64' hash='a3078a756a8912aa' id='ab7fe902'/>
    <pointer-type-def type-id='21c89d01' size-in-bits='64' hash='3d4441cba1a9f343' id='08cc63f9'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' hash='c39cdf2a9611d4e3' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' hash='07d61e08616d2ce2' id='fccc38b9'/>
    <pointer-type-def type-id='66579779' size-in-bits='64' hash='8a88f44517cc2dee' id='5ed322e1'/>
    <pointer-type-def type-id='3384ef92' size-in-bits='64' hash='b801e000dde8ec89' id='b509a840'/>
    <pointer-type-def type-id='b509a840' size-in-bits='64' hash='5554de9e63c368f3' id='68341ede'/>
    <pointer-type-def type-id='564b2089' size-in-bits='64' hash='419e1576f4781d28' id='87d40811'/>
    <pointer-type-def type-id='87d40811' size-in-bits='64' hash='be424f90483b7ac4' id='0dc8f4e1'/>
    <pointer-type-def type-id='5baf3205' size-in-bits='64' hash='051e3bd0ba3f7665' id='b0e2c7a5'/>
    <pointer-type-def type-id='67e84164' size-in-bits='64' hash='ee658de107b8e928' id='f85a6e52'/>
    <pointer-type-def type-id='58e40e79' size-in-bits='64' hash='974e89a90dcfc21e' id='d6a52c01'/>
    <pointer-type-def type-id='60908454' size-in-bits='64' hash='3d8105712896e7d9' id='f495ac72'/>
    <pointer-type-def type-id='9e5a028f' size-in-bits='64' hash='3613f722342ded94' id='72176057'/>
    <pointer-type-def type-id='ff41ade1' size-in-bits='64' hash='fd7a63c0c6c822c4' id='0bad6792'/>
    <pointer-type-def type-id='71e32ba2' size-in-bits='64' hash='7a5ac91511c7d708' id='29210180'/>
    <pointer-type-def type-id='a6dc9de4' size-in-bits='64' hash='f13879d37c217898' id='ddda0722'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <pointer-type-def type-id='9faeb5ea' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ca171b4f'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='ce3367a6' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82f59c11'/>
    <pointer-type-def type-id='0ea372f5' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e7effd86'/>
    <pointer-type-def type-id='8e4c24e7' size-in-bits='64' hash='fd7a63c0c6c822c4' id='0aba57e8'/>
    <pointer-type-def type-id='23d11b4a' size-in-bits='64' hash='fd7a63c0c6c822c4' id='cca2f98d'/>
    <pointer-type-def type-id='b8266255' size-in-bits='64' hash='fd7a63c0c6c822c4' id='63befa86'/>
    <pointer-type-def type-id='c111c508' size-in-bits='64' hash='fd7a63c0c6c822c4' id='02f8bb3b'/>
    <pointer-type-def type-id='87b3c50d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='da652544'/>
    <pointer-type-def type-id='10183a3e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='78d860eb'/>
    <pointer-type-def type-id='8e4e1999' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ded68652'/>
    <pointer-type-def type-id='6e648722' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c26c29b3'/>
    <pointer-type-def type-id='340a4f32' size-in-bits='64' hash='fd7a63c0c6c822c4' id='da0e17ef'/>
    <pointer-type-def type-id='6f151b7c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='7d3cc107'/>
    <pointer-type-def type-id='84d13285' size-in-bits='64' hash='fd7a63c0c6c822c4' id='86c1c05e'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c640490b'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='61359e15'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <pointer-type-def type-id='1b3c02f3' size-in-bits='64' hash='fd7a63c0c6c822c4' id='77ad7f6c'/>
    <pointer-type-def type-id='44b9313b' size-in-bits='64' hash='fd7a63c0c6c822c4' id='657735e0'/>
    <pointer-type-def type-id='4c5ca311' size-in-bits='64' hash='fd7a63c0c6c822c4' id='28c1e414'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='75964865'/>
    <qualified-type-def type-id='95e97e5e' volatile='yes' hash='ae69415523d5e788' id='e024ff18'/>
    <pointer-type-def type-id='55c06e10' size-in-bits='64' id='65b579a6'/>
    <pointer-type-def type-id='65b579a6' size-in-bits='64' id='a8ae5764'/>
    <pointer-type-def type-id='e2580b88' size-in-bits='64' id='d4aefa7e'/>
    <pointer-type-def type-id='b8a34da1' size-in-bits='64' id='63c91ce9'/>
    <pointer-type-def type-id='8b0b3e5c' size-in-bits='64' id='1616ecea'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='0094857f' size-in-bits='64' id='3ecde4cf'/>
    <pointer-type-def type-id='50304e26' size-in-bits='64' id='0bc48c8c'/>
    <pointer-type-def type-id='eb57c427' size-in-bits='64' id='c0bd1bdf'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='2e6655e1' size-in-bits='64' id='e7041c49'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <class-decl name='spdk_accel_sequence' is-struct='yes' visibility='default' is-declaration-only='yes' id='e2580b88'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_spinlock_internal' is-struct='yes' visibility='default' is-declaration-only='yes' id='2e6655e1'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <var-decl name='g_trace_file' type-id='ddda0722' visibility='default' filepath='trace.h' line='149' column='1' elf-symbol-id='g_trace_file'/>
    <class-decl name='lba_range' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='134' column='1' id='55c06e10'/>
    <class-decl name='spdk_bdev_qos' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='189' column='1' id='eb57c427'/>
    <class-decl name='spdk_bdev_channel' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='273' column='1' id='b8a34da1'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='339' column='1' id='43454627'/>
    <class-decl name='spdk_bdev_channel_iter' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='378' column='1' id='8b0b3e5c'/>
    <class-decl name='spdk_bdev_io_error_stat' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bdev.c' line='385' column='1' id='50304e26'/>
    <function-decl name='spdk_bdev_get_opts' mangled-name='spdk_bdev_get_opts' filepath='bdev.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_opts' hash='b9ee04331c4e791f'>
      <parameter type-id='f495ac72' name='opts' filepath='bdev.c' line='468' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='bdev.c' line='468' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_opts' mangled-name='spdk_bdev_set_opts' filepath='bdev.c' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_opts' hash='3621a86ecb013342'>
      <parameter type-id='f495ac72' name='opts' filepath='bdev.c' line='501' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_by_name' mangled-name='spdk_bdev_get_by_name' filepath='bdev.c' line='563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_by_name' hash='6d99851ff280c495'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='563' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_wait_for_examine' mangled-name='spdk_bdev_wait_for_examine' filepath='bdev.c' line='631' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_wait_for_examine' hash='a7f99494147764a8'>
      <parameter type-id='0cadf036' name='cb_fn' filepath='bdev.c' line='631' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='631' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_examine' mangled-name='spdk_bdev_examine' filepath='bdev.c' line='833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_examine' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='io_type_string' filepath='bdev.c' line='4070' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_first' mangled-name='spdk_bdev_first' filepath='bdev.c' line='888' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first' hash='c16b89a4bec5a5cf'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next' mangled-name='spdk_bdev_next' filepath='bdev.c' line='901' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next' hash='b27681a3a076bbb3'>
      <parameter type-id='7b7cfb3d' name='prev' filepath='bdev.c' line='942' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_first_leaf' mangled-name='spdk_bdev_first_leaf' filepath='bdev.c' line='928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first_leaf' hash='c16b89a4bec5a5cf'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next_leaf' mangled-name='spdk_bdev_next_leaf' filepath='bdev.c' line='942' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next_leaf' hash='b27681a3a076bbb3'>
      <parameter type-id='7b7cfb3d' name='prev' filepath='bdev.c' line='942' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_buf' mangled-name='spdk_bdev_io_set_buf' filepath='bdev.c' line='1025' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_buf' hash='2e8857973f49d411'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1044' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='1044' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='bdev.c' line='1044' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_md_buf' mangled-name='spdk_bdev_io_set_md_buf' filepath='bdev.c' line='1044' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_md_buf' hash='2e8857973f49d411'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1044' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='1044' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='bdev.c' line='1044' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_put_aux_buf' mangled-name='spdk_bdev_io_put_aux_buf' filepath='bdev.c' line='1581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_put_aux_buf' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1581' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='1581' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_buf' mangled-name='spdk_bdev_io_get_buf' filepath='bdev.c' line='1970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_buf' hash='473841ec7494f402'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='1970' column='1'/>
      <parameter type-id='cb1f5f5e' name='cb' filepath='bdev.c' line='1970' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='bdev.c' line='1970' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aux_buf' mangled-name='spdk_bdev_io_get_aux_buf' filepath='bdev.c' line='2035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aux_buf' hash='8f405d14c7682d7c'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='2035' column='1'/>
      <parameter type-id='030e7a71' name='cb' filepath='bdev.c' line='2035' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_subsystem_config_json' mangled-name='spdk_bdev_subsystem_config_json' filepath='bdev.c' line='2116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_subsystem_config_json' hash='7f32ffea222edbe7'>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='2116' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_init_done' mangled-name='spdk_bdev_module_init_done' filepath='bdev.c' line='2301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_init_done' hash='70200b8165a41b20'>
      <parameter type-id='b509a840' name='bdev_module' filepath='bdev.c' line='9673' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_examine_done' mangled-name='spdk_bdev_module_examine_done' filepath='bdev.c' line='2308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_examine_done' hash='70200b8165a41b20'>
      <parameter type-id='b509a840' name='bdev_module' filepath='bdev.c' line='9673' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_initialize' mangled-name='spdk_bdev_initialize' filepath='bdev.c' line='2358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_initialize' hash='5695f5ce05a4c55f'>
      <parameter type-id='549b7513' name='cb_fn' filepath='bdev.c' line='2358' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='2358' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_done' mangled-name='spdk_bdev_module_fini_done' filepath='bdev.c' line='2496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_done' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_start_done' mangled-name='spdk_bdev_module_fini_start_done' filepath='bdev.c' line='2608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_start_done' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_finish' mangled-name='spdk_bdev_finish' filepath='bdev.c' line='2626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_finish' hash='5695f5ce05a4c55f'>
      <parameter type-id='c0b39e85' name='cb_fn' filepath='bdev.c' line='2626' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='2626' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_free_io' mangled-name='spdk_bdev_free_io' filepath='bdev.c' line='2670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_free_io' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='2670' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_type_supported' mangled-name='spdk_bdev_io_type_supported' filepath='bdev.c' line='4016' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_type_supported' hash='4b021987505b7748'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4016' column='1'/>
      <parameter type-id='9cd6c10c' name='io_type' filepath='bdev.c' line='4016' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_type_name' mangled-name='spdk_bdev_get_io_type_name' filepath='bdev.c' line='4060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_type_name' hash='fa937add68fe6e20'>
      <parameter type-id='9cd6c10c' name='io_type' filepath='bdev.c' line='4060' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_type' mangled-name='spdk_bdev_get_io_type' filepath='bdev.c' line='4070' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_type' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='io_type_string' filepath='bdev.c' line='4070' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_submit_tsc' mangled-name='spdk_bdev_io_get_submit_tsc' filepath='bdev.c' line='4084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_submit_tsc' hash='6374d4b25620e2b4'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='4084' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_hide_metadata' mangled-name='spdk_bdev_io_hide_metadata' filepath='bdev.c' line='4090' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_hide_metadata' hash='a4f4ac556e464dc2'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='4090' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_dump_info_json' mangled-name='spdk_bdev_dump_info_json' filepath='bdev.c' line='4096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_dump_info_json' hash='5de93a74a07e05e2'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='4096' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='4096' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_timeout' mangled-name='spdk_bdev_set_timeout' filepath='bdev.c' line='4404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_timeout' hash='1db3e6a393d2aa95'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='4404' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_in_sec' filepath='bdev.c' line='4404' column='1'/>
      <parameter type-id='85d4a35d' name='cb_fn' filepath='bdev.c' line='4405' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='4405' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_add_io_stat' mangled-name='spdk_bdev_add_io_stat' filepath='bdev.c' line='4734' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_add_io_stat' hash='cfd6b2b7d156c6dd'>
      <parameter type-id='08cc63f9' name='total' filepath='bdev.c' line='4734' column='1'/>
      <parameter type-id='08cc63f9' name='add' filepath='bdev.c' line='4734' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_reset_io_stat' mangled-name='spdk_bdev_reset_io_stat' filepath='bdev.c' line='4786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_reset_io_stat' hash='0eb24d7fa6091c33'>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='4786' column='1'/>
      <parameter type-id='c463dc5d' name='mode' filepath='bdev.c' line='4786' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_dump_io_stat_json' mangled-name='spdk_bdev_dump_io_stat_json' filepath='bdev.c' line='4858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_dump_io_stat_json' hash='c409947cb0343f0c'>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='4858' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='bdev.c' line='4858' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_add' mangled-name='spdk_bdev_alias_add' filepath='bdev.c' line='4984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_add' hash='2e28a748c17fffe6'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5030' column='1'/>
      <parameter type-id='80f4b756' name='alias' filepath='bdev.c' line='5030' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del' mangled-name='spdk_bdev_alias_del' filepath='bdev.c' line='5030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del' hash='2e28a748c17fffe6'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5030' column='1'/>
      <parameter type-id='80f4b756' name='alias' filepath='bdev.c' line='5030' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del_all' mangled-name='spdk_bdev_alias_del_all' filepath='bdev.c' line='5043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del_all' hash='c16b89a4bec5a5cf'>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_channel' mangled-name='spdk_bdev_get_io_channel' filepath='bdev.c' line='5055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_channel' hash='7f32ffea222edbe7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5055' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_ctx' mangled-name='spdk_bdev_get_module_ctx' filepath='bdev.c' line='5061' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_ctx' hash='7f32ffea222edbe7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5061' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_name' mangled-name='spdk_bdev_get_module_name' filepath='bdev.c' line='5074' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_name' hash='bcf1a2e368e93db5'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5086' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_name' mangled-name='spdk_bdev_get_name' filepath='bdev.c' line='5080' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_name' hash='bcf1a2e368e93db5'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5086' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_product_name' mangled-name='spdk_bdev_get_product_name' filepath='bdev.c' line='5086' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_product_name' hash='bcf1a2e368e93db5'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5086' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_aliases' mangled-name='spdk_bdev_get_aliases' filepath='bdev.c' line='5092' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_aliases' hash='b84f391d2217a10e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5092' column='1'/>
      <return type-id='3ab97220'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_block_size' mangled-name='spdk_bdev_get_block_size' filepath='bdev.c' line='5098' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_block_size' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_write_unit_size' mangled-name='spdk_bdev_get_write_unit_size' filepath='bdev.c' line='5104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_write_unit_size' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_num_blocks' mangled-name='spdk_bdev_get_num_blocks' filepath='bdev.c' line='5110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_num_blocks' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5311' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rpc_type' mangled-name='spdk_bdev_get_qos_rpc_type' filepath='bdev.c' line='5116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rpc_type' hash='516435a0a608ca41'>
      <parameter type-id='3270d5b4' name='type' filepath='bdev.c' line='5116' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rate_limits' mangled-name='spdk_bdev_get_qos_rate_limits' filepath='bdev.c' line='5122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rate_limits' hash='f36b3daef6a95224'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5122' column='1'/>
      <parameter type-id='5d6479ae' name='limits' filepath='bdev.c' line='5122' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_buf_align' mangled-name='spdk_bdev_get_buf_align' filepath='bdev.c' line='5145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_buf_align' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5145' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_optimal_io_boundary' mangled-name='spdk_bdev_get_optimal_io_boundary' filepath='bdev.c' line='5151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_optimal_io_boundary' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_has_write_cache' mangled-name='spdk_bdev_has_write_cache' filepath='bdev.c' line='5157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_has_write_cache' hash='51b80285f7c21eb9'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5245' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_uuid' mangled-name='spdk_bdev_get_uuid' filepath='bdev.c' line='5163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_uuid' hash='6f83be4bd13f2c1e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5163' column='1'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_acwu' mangled-name='spdk_bdev_get_acwu' filepath='bdev.c' line='5169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_acwu' hash='6395061da52b1bcd'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5169' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_md_size' mangled-name='spdk_bdev_get_md_size' filepath='bdev.c' line='5175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_md_size' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_interleaved' mangled-name='spdk_bdev_is_md_interleaved' filepath='bdev.c' line='5181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_interleaved' hash='51b80285f7c21eb9'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5245' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_separate' mangled-name='spdk_bdev_is_md_separate' filepath='bdev.c' line='5187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_separate' hash='51b80285f7c21eb9'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5245' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_zoned' mangled-name='spdk_bdev_is_zoned' filepath='bdev.c' line='5193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_zoned' hash='51b80285f7c21eb9'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5245' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_data_block_size' mangled-name='spdk_bdev_get_data_block_size' filepath='bdev.c' line='5199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_data_block_size' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_physical_block_size' mangled-name='spdk_bdev_get_physical_block_size' filepath='bdev.c' line='5209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_physical_block_size' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_dif_type' mangled-name='spdk_bdev_get_dif_type' filepath='bdev.c' line='5229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_dif_type' hash='41424a4583bb4a3f'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5229' column='1'/>
      <return type-id='82daf048'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_dif_pi_format' mangled-name='spdk_bdev_get_dif_pi_format' filepath='bdev.c' line='5239' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_dif_pi_format' hash='5a88da8f1a26ceda'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5239' column='1'/>
      <return type-id='48a27c51'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_head_of_md' mangled-name='spdk_bdev_is_dif_head_of_md' filepath='bdev.c' line='5245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_head_of_md' hash='51b80285f7c21eb9'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5245' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_check_enabled' mangled-name='spdk_bdev_is_dif_check_enabled' filepath='bdev.c' line='5255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_check_enabled' hash='92f6070342e626f8'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5255' column='1'/>
      <parameter type-id='91a2c9e2' name='check_type' filepath='bdev.c' line='5256' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_copy' mangled-name='spdk_bdev_get_max_copy' filepath='bdev.c' line='5287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_copy' hash='2e1ac593ae37c69e'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5287' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd' mangled-name='spdk_bdev_get_qd' filepath='bdev.c' line='5293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5311' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd_sampling_period' mangled-name='spdk_bdev_get_qd_sampling_period' filepath='bdev.c' line='5299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd_sampling_period' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5311' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_weighted_io_time' mangled-name='spdk_bdev_get_weighted_io_time' filepath='bdev.c' line='5305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_weighted_io_time' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5311' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_time' mangled-name='spdk_bdev_get_io_time' filepath='bdev.c' line='5311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_time' hash='00d637ba7e43fa4d'>
      <parameter type-id='2ed9d900' name='bdev' filepath='bdev.c' line='5311' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_nvme_ctratt' mangled-name='spdk_bdev_get_nvme_ctratt' filepath='bdev.c' line='5316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_nvme_ctratt' hash='c16b89a4bec5a5cf'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5316' column='1'/>
      <return type-id='3ebecae4'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_nvme_nsid' mangled-name='spdk_bdev_get_nvme_nsid' filepath='bdev.c' line='5322' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_nvme_nsid' hash='64817e388cbcebcd'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5322' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_block_size' mangled-name='spdk_bdev_desc_get_block_size' filepath='bdev.c' line='5328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_block_size' hash='2bb88322482ae81c'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5336' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_md_size' mangled-name='spdk_bdev_desc_get_md_size' filepath='bdev.c' line='5336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_md_size' hash='2bb88322482ae81c'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5336' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_is_md_interleaved' mangled-name='spdk_bdev_desc_is_md_interleaved' filepath='bdev.c' line='5344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_is_md_interleaved' hash='c7c710e908194b91'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5376' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_is_md_separate' mangled-name='spdk_bdev_desc_is_md_separate' filepath='bdev.c' line='5352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_is_md_separate' hash='c7c710e908194b91'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5376' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_dif_type' mangled-name='spdk_bdev_desc_get_dif_type' filepath='bdev.c' line='5360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_dif_type' hash='1afc715967b69673'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5360' column='1'/>
      <return type-id='82daf048'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_dif_pi_format' mangled-name='spdk_bdev_desc_get_dif_pi_format' filepath='bdev.c' line='5368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_dif_pi_format' hash='6089212544da573b'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5368' column='1'/>
      <return type-id='48a27c51'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_is_dif_head_of_md' mangled-name='spdk_bdev_desc_is_dif_head_of_md' filepath='bdev.c' line='5376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_is_dif_head_of_md' hash='c7c710e908194b91'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5376' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_is_dif_check_enabled' mangled-name='spdk_bdev_desc_is_dif_check_enabled' filepath='bdev.c' line='5384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_is_dif_check_enabled' hash='f2ce4701427ff7d6'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5384' column='1'/>
      <parameter type-id='91a2c9e2' name='check_type' filepath='bdev.c' line='5385' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_qd_sampling_period' mangled-name='spdk_bdev_set_qd_sampling_period' filepath='bdev.c' line='5462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_qd_sampling_period' hash='9ecd6ca968910ce6'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5462' column='1'/>
      <parameter type-id='9c313c2d' name='period' filepath='bdev.c' line='5462' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_current_qd' mangled-name='spdk_bdev_get_current_qd' filepath='bdev.c' line='5522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_current_qd' hash='c62bc25666eb5e2b'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5522' column='1'/>
      <parameter type-id='9ffc5ccb' name='cb_fn' filepath='bdev.c' line='5522' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5523' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_notify_blockcnt_change' mangled-name='spdk_bdev_notify_blockcnt_change' filepath='bdev.c' line='5584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_notify_blockcnt_change' hash='50b96c3224117fc1'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='5584' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='bdev.c' line='5584' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_seek_data' mangled-name='spdk_bdev_seek_data' filepath='bdev.c' line='5712' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_seek_data' hash='1db3e6a393d2aa95'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5720' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5720' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5721' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5722' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5722' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_seek_hole' mangled-name='spdk_bdev_seek_hole' filepath='bdev.c' line='5720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_seek_hole' hash='1db3e6a393d2aa95'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='5720' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='5720' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='5721' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='5722' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='5722' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_seek_offset' mangled-name='spdk_bdev_io_get_seek_offset' filepath='bdev.c' line='5728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_seek_offset' hash='1b226c0bea5b9dcd'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='5728' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_read' mangled-name='spdk_bdev_read' filepath='bdev.c' line='5772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6409' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6409' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks' mangled-name='spdk_bdev_read_blocks' filepath='bdev.c' line='5786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6409' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6409' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks_with_md' mangled-name='spdk_bdev_read_blocks_with_md' filepath='bdev.c' line='5794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks_with_md' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6418' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6418' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv' mangled-name='spdk_bdev_readv' filepath='bdev.c' line='5815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6339' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks' mangled-name='spdk_bdev_readv_blocks' filepath='bdev.c' line='5881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6339' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_with_md' mangled-name='spdk_bdev_readv_blocks_with_md' filepath='bdev.c' line='5893' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_with_md' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6349' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6349' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_ext' mangled-name='spdk_bdev_readv_blocks_ext' filepath='bdev.c' line='5928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_ext' hash='a87c9eeb14d48fe5'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6176' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6176' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6177' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6177' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6178' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6178' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6179' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6179' column='1'/>
      <parameter type-id='faf6ec89' name='opts' filepath='bdev.c' line='6180' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write' mangled-name='spdk_bdev_write' filepath='bdev.c' line='6025' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6409' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6409' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks' mangled-name='spdk_bdev_write_blocks' filepath='bdev.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6409' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6409' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks_with_md' mangled-name='spdk_bdev_write_blocks_with_md' filepath='bdev.c' line='6048' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks_with_md' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6418' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6418' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev' mangled-name='spdk_bdev_writev' filepath='bdev.c' line='6127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6339' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks' mangled-name='spdk_bdev_writev_blocks' filepath='bdev.c' line='6142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6339' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_with_md' mangled-name='spdk_bdev_writev_blocks_with_md' filepath='bdev.c' line='6155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_with_md' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6349' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6349' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_ext' mangled-name='spdk_bdev_writev_blocks_ext' filepath='bdev.c' line='6176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_ext' hash='a87c9eeb14d48fe5'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6176' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6176' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6177' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6177' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6178' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6178' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6179' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6179' column='1'/>
      <parameter type-id='faf6ec89' name='opts' filepath='bdev.c' line='6180' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks' mangled-name='spdk_bdev_comparev_blocks' filepath='bdev.c' line='6336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6336' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6337' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6338' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6339' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks_with_md' mangled-name='spdk_bdev_comparev_blocks_with_md' filepath='bdev.c' line='6346' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks_with_md' hash='eb2d6726588f51c1'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6346' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6347' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6348' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6349' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6349' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks' mangled-name='spdk_bdev_compare_blocks' filepath='bdev.c' line='6407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6407' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6408' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6409' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6409' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks_with_md' mangled-name='spdk_bdev_compare_blocks_with_md' filepath='bdev.c' line='6416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks_with_md' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6416' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6417' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6418' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6418' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_and_writev_blocks' mangled-name='spdk_bdev_comparev_and_writev_blocks' filepath='bdev.c' line='6542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_and_writev_blocks' hash='7743bcb9011eef53'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6542' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6542' column='1'/>
      <parameter type-id='cc4b1be9' name='compare_iov' filepath='bdev.c' line='6543' column='1'/>
      <parameter type-id='95e97e5e' name='compare_iovcnt' filepath='bdev.c' line='6543' column='1'/>
      <parameter type-id='cc4b1be9' name='write_iov' filepath='bdev.c' line='6544' column='1'/>
      <parameter type-id='95e97e5e' name='write_iovcnt' filepath='bdev.c' line='6544' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6545' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6545' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6546' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6546' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_start' mangled-name='spdk_bdev_zcopy_start' filepath='bdev.c' line='6594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_start' hash='df6a65af7fea02aa'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6594' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6594' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='6595' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='6595' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6596' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6596' column='1'/>
      <parameter type-id='c894953d' name='populate' filepath='bdev.c' line='6597' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6598' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6598' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_end' mangled-name='spdk_bdev_zcopy_end' filepath='bdev.c' line='6643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_end' hash='98ff46a34284ab4f'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='6643' column='1'/>
      <parameter type-id='c894953d' name='commit' filepath='bdev.c' line='6643' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6644' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6644' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes' mangled-name='spdk_bdev_write_zeroes' filepath='bdev.c' line='6662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes_blocks' mangled-name='spdk_bdev_write_zeroes_blocks' filepath='bdev.c' line='6676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap' mangled-name='spdk_bdev_unmap' filepath='bdev.c' line='6731' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap_blocks' mangled-name='spdk_bdev_unmap_blocks' filepath='bdev.c' line='6754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush' mangled-name='spdk_bdev_flush' filepath='bdev.c' line='6801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush_blocks' mangled-name='spdk_bdev_flush_blocks' filepath='bdev.c' line='6815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush_blocks' hash='b6c7236d3a4d41b7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6815' column='1'/>
      <parameter type-id='9c313c2d' name='offset_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='9c313c2d' name='num_blocks' filepath='bdev.c' line='6816' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='6817' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='6817' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_reset' mangled-name='spdk_bdev_reset' filepath='bdev.c' line='6999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_reset' hash='a7f99494147764a8'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='6999' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='6999' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7000' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7000' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_stat' mangled-name='spdk_bdev_get_io_stat' filepath='bdev.c' line='7022' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_stat' hash='1b509807b624a09e'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7022' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7022' column='1'/>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='7023' column='1'/>
      <parameter type-id='c463dc5d' name='reset_mode' filepath='bdev.c' line='7023' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_device_stat' mangled-name='spdk_bdev_get_device_stat' filepath='bdev.c' line='7054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_device_stat' hash='7e08a8ea3bc83a82'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7054' column='1'/>
      <parameter type-id='08cc63f9' name='stat' filepath='bdev.c' line='7054' column='1'/>
      <parameter type-id='c463dc5d' name='reset_mode' filepath='bdev.c' line='7055' column='1'/>
      <parameter type-id='75d8d625' name='cb' filepath='bdev.c' line='7055' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7055' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_admin_passthru' mangled-name='spdk_bdev_nvme_admin_passthru' filepath='bdev.c' line='7145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_admin_passthru' hash='22e3111e11002181'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7182' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7182' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7184' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7184' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru' mangled-name='spdk_bdev_nvme_io_passthru' filepath='bdev.c' line='7182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru' hash='22e3111e11002181'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7182' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7182' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='7183' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7184' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7184' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru_md' mangled-name='spdk_bdev_nvme_io_passthru_md' filepath='bdev.c' line='7224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru_md' hash='d5ae8d17809cc5c8'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7224' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7224' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='7225' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='bdev.c' line='7225' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='7225' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='7225' column='1'/>
      <parameter type-id='b59d7dce' name='md_len' filepath='bdev.c' line='7225' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7226' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7226' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_iov_passthru_md' mangled-name='spdk_bdev_nvme_iov_passthru_md' filepath='bdev.c' line='7266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_iov_passthru_md' hash='b7ceca99ec3b7d70'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7266' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7267' column='1'/>
      <parameter type-id='0cb9fb3c' name='cmd' filepath='bdev.c' line='7268' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='bdev.c' line='7269' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='bdev.c' line='7269' column='1'/>
      <parameter type-id='b59d7dce' name='nbytes' filepath='bdev.c' line='7269' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='bdev.c' line='7270' column='1'/>
      <parameter type-id='b59d7dce' name='md_len' filepath='bdev.c' line='7270' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7271' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7271' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_abort' mangled-name='spdk_bdev_abort' filepath='bdev.c' line='7520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_abort' hash='a7f99494147764a8'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='7520' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7520' column='1'/>
      <parameter type-id='eaa32e2f' name='bio_cb_arg' filepath='bdev.c' line='7521' column='1'/>
      <parameter type-id='a720f07e' name='cb' filepath='bdev.c' line='7522' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='7522' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_queue_io_wait' mangled-name='spdk_bdev_queue_io_wait' filepath='bdev.c' line='7560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_queue_io_wait' hash='335e68bc2b0a98aa'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='7560' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='bdev.c' line='7560' column='1'/>
      <parameter type-id='2c737c29' name='entry' filepath='bdev.c' line='7561' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete' mangled-name='spdk_bdev_io_complete' filepath='bdev.c' line='7843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete' hash='bdc3af75e90fdb71'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7843' column='1'/>
      <parameter type-id='11906e0e' name='status' filepath='bdev.c' line='7843' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_scsi_status' mangled-name='spdk_bdev_io_complete_scsi_status' filepath='bdev.c' line='7886' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_scsi_status' hash='5a31c2b1521d24d4'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7886' column='1'/>
      <parameter type-id='aabad29c' name='sc' filepath='bdev.c' line='7886' column='1'/>
      <parameter type-id='00418730' name='sk' filepath='bdev.c' line='7887' column='1'/>
      <parameter type-id='b96825af' name='asc' filepath='bdev.c' line='7887' column='1'/>
      <parameter type-id='b96825af' name='ascq' filepath='bdev.c' line='7887' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_scsi_status' mangled-name='spdk_bdev_io_get_scsi_status' filepath='bdev.c' line='7905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_scsi_status' hash='3d869c26ce078614'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='7905' column='1'/>
      <parameter type-id='7292109c' name='sc' filepath='bdev.c' line='7906' column='1'/>
      <parameter type-id='7292109c' name='sk' filepath='bdev.c' line='7906' column='1'/>
      <parameter type-id='7292109c' name='asc' filepath='bdev.c' line='7906' column='1'/>
      <parameter type-id='7292109c' name='ascq' filepath='bdev.c' line='7906' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_aio_status' mangled-name='spdk_bdev_io_complete_aio_status' filepath='bdev.c' line='7945' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_aio_status' hash='79b86d596b66375b'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7945' column='1'/>
      <parameter type-id='95e97e5e' name='aio_result' filepath='bdev.c' line='7945' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aio_status' mangled-name='spdk_bdev_io_get_aio_status' filepath='bdev.c' line='7961' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aio_status' hash='8b76511e1e4a2be3'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='7961' column='1'/>
      <parameter type-id='7292109c' name='aio_result' filepath='bdev.c' line='7961' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_nvme_status' mangled-name='spdk_bdev_io_complete_nvme_status' filepath='bdev.c' line='7975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_nvme_status' hash='d341b111d454a15c'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='7975' column='1'/>
      <parameter type-id='8f92235e' name='cdw0' filepath='bdev.c' line='7975' column='1'/>
      <parameter type-id='95e97e5e' name='sct' filepath='bdev.c' line='7975' column='1'/>
      <parameter type-id='95e97e5e' name='sc' filepath='bdev.c' line='7975' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_status' mangled-name='spdk_bdev_io_get_nvme_status' filepath='bdev.c' line='7995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_status' hash='bde0fa85c2b141e6'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='7995' column='1'/>
      <parameter type-id='90421557' name='cdw0' filepath='bdev.c' line='7995' column='1'/>
      <parameter type-id='7292109c' name='sct' filepath='bdev.c' line='7995' column='1'/>
      <parameter type-id='7292109c' name='sc' filepath='bdev.c' line='7995' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_fused_status' mangled-name='spdk_bdev_io_get_nvme_fused_status' filepath='bdev.c' line='8030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_fused_status' hash='e9637136ce6768ac'>
      <parameter type-id='95eae837' name='bdev_io' filepath='bdev.c' line='8030' column='1'/>
      <parameter type-id='90421557' name='cdw0' filepath='bdev.c' line='8030' column='1'/>
      <parameter type-id='7292109c' name='first_sct' filepath='bdev.c' line='8031' column='1'/>
      <parameter type-id='7292109c' name='first_sc' filepath='bdev.c' line='8031' column='1'/>
      <parameter type-id='7292109c' name='second_sct' filepath='bdev.c' line='8031' column='1'/>
      <parameter type-id='7292109c' name='second_sc' filepath='bdev.c' line='8031' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_base_io_status' mangled-name='spdk_bdev_io_complete_base_io_status' filepath='bdev.c' line='8083' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_base_io_status' hash='fcb60de851c676aa'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='8083' column='1'/>
      <parameter type-id='95eae837' name='base_io' filepath='bdev.c' line='8084' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_thread' mangled-name='spdk_bdev_io_get_thread' filepath='bdev.c' line='8110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_thread' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='8110' column='1'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_io_channel' mangled-name='spdk_bdev_io_get_io_channel' filepath='bdev.c' line='8116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_io_channel' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='8116' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_destruct_done' mangled-name='spdk_bdev_destruct_done' filepath='bdev.c' line='8294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_destruct_done' hash='e893d88fed3dc4ab'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8294' column='1'/>
      <parameter type-id='95e97e5e' name='bdeverrno' filepath='bdev.c' line='8294' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister' mangled-name='spdk_bdev_unregister' filepath='bdev.c' line='8395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister' hash='c62bc25666eb5e2b'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='8395' column='1'/>
      <parameter type-id='10afdbb3' name='cb_fn' filepath='bdev.c' line='8395' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='8395' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister_by_name' mangled-name='spdk_bdev_unregister_by_name' filepath='bdev.c' line='8435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister_by_name' hash='9146bb5cfeb48db5'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='8435' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='8435' column='1'/>
      <parameter type-id='10afdbb3' name='cb_fn' filepath='bdev.c' line='8436' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='bdev.c' line='8436' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_opts_init' mangled-name='spdk_bdev_open_opts_init' filepath='bdev.c' line='8622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_opts_init' hash='eb48981139de2fc4'>
      <parameter type-id='d6a52c01' name='opts' filepath='bdev.c' line='8622' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='bdev.c' line='8622' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_ext_v2' mangled-name='spdk_bdev_open_ext_v2' filepath='bdev.c' line='8728' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_ext_v2' hash='81bdbf818af68870'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='8728' column='1'/>
      <parameter type-id='c894953d' name='write' filepath='bdev.c' line='8728' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='bdev.c' line='8728' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='bdev.c' line='8729' column='1'/>
      <parameter type-id='d6a52c01' name='opts' filepath='bdev.c' line='8729' column='1'/>
      <parameter type-id='3ecde4cf' name='_desc' filepath='bdev.c' line='8730' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_ext' mangled-name='spdk_bdev_open_ext' filepath='bdev.c' line='8747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_ext' hash='18449b56872b7237'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='8747' column='1'/>
      <parameter type-id='c894953d' name='write' filepath='bdev.c' line='8747' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='bdev.c' line='8747' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='bdev.c' line='8748' column='1'/>
      <parameter type-id='3ecde4cf' name='_desc' filepath='bdev.c' line='8748' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_async' mangled-name='spdk_bdev_open_async' filepath='bdev.c' line='8905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_async' hash='e95aa33df7ca79c9'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='bdev.c' line='8905' column='1'/>
      <parameter type-id='c894953d' name='write' filepath='bdev.c' line='8905' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='bdev.c' line='8905' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='bdev.c' line='8906' column='1'/>
      <parameter type-id='f85a6e52' name='opts' filepath='bdev.c' line='8906' column='1'/>
      <parameter type-id='832c5abb' name='open_cb' filepath='bdev.c' line='8907' column='1'/>
      <parameter type-id='eaa32e2f' name='open_cb_arg' filepath='bdev.c' line='8907' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_close' mangled-name='spdk_bdev_close' filepath='bdev.c' line='9019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_close' hash='7f32ffea222edbe7'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='9019' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_numa_id' mangled-name='spdk_bdev_get_numa_id' filepath='bdev.c' line='9038' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_numa_id' hash='5de93a74a07e05e2'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='9038' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_bdev_register' mangled-name='spdk_bdev_register' filepath='bdev.c' line='9063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_register' hash='5de93a74a07e05e2'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='9063' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_claim_bdev' mangled-name='spdk_bdev_module_claim_bdev' filepath='bdev.c' line='9107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_claim_bdev' hash='8d9d4837ecb5c594'>
      <parameter type-id='7b7cfb3d' name='bdev' filepath='bdev.c' line='9107' column='1'/>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='9107' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='9108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_release_bdev' mangled-name='spdk_bdev_module_release_bdev' filepath='bdev.c' line='9130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_release_bdev' hash='c16b89a4bec5a5cf'>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_claim_get_name' mangled-name='spdk_bdev_claim_get_name' filepath='bdev.c' line='9147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_claim_get_name' hash='b1a043a6f21e50eb'>
      <parameter type-id='e323b446' name='type' filepath='bdev.c' line='9147' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_claim_opts_init' mangled-name='spdk_bdev_claim_opts_init' filepath='bdev.c' line='9195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_claim_opts_init' hash='785e52d5d7108337'>
      <parameter type-id='d1fbfd3d' name='opts' filepath='bdev.c' line='9195' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='bdev.c' line='9195' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_claim_bdev_desc' mangled-name='spdk_bdev_module_claim_bdev_desc' filepath='bdev.c' line='9416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_claim_bdev_desc' hash='653bcbfbbbd3a554'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='9416' column='1'/>
      <parameter type-id='e323b446' name='type' filepath='bdev.c' line='9416' column='1'/>
      <parameter type-id='d1fbfd3d' name='_opts' filepath='bdev.c' line='9417' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='bdev.c' line='9418' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_bdev' mangled-name='spdk_bdev_desc_get_bdev' filepath='bdev.c' line='9517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_bdev' hash='c16b89a4bec5a5cf'>
      <parameter type-id='0094857f' name='desc' filepath='bdev.c' line='9517' column='1'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev' mangled-name='spdk_for_each_bdev' filepath='bdev.c' line='9524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev' hash='a7f99494147764a8'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='bdev.c' line='9568' column='1'/>
      <parameter type-id='8e1b2c43' name='fn' filepath='bdev.c' line='9568' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev_leaf' mangled-name='spdk_for_each_bdev_leaf' filepath='bdev.c' line='9568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev_leaf' hash='a7f99494147764a8'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='bdev.c' line='9568' column='1'/>
      <parameter type-id='8e1b2c43' name='fn' filepath='bdev.c' line='9568' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_iovec' mangled-name='spdk_bdev_io_get_iovec' filepath='bdev.c' line='9612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_iovec' hash='e03c010dc9f80add'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='9612' column='1'/>
      <parameter type-id='5d3cb3f9' name='iovp' filepath='bdev.c' line='9612' column='1'/>
      <parameter type-id='7292109c' name='iovcntp' filepath='bdev.c' line='9612' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_md_buf' mangled-name='spdk_bdev_io_get_md_buf' filepath='bdev.c' line='9643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_md_buf' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='9662' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_cb_arg' mangled-name='spdk_bdev_io_get_cb_arg' filepath='bdev.c' line='9662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_cb_arg' hash='ce2296d4d180791a'>
      <parameter type-id='378e9c1c' name='bdev_io' filepath='bdev.c' line='9662' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_list_add' mangled-name='spdk_bdev_module_list_add' filepath='bdev.c' line='9673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_list_add' hash='70200b8165a41b20'>
      <parameter type-id='b509a840' name='bdev_module' filepath='bdev.c' line='9673' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
