<abi-corpus version='2.4' soname='libspdk_reduce.so.7.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_reduce_vol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_params' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_pm_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_uuid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_print_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_readv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_unmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__errno_location' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memcpy' version='GLIBC_2.14' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_find_first_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bit_array_set' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_deprecated' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_deprecation_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_is_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pmem_map_file' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pmem_msync' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pmem_persist' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pmem_unmap' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='reduce.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='unknown' hash='6915b710ae33e54a' id='e84913bd'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <enum-decl name='spdk_reduce_backing_io_type' size-in-bits='32' alignment-in-bits='32' filepath='reduce.h' line='112' column='1' hash='a4d12e6647be47bc' id='b9dee981'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_REDUCE_BACKING_IO_WRITE' value='0'/>
      <enumerator name='SPDK_REDUCE_BACKING_IO_READ' value='1'/>
      <enumerator name='SPDK_REDUCE_BACKING_IO_UNMAP' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_backing_dev' is-struct='yes' visibility='default' size-in-bits='384' filepath='reduce.h' line='129' column='1' hash='60caea01b702be10' id='cac77be0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='submit_backing_io' type-id='9670eb8f' visibility='default' filepath='reduce.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='compress' type-id='6325283f' visibility='default' filepath='reduce.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decompress' type-id='6325283f' visibility='default' filepath='reduce.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='reduce.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='sgl_in' type-id='c894953d' visibility='default' filepath='reduce.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='sgl_out' type-id='c894953d' visibility='default' filepath='reduce.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='user_ctx_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_backing_io' is-struct='yes' visibility='default' size-in-bits='448' filepath='reduce.h' line='118' column='1' hash='1da4f44bfa04dc2a' id='8610973d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dev' type-id='5822c6f6' visibility='default' filepath='reduce.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default' filepath='reduce.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='reduce.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lba' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lba_count' type-id='8f92235e' visibility='default' filepath='reduce.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='backing_cb_args' type-id='a41aa92e' visibility='default' filepath='reduce.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='backing_io_type' type-id='b9dee981' visibility='default' filepath='reduce.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='user_ctx' type-id='e84913bd' visibility='default' filepath='reduce.h' line='126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_cb_args' is-struct='yes' visibility='default' size-in-bits='192' filepath='reduce.h' line='106' column='1' hash='c3585e7bcd15bf18' id='e8c5eb18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='output_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='f73e6af3' visibility='default' filepath='reduce.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='reduce.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_info' is-struct='yes' visibility='default' size-in-bits='64' filepath='reduce.h' line='25' column='1' hash='5c5b5d8fe18c3232' id='583cfcf9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allocated_io_units' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_params' is-struct='yes' visibility='default' size-in-bits='384' filepath='reduce.h' line='34' column='1' hash='39ec4c242a616fd8' id='0b287997'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='reduce.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backing_io_unit_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='logical_block_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='chunk_size' type-id='8f92235e' visibility='default' filepath='reduce.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vol_size' type-id='9c313c2d' visibility='default' filepath='reduce.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='comp_level' type-id='8f92235e' visibility='default' filepath='reduce.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='comp_algo' type-id='b96825af' visibility='default' filepath='reduce.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='reduce.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' is-struct='yes' visibility='default' size-in-bits='128' filepath='uuid.h' line='21' column='1' hash='ad18e2956698a415' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_reduce_dev_cpl' type-id='82328a76' size-in-bits='64' filepath='reduce.h' line='104' column='1' hash='fd7a63c0c6c822c4' id='f73e6af3'/>
    <typedef-decl name='spdk_reduce_vol_op_complete' type-id='82328a76' size-in-bits='64' filepath='reduce.h' line='87' column='1' hash='fd7a63c0c6c822c4' id='3d61569b'/>
    <typedef-decl name='spdk_reduce_vol_op_with_handle_complete' type-id='3e31bdb9' size-in-bits='64' filepath='reduce.h' line='88' column='1' hash='fd7a63c0c6c822c4' id='3eca1faf'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='uuid.h' line='22' column='1' hash='83563518080289b9' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='583cfcf9' const='yes' hash='0d5794caa15c2bb5' id='b0ddd918'/>
    <pointer-type-def type-id='b0ddd918' size-in-bits='64' hash='4f80a61a205837fe' id='9f3ce9b6'/>
    <qualified-type-def type-id='0b287997' const='yes' hash='7446d91d8a1e5be4' id='67adba22'/>
    <pointer-type-def type-id='67adba22' size-in-bits='64' hash='8c0fec2b78a6ac51' id='3e7bda98'/>
    <qualified-type-def type-id='429c70d3' const='yes' hash='7e397e1f3d0802a3' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' hash='8dd43daba5434137' id='c2482856'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='cac77be0' size-in-bits='64' hash='b1d3fb81792bd21b' id='5822c6f6'/>
    <pointer-type-def type-id='8610973d' size-in-bits='64' hash='3f5d3b627d85de36' id='3bcb393d'/>
    <pointer-type-def type-id='e8c5eb18' size-in-bits='64' hash='a1610a8259632aa3' id='a41aa92e'/>
    <pointer-type-def type-id='0b287997' size-in-bits='64' hash='4da7e69c9a4129ba' id='e453fa8f'/>
    <pointer-type-def type-id='df337ec4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='6325283f'/>
    <pointer-type-def type-id='0d909b0a' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9670eb8f'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <pointer-type-def type-id='cb78485e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='3e31bdb9'/>
    <qualified-type-def type-id='cc95dfe4' const='yes' id='746da1f3'/>
    <pointer-type-def type-id='746da1f3' size-in-bits='64' id='2195c89b'/>
    <pointer-type-def type-id='cc95dfe4' size-in-bits='64' id='28881962'/>
    <class-decl name='spdk_reduce_vol' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='reduce.c' line='121' column='1' id='cc95dfe4'/>
    <function-decl name='spdk_reduce_vol_get_uuid' mangled-name='spdk_reduce_vol_get_uuid' filepath='reduce.c' line='292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_uuid' hash='fdfd7cbec252e66f'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='292' column='1'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_get_info' mangled-name='spdk_reduce_vol_get_info' filepath='reduce.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_info' hash='349e9aa3d37d28c5'>
      <parameter type-id='2195c89b' name='vol' filepath='reduce.c' line='466' column='1'/>
      <return type-id='9f3ce9b6'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_init' mangled-name='spdk_reduce_vol_init' filepath='reduce.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_init' hash='5d32ac559d80d0fd'>
      <parameter type-id='e453fa8f' name='params' filepath='reduce.c' line='622' column='1'/>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='623' column='1'/>
      <parameter type-id='80f4b756' name='pm_file_dir' filepath='reduce.c' line='624' column='1'/>
      <parameter type-id='3eca1faf' name='cb_fn' filepath='reduce.c' line='625' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='625' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_load' mangled-name='spdk_reduce_vol_load' filepath='reduce.c' line='911' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_load' hash='9afd4ab1b559ea7f'>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='911' column='1'/>
      <parameter type-id='3eca1faf' name='cb_fn' filepath='reduce.c' line='912' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='912' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_unload' mangled-name='spdk_reduce_vol_unload' filepath='reduce.c' line='995' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_unload' hash='5695f5ce05a4c55f'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='995' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='996' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='996' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_destroy' mangled-name='spdk_reduce_vol_destroy' filepath='reduce.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_destroy' hash='9afd4ab1b559ea7f'>
      <parameter type-id='5822c6f6' name='backing_dev' filepath='reduce.c' line='1089' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='1090' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='1090' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_readv' mangled-name='spdk_reduce_vol_readv' filepath='reduce.c' line='1837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_readv' hash='37abcf86bd955c52'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1927' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='1929' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='1929' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_writev' mangled-name='spdk_reduce_vol_writev' filepath='reduce.c' line='1927' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_writev' hash='37abcf86bd955c52'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='1927' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='reduce.c' line='1928' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='1929' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='1929' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_unmap' mangled-name='spdk_reduce_vol_unmap' filepath='reduce.c' line='2087' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_unmap' hash='3aa907ea60dd12ba'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='2087' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='reduce.c' line='2088' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='reduce.c' line='2088' column='1'/>
      <parameter type-id='3d61569b' name='cb_fn' filepath='reduce.c' line='2089' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='reduce.c' line='2089' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_get_params' mangled-name='spdk_reduce_vol_get_params' filepath='reduce.c' line='2101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_params' hash='1d5119336cddd06c'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='2101' column='1'/>
      <return type-id='3e7bda98'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_get_pm_path' mangled-name='spdk_reduce_vol_get_pm_path' filepath='reduce.c' line='2107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_pm_path' hash='53885bde0aa65efe'>
      <parameter type-id='2195c89b' name='vol' filepath='reduce.c' line='2107' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_print_info' mangled-name='spdk_reduce_vol_print_info' filepath='reduce.c' line='2113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_print_info' hash='7f32ffea222edbe7'>
      <parameter type-id='28881962' name='vol' filepath='reduce.c' line='2113' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='95fa2ea564c5c230' id='df337ec4'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='bf40b57a09cd6cee' id='0d909b0a'>
      <parameter type-id='3bcb393d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='cb78485e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='28881962'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
