<abi-corpus version='2.4' soname='libspdk_vfu_tgt.so.3.0'>
  <elf-needed>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.7.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vfu_create_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_delete_endpoint' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_get_pci_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_intx_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_endpoint_msix_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfu_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_exit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_addr_to_sgl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_attach_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_create_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_destroy_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_get_private' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_pci_add_capability' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_pci_get_config_space' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_pci_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_pci_set_class' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_pci_set_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_realize_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_run_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_device_dma' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_device_nr_irqs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_device_quiesce_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_device_reset_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_setup_region' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_sgl_get' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vfu_sgl_put' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_first_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_next_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='tgt_endpoint.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' hash='ea93b43678875247' id='59daf3ef'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='b10be967'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <array-type-def dimensions='1' type-id='99021309' size-in-bits='13440' hash='21722acecaea2564' id='734814fe'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ea28250a' size-in-bits='1024' hash='c91dd3a898d6c3e5' id='24a581cc'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_endpoint_ops' is-struct='yes' visibility='default' size-in-bits='1152' filepath='vfu_target.h' line='169' column='1' hash='8d1768d54bbb47b5' id='b2332df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='vfu_target.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='init' type-id='13cb8434' visibility='default' filepath='vfu_target.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='get_device_info' type-id='4e809fb6' visibility='default' filepath='vfu_target.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_vendor_capability' type-id='69b64ab1' visibility='default' filepath='vfu_target.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='attach_device' type-id='188023c4' visibility='default' filepath='vfu_target.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='detach_device' type-id='188023c4' visibility='default' filepath='vfu_target.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destruct' type-id='188023c4' visibility='default' filepath='vfu_target.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='post_memory_add' type-id='dd331f08' visibility='default' filepath='vfu_target.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pre_memory_remove' type-id='dd331f08' visibility='default' filepath='vfu_target.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='reset_device' type-id='188023c4' visibility='default' filepath='vfu_target.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='quiesce_device' type-id='188023c4' visibility='default' filepath='vfu_target.h' line='227' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_device' is-struct='yes' visibility='default' size-in-bits='14272' filepath='vfu_target.h' line='128' column='1' hash='fa8a05011359b94b' id='1f9584df'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='e7f43f72' visibility='default' filepath='vfu_target.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='class' type-id='e7f43f73' visibility='default' filepath='vfu_target.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='pmcap' type-id='f74f6b06' visibility='default' filepath='vfu_target.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='pxcap' type-id='db1684d3' visibility='default' filepath='vfu_target.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msixcap' type-id='34cef360' visibility='default' filepath='vfu_target.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='nr_vendor_caps' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='intr_ipin' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nr_int_irqs' type-id='8f92235e' visibility='default' filepath='vfu_target.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nr_msix_irqs' type-id='8f92235e' visibility='default' filepath='vfu_target.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='regions' type-id='734814fe' visibility='default' filepath='vfu_target.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_pci_region' is-struct='yes' visibility='default' size-in-bits='1344' filepath='vfu_target.h' line='85' column='1' hash='8ed160bcda074332' id='99021309'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='vfu_target.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default' filepath='vfu_target.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default' filepath='vfu_target.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_sparse_mmaps' type-id='8f92235e' visibility='default' filepath='vfu_target.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='vfu_target.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmaps' type-id='24a581cc' visibility='default' filepath='vfu_target.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='access_cb' type-id='82c8d56f' visibility='default' filepath='vfu_target.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vfu_sparse_mmap' is-struct='yes' visibility='default' size-in-bits='128' filepath='vfu_target.h' line='52' column='1' hash='86c378a428de8ecd' id='ea28250a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='vfu_target.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='9c313c2d' visibility='default' filepath='vfu_target.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='vfu_target.h' line='129' column='1' hash='06c1865104100dfa' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='did' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssid' type-id='149c6638' visibility='default' filepath='vfu_target.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='24' is-anonymous='yes' filepath='vfu_target.h' line='140' column='1' hash='f308d30bbfd91bd4#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bcc' type-id='b96825af' visibility='default' filepath='vfu_target.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='scc' type-id='b96825af' visibility='default' filepath='vfu_target.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pi' type-id='b96825af' visibility='default' filepath='vfu_target.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__loff_t' type-id='724e4de6' size-in-bits='64' filepath='types.h' line='203' column='1' hash='b119fe0931d2ee10' id='00c9d214'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='194' column='1' hash='b119fe0931d2ee10' id='41060289'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='loff_t' type-id='00c9d214' size-in-bits='64' filepath='types.h' line='42' column='1' hash='b119fe0931d2ee10' id='69bf7bee'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_vfu_access_cb' type-id='950a5802' size-in-bits='64' filepath='vfu_target.h' line='77' column='1' hash='fd7a63c0c6c822c4' id='82c8d56f'/>
    <typedef-decl name='spdk_vfu_fini_cb' type-id='c640490b' size-in-bits='64' filepath='vfu_target.h' line='27' column='1' hash='fd7a63c0c6c822c4' id='2c76d06d'/>
    <typedef-decl name='spdk_vfu_init_cb' type-id='67912dc2' size-in-bits='64' filepath='vfu_target.h' line='21' column='1' hash='fd7a63c0c6c822c4' id='c88628db'/>
    <typedef-decl name='ssize_t' type-id='41060289' size-in-bits='64' filepath='stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='4281545d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='188023c4'/>
    <pointer-type-def type-id='049ca64f' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4e809fb6'/>
    <pointer-type-def type-id='2174dd7d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='dd331f08'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='b2332df6' size-in-bits='64' hash='3c5e59100d15ed07' id='2fd9908c'/>
