<abi-corpus version='2.4' soname='libspdk_idxd.so.12.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_idxd_detach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_probe' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_process_events' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_put_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_set_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='usleep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_cdev_major' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_first' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_max_batch_size' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_max_transfer_size' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_next' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_numa_node' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_pasid_enabled' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_state' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_device_get_version' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_new' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_ref' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_unref' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_cdev_minor' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_first' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_max_batch_size' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_mode' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_next' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_size' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_state' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='accfg_wq_get_type' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_iommu_is_enabled' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_write32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_claim' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_detach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_addr' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_device_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_vendor_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_enumerate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_idxd_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='idxd.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='776' column='1' hash='38fc92e059e2dd5b' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='idxd_hw_desc' is-struct='yes' visibility='default' size-in-bits='512' filepath='idxd_spec.h' line='212' column='1' hash='2d736066dddaeae6' id='7f046df4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pasid' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='priv' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='opcode' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='completion_addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='int_handle' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx' is-struct='yes' visibility='default' size-in-bits='512' filepath='dif.h' line='65' column='1' hash='3fa86a99bcca3589' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' is-struct='yes' visibility='default' size-in-bits='960' filepath='env.h' line='756' column='1' hash='f69b0a5b42882896' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='1b5ad344' visibility='default' filepath='env.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='50305372' visibility='default' filepath='env.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='e25894ac' visibility='default' filepath='env.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='e25894ac' visibility='default' filepath='env.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='741' column='1' hash='12edc1ed2493e379' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='788' column='1' hash='75df1d70e5e3877c' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='idxd_spec.h' line='258' column='1' hash='a669302b53358961#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='261' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='idxd_spec.h' line='252' column='1' hash='32e374077a404292#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='idxd_spec.h' line='244' column='1' hash='01276d385c3e555b#4' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src2_addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_dst_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src2_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filter_flags' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_inputs' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='249' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='idxd_spec.h' line='272' column='1' hash='786496a8cf107a65#5' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flag' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='b6925fd4' visibility='default' filepath='idxd_spec.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='idxd_spec.h' line='302' column='1' hash='27eca0064d81fd37#6' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='b6925fd4' visibility='default' filepath='idxd_spec.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='309' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='idxd_spec.h' line='281' column='1' hash='0c0b52766e811bc3#7' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd' type-id='0f4ddd0b' visibility='default' filepath='idxd_spec.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src_app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='src_app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dest_ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dest_app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='dest_app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='291' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='idxd_spec.h' line='263' column='1' hash='b1aa2d1460d5c243#8' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='0f4ddd0b' visibility='default' filepath='idxd_spec.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eed' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_idxd_attach_cb' type-id='a507555e' size-in-bits='64' filepath='idxd.h' line='73' column='1' hash='fd7a63c0c6c822c4' id='6bdef912'/>
    <typedef-decl name='spdk_idxd_probe_cb' type-id='9292f889' size-in-bits='64' filepath='idxd.h' line='82' column='1' hash='fd7a63c0c6c822c4' id='ba2310ed'/>
    <typedef-decl name='spdk_idxd_req_cb' type-id='82328a76' size-in-bits='64' filepath='idxd.h' line='64' column='1' hash='fd7a63c0c6c822c4' id='576652af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='104' hash='744ca87f5ba139f3' id='b6925fd4'>
      <subrange length='13' lower-bound='0' upper-bound='12' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='45abccd665b94913' id='487fded1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' hash='37cfa4b2655e8904' id='014804d6'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' hash='87dcd7386226cc55' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='env.h' line='761' column='1' hash='dc65722026032fd3' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='numa_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='762' column='1'/>
      </data-member>
      <data-member access='public'>
