<abi-corpus version='2.4' soname='libspdk_init.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_json.so.6.1'/>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_rpc.so.7.0'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_add_subsystem' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_add_subsystem_depend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_initialize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_server_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_server_pause' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_server_resume' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_poller_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_get_method_state_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_get_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_register_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_server_accept' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_server_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_server_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_set_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_verify_methods' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_is_app_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_fmt' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_addr' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_type' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_for_each_device' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='json_config.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='194' column='1' hash='b119fe0931d2ee10' id='41060289'/>
    <typedef-decl name='spdk_subsystem_init_fn' type-id='4382769c' size-in-bits='64' filepath='init.h' line='70' column='1' hash='fd7a63c0c6c822c4' id='522497da'/>
    <typedef-decl name='ssize_t' type-id='41060289' size-in-bits='64' filepath='stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='79a0948f'/>
    <pointer-type-def type-id='7b5ced03' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4382769c'/>
    <function-decl name='spdk_subsystem_load_config' mangled-name='spdk_subsystem_load_config' filepath='json_config.c' line='649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_load_config' hash='525f34ba3cdf970d'>
      <parameter type-id='eaa32e2f' name='json' filepath='json_config.c' line='649' column='1'/>
      <parameter type-id='79a0948f' name='json_size' filepath='json_config.c' line='649' column='1'/>
      <parameter type-id='522497da' name='cb_fn' filepath='json_config.c' line='649' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='json_config.c' line='650' column='1'/>
      <parameter type-id='c894953d' name='stop_on_error' filepath='json_config.c' line='650' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='7b5ced03'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rpc.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' size-in-bits='32' alignment-in-bits='32' filepath='log.h' line='90' column='1' hash='f54503d906878e62' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_rpc_opts' is-struct='yes' visibility='default' size-in-bits='192' filepath='init.h' line='28' column='1' hash='fcae86e74f800296' id='9f4e83f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='init.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='log_file' type-id='822cd80b' visibility='default' filepath='init.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='log_level' type-id='4271cbce' visibility='default' filepath='init.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#2' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='9f4e83f2' const='yes' hash='4b192778ea13fcd7' id='e36863d9'/>
    <pointer-type-def type-id='e36863d9' size-in-bits='64' hash='1002a08dd7b62eb7' id='f0555789'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_rpc_initialize' mangled-name='spdk_rpc_initialize' filepath='rpc.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_initialize' hash='36d43e5093fe1806'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='130' column='1'/>
      <parameter type-id='f0555789' name='opts' filepath='rpc.c' line='130' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_rpc_server_finish' mangled-name='spdk_rpc_server_finish' filepath='rpc.c' line='184' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_server_finish' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='234' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_rpc_finish' mangled-name='spdk_rpc_finish' filepath='rpc.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_finish' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_rpc_server_pause' mangled-name='spdk_rpc_server_pause' filepath='rpc.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_server_pause' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='234' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_rpc_server_resume' mangled-name='spdk_rpc_server_resume' filepath='rpc.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_server_resume' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='234' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='30a82da4'>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='subsystem.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <class-decl name='spdk_subsystem' is-struct='yes' visibility='default' size-in-bits='384' filepath='init.h' line='13' column='1' hash='9527711888a9c724' id='9fe5652b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='c640490b' visibility='default' filepath='init.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini' type-id='c640490b' visibility='default' filepath='init.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_config_json' type-id='46bc0678' visibility='default' filepath='init.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_subsystem_depend' is-struct='yes' visibility='default' size-in-bits='256' filepath='init.h' line='28' column='1' hash='8a1ce2562f41ca92' id='086abaea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depends_on' type-id='80f4b756' visibility='default' filepath='init.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='init.h' line='25' column='1' hash='d8c1319063105c4d' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f7a7c12b' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='de14d493' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='init.h' line='31' column='1' hash='2d2310e060d56b5f#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='51dccc68' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='20958be6' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_msg_fn' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='87' column='1' hash='fd7a63c0c6c822c4' id='de128c99'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='9fe5652b' size-in-bits='64' hash='d620943ea96aafd5' id='f7a7c12b'/>
    <pointer-type-def type-id='f7a7c12b' size-in-bits='64' hash='7fcd9e4a476773bd' id='de14d493'/>
    <pointer-type-def type-id='086abaea' size-in-bits='64' hash='03f14765abbb5b71' id='51dccc68'/>
    <pointer-type-def type-id='51dccc68' size-in-bits='64' hash='8d4348276940259b' id='20958be6'/>
    <pointer-type-def type-id='9ed8cfeb' size-in-bits='64' hash='fd7a63c0c6c822c4' id='46bc0678'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c640490b'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='61359e15'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_add_subsystem' mangled-name='spdk_add_subsystem' filepath='subsystem.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem' hash='45dea2534d7a4d16'>
      <parameter type-id='f7a7c12b' name='subsystem' filepath='subsystem.c' line='35' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_add_subsystem_depend' mangled-name='spdk_add_subsystem_depend' filepath='subsystem.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem_depend' hash='9d1165701b77b6bc'>
      <parameter type-id='51dccc68' name='depend' filepath='subsystem.c' line='41' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_exists' mangled-name='spdk_subsystem_exists' filepath='subsystem.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_exists' hash='19a1d02fa5635f5c'>
      <parameter type-id='80f4b756' name='name' filepath='subsystem.c' line='67' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init_next' mangled-name='spdk_subsystem_init_next' filepath='subsystem.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init_next' hash='388da3fa973fde78'>
      <parameter type-id='95e97e5e' name='rc' filepath='subsystem.c' line='144' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init' mangled-name='spdk_subsystem_init' filepath='subsystem.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init' hash='5695f5ce05a4c55f'>
      <parameter type-id='522497da' name='cb_fn' filepath='subsystem.c' line='179' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='subsystem.c' line='179' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_fini_next' mangled-name='spdk_subsystem_fini_next' filepath='subsystem.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_fini_next' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
