<abi-corpus version='2.4' soname='libspdk_env_dpdk.so.15.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_call_unaffinitized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_delay_us' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rte_mem_virt2memseg' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_avail_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_list_dump' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_lookup' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_mem_iter' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_obj_iter' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_mempool_ops_table' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memseg_contig_walk' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memseg_get_fd_offset_thread_unsafe' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memseg_get_fd_thread_unsafe' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memzone_dump' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memzone_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memzone_lookup' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_memzone_reserve_aligned' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_pci_read_config' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_pci_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_pci_write_config' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_realloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_ring_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_ring_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_socket_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_socket_id_by_idx' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_sys_gettid' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_thread_get_affinity' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_thread_set_affinity' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_version' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vfio_is_enabled' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_vfio_noiommu_is_enabled' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rte_zmalloc_socket' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='env.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_ring_type' size-in-bits='32' alignment-in-bits='32' filepath='env.h' line='654' column='1' hash='ad7aeb3f1d58f023' id='3bd6ac02'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_RING_TYPE_SP_SC' value='0'/>
      <enumerator name='SPDK_RING_TYPE_MP_SC' value='1'/>
      <enumerator name='SPDK_RING_TYPE_MP_MC' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='rte_trace_point_t' type-id='9c313c2d' size-in-bits='64' filepath='rte_trace_point.h' line='36' column='1' hash='8fdc5eea2983a729' id='d2dae1c9'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_mempool_mem_cb_t' type-id='9208d9db' size-in-bits='64' filepath='env.h' line='341' column='1' id='e8857a9b'/>
    <typedef-decl name='spdk_mempool_obj_cb_t' type-id='84941752' size-in-bits='64' filepath='env.h' line='333' column='1' id='69ad4ac3'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' hash='54c1e9f81ec7a1db' id='78c01427'/>
    <pointer-type-def type-id='e8857a9b' size-in-bits='64' hash='bb8d22801f43c3b1' id='7436b056'/>
    <pointer-type-def type-id='69ad4ac3' size-in-bits='64' hash='306a9f4867379bb2' id='e7553942'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='e69c1394' size-in-bits='64' hash='fd7a63c0c6c822c4' id='084eae43'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='75964865'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <qualified-type-def type-id='ae574a67' const='yes' id='a94dd646'/>
    <pointer-type-def type-id='a94dd646' size-in-bits='64' id='f1888c04'/>
    <pointer-type-def type-id='ae574a67' size-in-bits='64' id='564ba9df'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_mempool' is-struct='yes' visibility='default' is-declaration-only='yes' id='ae574a67'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <class-decl name='rte_mempool_ops_table' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='rte_mempool.h' line='730' column='1' id='a5b1e76e'/>
    <var-decl name='rte_mempool_ops_table' type-id='a5b1e76e' visibility='default' filepath='rte_mempool.h' line='740' column='1' elf-symbol-id='rte_mempool_ops_table'/>
    <var-decl name='__rte_mempool_trace_ops_dequeue_bulk' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='20' column='1' elf-symbol-id='__rte_mempool_trace_ops_dequeue_bulk'/>
    <var-decl name='__rte_mempool_trace_ops_enqueue_bulk' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='38' column='1' elf-symbol-id='__rte_mempool_trace_ops_enqueue_bulk'/>
    <var-decl name='__rte_mempool_trace_generic_put' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='47' column='1' elf-symbol-id='__rte_mempool_trace_generic_put'/>
    <var-decl name='__rte_mempool_trace_put_bulk' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='57' column='1' elf-symbol-id='__rte_mempool_trace_put_bulk'/>
    <var-decl name='__rte_mempool_trace_generic_get' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='67' column='1' elf-symbol-id='__rte_mempool_trace_generic_get'/>
    <var-decl name='__rte_mempool_trace_get_bulk' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='77' column='1' elf-symbol-id='__rte_mempool_trace_get_bulk'/>
    <var-decl name='__rte_mempool_trace_default_cache' type-id='d2dae1c9' visibility='default' filepath='rte_mempool_trace_fp.h' line='96' column='1' elf-symbol-id='__rte_mempool_trace_default_cache'/>
    <function-decl name='spdk_ring_count' mangled-name='spdk_ring_count' filepath='env.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_count' hash='e0055d99adb0e173'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='430' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_enqueue' mangled-name='spdk_ring_enqueue' filepath='env.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_enqueue' hash='932955ae6341797c'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='436' column='1'/>
      <parameter type-id='63e171df' name='objs' filepath='env.c' line='436' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='436' column='1'/>
      <parameter type-id='78c01427' name='free_space' filepath='env.c' line='437' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_dequeue' mangled-name='spdk_ring_dequeue' filepath='env.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_dequeue' hash='c8aae079d9a520d4'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='444' column='1'/>
      <parameter type-id='63e171df' name='objs' filepath='env.c' line='444' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='444' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_dump_mem_stats' mangled-name='spdk_env_dpdk_dump_mem_stats' filepath='env.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_dump_mem_stats' hash='2c833d407d937488'>
      <parameter type-id='822cd80b' name='file' filepath='env.c' line='450' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_get_tid' mangled-name='spdk_get_tid' filepath='env.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_tid' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <var-decl name='rte_delay_us' type-id='084eae43' visibility='default' filepath='rte_cycles.h' line='138' column='1' elf-symbol-id='rte_delay_us'/>
    <var-decl name='per_lcore__lcore_id' type-id='f0981eed' visibility='default' filepath='rte_lcore.h' line='28' column='1' elf-symbol-id='per_lcore__lcore_id'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <var-decl name='per_lcore_trace_mem' type-id='eaa32e2f' visibility='default' filepath='rte_trace_point.h' line='309' column='1' elf-symbol-id='per_lcore_trace_mem'/>
    <function-decl name='spdk_malloc' mangled-name='spdk_malloc' filepath='env.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_malloc' hash='13db229b4ed2c1b1'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='46' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='46' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='46' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='46' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='env.c' line='46' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_zmalloc' mangled-name='spdk_zmalloc' filepath='env.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zmalloc' hash='13db229b4ed2c1b1'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='46' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='46' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='46' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='46' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='env.c' line='46' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_realloc' mangled-name='spdk_realloc' filepath='env.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_realloc' hash='91495cdf6321a116'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='63' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='63' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='63' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_free' mangled-name='spdk_free' filepath='env.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_free' hash='7f32ffea222edbe7'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='110' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc_socket' mangled-name='spdk_dma_malloc_socket' filepath='env.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc_socket' hash='232d80f02c57af59'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='82' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='82' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='82' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='82' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc_socket' mangled-name='spdk_dma_zmalloc_socket' filepath='env.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc_socket' hash='232d80f02c57af59'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='82' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='82' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='82' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='82' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc' mangled-name='spdk_dma_malloc' filepath='env.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc' hash='2d5f7844196f3045'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='94' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='94' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='94' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc' mangled-name='spdk_dma_zmalloc' filepath='env.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc' hash='2d5f7844196f3045'>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='94' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='94' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='94' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_realloc' mangled-name='spdk_dma_realloc' filepath='env.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_realloc' hash='2d5f7844196f3045'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='100' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='env.c' line='100' column='1'/>
      <parameter type-id='b59d7dce' name='align' filepath='env.c' line='100' column='1'/>
      <parameter type-id='5d6479ae' name='unused' filepath='env.c' line='100' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_free' mangled-name='spdk_dma_free' filepath='env.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_free' hash='7f32ffea222edbe7'>
      <parameter type-id='eaa32e2f' name='buf' filepath='env.c' line='110' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve_aligned' mangled-name='spdk_memzone_reserve_aligned' filepath='env.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve_aligned' hash='047d886748e3fb6e'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='116' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='env.c' line='116' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='116' column='1'/>
      <parameter type-id='f0981eed' name='flags' filepath='env.c' line='117' column='1'/>
      <parameter type-id='f0981eed' name='align' filepath='env.c' line='117' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve' mangled-name='spdk_memzone_reserve' filepath='env.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve' hash='51a9ffdba41dd160'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='144' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='env.c' line='144' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='144' column='1'/>
      <parameter type-id='f0981eed' name='flags' filepath='env.c' line='144' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_lookup' mangled-name='spdk_memzone_lookup' filepath='env.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_lookup' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='151' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_free' mangled-name='spdk_memzone_free' filepath='env.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_free' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='163' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memzone_dump' mangled-name='spdk_memzone_dump' filepath='env.c' line='175' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_dump' hash='2c833d407d937488'>
      <parameter type-id='822cd80b' name='file' filepath='env.c' line='450' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_create_ctor' mangled-name='spdk_mempool_create_ctor' filepath='env.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create_ctor' hash='fe9008830256d448'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='181' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='181' column='1'/>
      <parameter type-id='b59d7dce' name='ele_size' filepath='env.c' line='182' column='1'/>
      <parameter type-id='b59d7dce' name='cache_size' filepath='env.c' line='182' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='182' column='1'/>
      <parameter type-id='e7553942' name='obj_init' filepath='env.c' line='183' column='1'/>
      <parameter type-id='eaa32e2f' name='obj_init_arg' filepath='env.c' line='183' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_create' mangled-name='spdk_mempool_create' filepath='env.c' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create' hash='74d8397fbb0a0b6b'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='216' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='216' column='1'/>
      <parameter type-id='b59d7dce' name='ele_size' filepath='env.c' line='217' column='1'/>
      <parameter type-id='b59d7dce' name='cache_size' filepath='env.c' line='217' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='217' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_name' mangled-name='spdk_mempool_get_name' filepath='env.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_name' hash='02a096d257a5e00d'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='224' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_mempool_free' mangled-name='spdk_mempool_free' filepath='env.c' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_free' hash='7f32ffea222edbe7'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='230' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get' mangled-name='spdk_mempool_get' filepath='env.c' line='236' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get' hash='7f32ffea222edbe7'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='236' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_bulk' mangled-name='spdk_mempool_get_bulk' filepath='env.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_bulk' hash='e1926d12eb3b6833'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='249' column='1'/>
      <parameter type-id='63e171df' name='ele_arr' filepath='env.c' line='249' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='249' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mempool_put' mangled-name='spdk_mempool_put' filepath='env.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put' hash='7f32ffea222edbe7'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='255' column='1'/>
      <parameter type-id='eaa32e2f' name='ele' filepath='env.c' line='255' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_put_bulk' mangled-name='spdk_mempool_put_bulk' filepath='env.c' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put_bulk' hash='0e0511caecb9cf73'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='261' column='1'/>
      <parameter type-id='63e171df' name='ele_arr' filepath='env.c' line='261' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='261' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_count' mangled-name='spdk_mempool_count' filepath='env.c' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_count' hash='e0055d99adb0e173'>
      <parameter type-id='f1888c04' name='pool' filepath='env.c' line='267' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_mempool_obj_iter' mangled-name='spdk_mempool_obj_iter' filepath='env.c' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_obj_iter' hash='8fd491db9fa1eebc'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='273' column='1'/>
      <parameter type-id='e7553942' name='obj_cb' filepath='env.c' line='273' column='1'/>
      <parameter type-id='eaa32e2f' name='obj_cb_arg' filepath='env.c' line='274' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_mem_iter' mangled-name='spdk_mempool_mem_iter' filepath='env.c' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_mem_iter' hash='f78245eca7b720f0'>
      <parameter type-id='564ba9df' name='mp' filepath='env.c' line='296' column='1'/>
      <parameter type-id='7436b056' name='mem_cb' filepath='env.c' line='296' column='1'/>
      <parameter type-id='eaa32e2f' name='mem_cb_arg' filepath='env.c' line='297' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_lookup' mangled-name='spdk_mempool_lookup' filepath='env.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_lookup' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='name' filepath='env.c' line='308' column='1'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_process_is_primary' mangled-name='spdk_process_is_primary' filepath='env.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_process_is_primary' hash='c7c710e908194b91'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks' mangled-name='spdk_get_ticks' filepath='env.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks' hash='e0055d99adb0e173'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks_hz' mangled-name='spdk_get_ticks_hz' filepath='env.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks_hz' hash='e0055d99adb0e173'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_delay_us' mangled-name='spdk_delay_us' filepath='env.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_delay_us' hash='2bb88322482ae81c'>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pause' mangled-name='spdk_pause' filepath='env.c' line='338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pause' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_unaffinitize_thread' mangled-name='spdk_unaffinitize_thread' filepath='env.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unaffinitize_thread' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_call_unaffinitized' mangled-name='spdk_call_unaffinitized' filepath='env.c' line='367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_call_unaffinitized' hash='5695f5ce05a4c55f'>
      <parameter type-id='75964865' name='cb' filepath='env.c' line='367' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='env.c' line='367' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_ring_create' mangled-name='spdk_ring_create' filepath='env.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_create' hash='ed9618a6c74ff717'>
      <parameter type-id='3bd6ac02' name='type' filepath='env.c' line='392' column='1'/>
      <parameter type-id='b59d7dce' name='count' filepath='env.c' line='392' column='1'/>
      <parameter type-id='95e97e5e' name='numa_id' filepath='env.c' line='392' column='1'/>
      <return type-id='b2192338'/>
    </function-decl>
    <function-decl name='spdk_ring_free' mangled-name='spdk_ring_free' filepath='env.c' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_free' hash='7f32ffea222edbe7'>
      <parameter type-id='b2192338' name='ring' filepath='env.c' line='424' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' hash='832927d81271bf3d' id='9208d9db'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='84941752'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='e69c1394'>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='init.c' language='LANG_C11'>
    <class-decl name='spdk_env_opts' is-struct='yes' visibility='default' size-in-bits='1024' filepath='env.h' line='55' column='1' hash='4bd330bbba0978f4' id='ca9dface'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='env.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_mask' type-id='80f4b756' visibility='default' filepath='env.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lcore_map' type-id='80f4b756' visibility='default' filepath='env.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='shm_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mem_channel' type-id='95e97e5e' visibility='default' filepath='env.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='main_core' type-id='95e97e5e' visibility='default' filepath='env.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mem_size' type-id='95e97e5e' visibility='default' filepath='env.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='no_pci' type-id='c894953d' visibility='default' filepath='env.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='hugepage_single_segments' type-id='c894953d' visibility='default' filepath='env.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='unlink_hugepage' type-id='c894953d' visibility='default' filepath='env.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='no_huge' type-id='c894953d' visibility='default' filepath='env.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='env.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='num_pci_addr' type-id='b59d7dce' visibility='default' filepath='env.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugedir' type-id='80f4b756' visibility='default' filepath='env.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pci_blocked' type-id='a714fad8' visibility='default' filepath='env.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pci_allowed' type-id='a714fad8' visibility='default' filepath='env.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='iova_mode' type-id='80f4b756' visibility='default' filepath='env.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='base_virtaddr' type-id='9c313c2d' visibility='default' filepath='env.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='env_context' type-id='eaa32e2f' visibility='default' filepath='env.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vf_token' type-id='80f4b756' visibility='default' filepath='env.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='env.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='enforce_numa' type-id='c894953d' visibility='default' filepath='env.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='968'>
        <var-decl name='reserved2' type-id='d3538ec5' visibility='default' filepath='env.h' line='82' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <qualified-type-def type-id='ca9dface' const='yes' hash='51d0b9df397e390f' id='d4ecc0a1'/>
    <pointer-type-def type-id='d4ecc0a1' size-in-bits='64' hash='a7447265625e78f8' id='bbb31ad1'/>
    <pointer-type-def type-id='ca9dface' size-in-bits='64' hash='efe3808a3cc92826' id='52dba564'/>
    <var-decl name='per_lcore__rte_errno' type-id='95e97e5e' visibility='default' filepath='rte_errno.h' line='20' column='1' elf-symbol-id='per_lcore__rte_errno'/>
    <function-decl name='spdk_env_opts_init' mangled-name='spdk_env_opts_init' filepath='init.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_opts_init' hash='fdbf9313e3d391b6'>
      <parameter type-id='52dba564' name='opts' filepath='init.c' line='90' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_init' mangled-name='spdk_env_dpdk_post_init' filepath='init.c' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_init' hash='a79502d22727be06'>
      <parameter type-id='c894953d' name='legacy_mem' filepath='init.c' line='572' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_fini' mangled-name='spdk_env_dpdk_post_fini' filepath='init.c' line='598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_init' mangled-name='spdk_env_init' filepath='init.c' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_init' hash='a716b7c6897eef02'>
      <parameter type-id='bbb31ad1' name='opts_user' filepath='init.c' line='628' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_fini' mangled-name='spdk_env_fini' filepath='init.c' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_external_init' mangled-name='spdk_env_dpdk_external_init' filepath='init.c' line='781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_external_init' hash='c7c710e908194b91'>
      <return type-id='c894953d'/>
    </function-decl>
    <var-decl name='optind' type-id='95e97e5e' visibility='default' filepath='getopt_core.h' line='50' column='1' elf-symbol-id='optind'/>
    <var-decl name='stdout' type-id='822cd80b' visibility='default' filepath='stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
  </abi-instr>
  <abi-instr address-size='64' path='memory.c' language='LANG_C11'>
    <enum-decl name='spdk_mem_map_notify_action' size-in-bits='32' alignment-in-bits='32' filepath='env.h' line='1398' column='1' hash='edc4c5cce08e3581' id='4c36f7b6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_REGISTER' value='0'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_UNREGISTER' value='1'/>
    </enum-decl>
    <class-decl name='spdk_mem_map_ops' is-struct='yes' visibility='default' size-in-bits='128' filepath='env.h' line='1412' column='1' hash='6cdfd6199d31dfd1' id='23691567'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='notify_cb' type-id='3d8a3989' visibility='default' filepath='env.h' line='1413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='are_contiguous' type-id='8cf6f4bf' visibility='default' filepath='env.h' line='1414' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='spdk_mem_map_contiguous_translations' type-id='e0842244' size-in-bits='64' filepath='env.h' line='1407' column='1' hash='fd7a63c0c6c822c4' id='8cf6f4bf'/>
    <typedef-decl name='spdk_mem_map_notify_cb' type-id='b48778db' size-in-bits='64' filepath='env.h' line='1403' column='1' hash='fd7a63c0c6c822c4' id='3d8a3989'/>
    <qualified-type-def type-id='23691567' const='yes' hash='df0773d542d54574' id='a2fd39ea'/>
    <pointer-type-def type-id='a2fd39ea' size-in-bits='64' hash='9afd9da4933658be' id='54a1e940'/>
    <pointer-type-def type-id='48802609' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e0842244'/>
    <pointer-type-def type-id='affe17e0' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b48778db'/>
    <qualified-type-def type-id='ba933a44' const='yes' id='36a99011'/>
    <pointer-type-def type-id='36a99011' size-in-bits='64' id='47ee0ce1'/>
    <pointer-type-def type-id='ba933a44' size-in-bits='64' id='73c19462'/>
    <pointer-type-def type-id='73c19462' size-in-bits='64' id='81bc6d58'/>
    <class-decl name='spdk_mem_map' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='memory.c' line='100' column='1' id='ba933a44'/>
    <function-decl name='spdk_mem_map_alloc' mangled-name='spdk_mem_map_alloc' filepath='memory.c' line='256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_alloc' hash='ecca6f12cec276db'>
      <parameter type-id='9c313c2d' name='default_translation' filepath='memory.c' line='256' column='1'/>
      <parameter type-id='54a1e940' name='ops' filepath='memory.c' line='256' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='memory.c' line='256' column='1'/>
      <return type-id='73c19462'/>
    </function-decl>
    <function-decl name='spdk_mem_map_free' mangled-name='spdk_mem_map_free' filepath='memory.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_free' hash='7f32ffea222edbe7'>
      <parameter type-id='81bc6d58' name='pmap' filepath='memory.c' line='299' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mem_register' mangled-name='spdk_mem_register' filepath='memory.c' line='332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_register' hash='b6a97d07f8261bc0'>
      <parameter type-id='eaa32e2f' name='_vaddr' filepath='memory.c' line='394' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='memory.c' line='394' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_unregister' mangled-name='spdk_mem_unregister' filepath='memory.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_unregister' hash='b6a97d07f8261bc0'>
      <parameter type-id='eaa32e2f' name='_vaddr' filepath='memory.c' line='394' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='memory.c' line='394' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_set_translation' mangled-name='spdk_mem_map_set_translation' filepath='memory.c' line='580' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_set_translation' hash='e9722a6cf1a6ddff'>
      <parameter type-id='73c19462' name='map' filepath='memory.c' line='580' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='580' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='memory.c' line='580' column='1'/>
      <parameter type-id='9c313c2d' name='translation' filepath='memory.c' line='581' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_clear_translation' mangled-name='spdk_mem_map_clear_translation' filepath='memory.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_clear_translation' hash='ccc0e5595ea688d4'>
      <parameter type-id='73c19462' name='map' filepath='memory.c' line='621' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='621' column='1'/>
      <parameter type-id='9c313c2d' name='size' filepath='memory.c' line='621' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_translate' mangled-name='spdk_mem_map_translate' filepath='memory.c' line='627' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_translate' hash='2d5f7844196f3045'>
      <parameter type-id='47ee0ce1' name='map' filepath='memory.c' line='627' column='1'/>
      <parameter type-id='9c313c2d' name='vaddr' filepath='memory.c' line='627' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='memory.c' line='627' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_iommu_is_enabled' mangled-name='spdk_iommu_is_enabled' filepath='memory.c' line='807' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iommu_is_enabled' hash='c7c710e908194b91'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_vtophys' mangled-name='spdk_vtophys' filepath='memory.c' line='1626' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vtophys' hash='bc3ce1b78312683c'>
      <parameter type-id='eaa32e2f' name='buf' filepath='memory.c' line='1626' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='memory.c' line='1626' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_mem_get_numa_id' mangled-name='spdk_mem_get_numa_id' filepath='memory.c' line='1652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_get_numa_id' hash='0ef6d80b7999d270'>
      <parameter type-id='eaa32e2f' name='buf' filepath='memory.c' line='1652' column='1'/>
      <parameter type-id='5d6479ae' name='size' filepath='memory.c' line='1652' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_mem_get_fd_and_offset' mangled-name='spdk_mem_get_fd_and_offset' filepath='memory.c' line='1658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_get_fd_and_offset' hash='0ef6d80b7999d270'>
      <parameter type-id='eaa32e2f' name='vaddr' filepath='memory.c' line='1658' column='1'/>
      <parameter type-id='5d6479ae' name='offset' filepath='memory.c' line='1658' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='ccc0e5595ea688d4' id='48802609'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='0c5f64ec815a8830' id='affe17e0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='73c19462'/>
      <parameter type-id='4c36f7b6'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci.c' language='LANG_C11'>
    <class-decl name='_spdk_pci_device_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='776' column='1' hash='38fc92e059e2dd5b' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' is-struct='yes' visibility='default' size-in-bits='960' filepath='env.h' line='756' column='1' hash='f69b0a5b42882896' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='1b5ad344' visibility='default' filepath='env.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='50305372' visibility='default' filepath='env.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='e25894ac' visibility='default' filepath='env.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='e25894ac' visibility='default' filepath='env.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device_provider' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='1338' column='1' hash='d438efb524016ddb' id='dec91549'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='env.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attach_cb' type-id='73268674' visibility='default' filepath='env.h' line='1348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='detach_cb' type-id='6a50f153' visibility='default' filepath='env.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='env.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='741' column='1' hash='12edc1ed2493e379' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='788' column='1' hash='75df1d70e5e3877c' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='1359' column='1' hash='e7ba112e4cce16b7#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='35ee3f91' visibility='default' filepath='env.h' line='1359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a10e5361' visibility='default' filepath='env.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='spdk_pci_enum_cb' type-id='25cb4e88' size-in-bits='64' filepath='env.h' line='802' column='1' hash='fd7a63c0c6c822c4' id='963d1819'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='env.h' line='761' column='1' hash='dc65722026032fd3' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='numa_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='762' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='763' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <qualified-type-def type-id='ec72f59a' const='yes' hash='8cb57170cfd4e37e' id='e81a0cd5'/>
    <pointer-type-def type-id='e81a0cd5' size-in-bits='64' hash='932c19ff3f78ba32' id='6002756d'/>
    <qualified-type-def type-id='86ef9a2b' const='yes' hash='12ab0d488d93092d' id='a69f6a68'/>
    <pointer-type-def type-id='a69f6a68' size-in-bits='64' hash='5eb1eb66be214d16' id='8ef445e6'/>
    <pointer-type-def type-id='630f2781' size-in-bits='64' hash='fd7a63c0c6c822c4' id='73268674'/>
    <pointer-type-def type-id='d8ef6f95' size-in-bits='64' hash='fd7a63c0c6c822c4' id='50305372'/>
    <pointer-type-def type-id='fa9ac61d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='1b5ad344'/>
    <pointer-type-def type-id='e704d407' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e25894ac'/>
    <pointer-type-def type-id='7c9d37e3' size-in-bits='64' hash='fd7a63c0c6c822c4' id='25cb4e88'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' hash='699a45d446346234' id='a714fad8'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' hash='4670fa82230db99b' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' hash='8bc7219f41f400e9' id='b4842653'/>
    <pointer-type-def type-id='dec91549' size-in-bits='64' hash='126f7b9973363b13' id='35ee3f91'/>
    <pointer-type-def type-id='35ee3f91' size-in-bits='64' hash='f43334f391689b97' id='a10e5361'/>
    <pointer-type-def type-id='a41463d8' size-in-bits='64' hash='b6adf86939612c0a' id='1f08f56e'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' hash='bd1d889facccead8' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' hash='24d8cca8965ce13e' id='ae3e8ca6'/>
    <pointer-type-def type-id='8382c070' size-in-bits='64' hash='fd7a63c0c6c822c4' id='6a50f153'/>
    <pointer-type-def type-id='28bf3cba' size-in-bits='64' hash='fd7a63c0c6c822c4' id='a6f41677'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <function-decl name='spdk_pci_driver_register' mangled-name='spdk_pci_driver_register' filepath='pci.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_driver_register' hash='4542da65d38879f7'>
      <parameter type-id='80f4b756' name='name' filepath='pci.c' line='174' column='1'/>
      <parameter type-id='1f08f56e' name='id_table' filepath='pci.c' line='174' column='1'/>
      <parameter type-id='8f92235e' name='flags' filepath='pci.c' line='174' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_nvme_get_driver' mangled-name='spdk_pci_nvme_get_driver' filepath='pci.c' line='192' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_nvme_get_driver' hash='7f32ffea222edbe7'>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_get_driver' mangled-name='spdk_pci_get_driver' filepath='pci.c' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_driver' hash='53885bde0aa65efe'>
      <parameter type-id='80f4b756' name='name' filepath='pci.c' line='198' column='1'/>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_device_detach' mangled-name='spdk_pci_device_detach' filepath='pci.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_detach' hash='c152b797b087b0d8'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_attach' mangled-name='spdk_pci_device_attach' filepath='pci.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_attach' hash='5b4163a16f3831a0'>
      <parameter type-id='a10bedff' name='driver' filepath='pci.c' line='601' column='1'/>
      <parameter type-id='963d1819' name='enum_cb' filepath='pci.c' line='602' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='pci.c' line='603' column='1'/>
      <parameter type-id='a714fad8' name='pci_address' filepath='pci.c' line='603' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_enumerate' mangled-name='spdk_pci_enumerate' filepath='pci.c' line='681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_enumerate' hash='a7f99494147764a8'>
      <parameter type-id='a10bedff' name='driver' filepath='pci.c' line='681' column='1'/>
      <parameter type-id='963d1819' name='enum_cb' filepath='pci.c' line='682' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='pci.c' line='683' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_for_each_device' mangled-name='spdk_pci_for_each_device' filepath='pci.c' line='729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_for_each_device' hash='5695f5ce05a4c55f'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='pci.c' line='729' column='1'/>
      <parameter type-id='a6f41677' name='fn' filepath='pci.c' line='729' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_map_bar' mangled-name='spdk_pci_device_map_bar' filepath='pci.c' line='741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_map_bar' hash='05b34402ba93ca54'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unmap_bar' mangled-name='spdk_pci_device_unmap_bar' filepath='pci.c' line='779' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unmap_bar' hash='35f9072fdd1fcb6c'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_enable_interrupt' mangled-name='spdk_pci_device_enable_interrupt' filepath='pci.c' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_enable_interrupt' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_disable_interrupt' mangled-name='spdk_pci_device_disable_interrupt' filepath='pci.c' line='802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_disable_interrupt' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_interrupt_efd' mangled-name='spdk_pci_device_get_interrupt_efd' filepath='pci.c' line='808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_interrupt_efd' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_enable_interrupts' mangled-name='spdk_pci_device_enable_interrupts' filepath='pci.c' line='814' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_enable_interrupts' hash='35f9072fdd1fcb6c'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='869' column='1'/>
      <parameter type-id='8f92235e' name='index' filepath='pci.c' line='869' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_disable_interrupts' mangled-name='spdk_pci_device_disable_interrupts' filepath='pci.c' line='851' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_disable_interrupts' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_interrupt_efd_by_index' mangled-name='spdk_pci_device_get_interrupt_efd_by_index' filepath='pci.c' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_interrupt_efd_by_index' hash='35f9072fdd1fcb6c'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='869' column='1'/>
      <parameter type-id='8f92235e' name='index' filepath='pci.c' line='869' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_domain' mangled-name='spdk_pci_device_get_domain' filepath='pci.c' line='882' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_domain' hash='8a581b594a0d6991'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='882' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_bus' mangled-name='spdk_pci_device_get_bus' filepath='pci.c' line='888' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_bus' hash='78b4ec9b9eb50b38'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='900' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_dev' mangled-name='spdk_pci_device_get_dev' filepath='pci.c' line='894' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_dev' hash='78b4ec9b9eb50b38'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='900' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_func' mangled-name='spdk_pci_device_get_func' filepath='pci.c' line='900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_func' hash='78b4ec9b9eb50b38'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='900' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_vendor_id' mangled-name='spdk_pci_device_get_vendor_id' filepath='pci.c' line='906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_vendor_id' hash='f0f6f1d6d420477b'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='924' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_device_id' mangled-name='spdk_pci_device_get_device_id' filepath='pci.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_device_id' hash='f0f6f1d6d420477b'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='924' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subvendor_id' mangled-name='spdk_pci_device_get_subvendor_id' filepath='pci.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subvendor_id' hash='f0f6f1d6d420477b'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='924' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subdevice_id' mangled-name='spdk_pci_device_get_subdevice_id' filepath='pci.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subdevice_id' hash='f0f6f1d6d420477b'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='924' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_id' mangled-name='spdk_pci_device_get_id' filepath='pci.c' line='930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_id' hash='c152b797b087b0d8'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='930' column='1'/>
      <return type-id='a41463d8'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_numa_id' mangled-name='spdk_pci_device_get_numa_id' filepath='pci.c' line='936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_numa_id' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_socket_id' mangled-name='spdk_pci_device_get_socket_id' filepath='pci.c' line='944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_socket_id' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read' mangled-name='spdk_pci_device_cfg_read' filepath='pci.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read' hash='62d730029a69659a'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write' mangled-name='spdk_pci_device_cfg_write' filepath='pci.c' line='957' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write' hash='62d730029a69659a'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read8' mangled-name='spdk_pci_device_cfg_read8' filepath='pci.c' line='963' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read8' hash='2bfea6554b9641ca'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='963' column='1'/>
      <parameter type-id='ae3e8ca6' name='value' filepath='pci.c' line='963' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='963' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write8' mangled-name='spdk_pci_device_cfg_write8' filepath='pci.c' line='969' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write8' hash='344d9fca21a4deb3'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='969' column='1'/>
      <parameter type-id='b96825af' name='value' filepath='pci.c' line='969' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='969' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read16' mangled-name='spdk_pci_device_cfg_read16' filepath='pci.c' line='975' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read16' hash='42befda84ce48103'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='975' column='1'/>
      <parameter type-id='8a121f49' name='value' filepath='pci.c' line='975' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='975' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write16' mangled-name='spdk_pci_device_cfg_write16' filepath='pci.c' line='981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write16' hash='1de8f68ae1f50db4'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='981' column='1'/>
      <parameter type-id='149c6638' name='value' filepath='pci.c' line='981' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='981' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read32' mangled-name='spdk_pci_device_cfg_read32' filepath='pci.c' line='987' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read32' hash='d6e1476d01da86d9'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='987' column='1'/>
      <parameter type-id='90421557' name='value' filepath='pci.c' line='987' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='987' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write32' mangled-name='spdk_pci_device_cfg_write32' filepath='pci.c' line='993' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write32' hash='62d730029a69659a'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='993' column='1'/>
      <parameter type-id='8f92235e' name='value' filepath='pci.c' line='993' column='1'/>
      <parameter type-id='8f92235e' name='offset' filepath='pci.c' line='993' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_serial_number' mangled-name='spdk_pci_device_get_serial_number' filepath='pci.c' line='999' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_serial_number' hash='4ba55ae7bcc17c85'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='999' column='1'/>
      <parameter type-id='26a90f95' name='sn' filepath='pci.c' line='999' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='pci.c' line='999' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_addr' mangled-name='spdk_pci_device_get_addr' filepath='pci.c' line='1044' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_addr' hash='c152b797b087b0d8'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1044' column='1'/>
      <return type-id='ec72f59a'/>
    </function-decl>
    <function-decl name='spdk_pci_device_is_removed' mangled-name='spdk_pci_device_is_removed' filepath='pci.c' line='1050' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_is_removed' hash='125b7d576da7b7a3'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1050' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_compare' mangled-name='spdk_pci_addr_compare' filepath='pci.c' line='1056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_compare' hash='f78200eeb85b1eef'>
      <parameter type-id='6002756d' name='a1' filepath='pci.c' line='1056' column='1'/>
      <parameter type-id='6002756d' name='a2' filepath='pci.c' line='1056' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_claim' mangled-name='spdk_pci_device_claim' filepath='pci.c' line='1081' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_claim' hash='4413e9ea99d2f810'>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1081' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unclaim' mangled-name='spdk_pci_device_unclaim' filepath='pci.c' line='1135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unclaim' hash='c152b797b087b0d8'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_parse' mangled-name='spdk_pci_addr_parse' filepath='pci.c' line='1162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_parse' hash='bf507fd3e6750c0d'>
      <parameter type-id='a714fad8' name='addr' filepath='pci.c' line='1162' column='1'/>
      <parameter type-id='80f4b756' name='bdf' filepath='pci.c' line='1162' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_fmt' mangled-name='spdk_pci_addr_fmt' filepath='pci.c' line='1199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_fmt' hash='4058f2c6a997607e'>
      <parameter type-id='26a90f95' name='bdf' filepath='pci.c' line='1199' column='1'/>
      <parameter type-id='b59d7dce' name='sz' filepath='pci.c' line='1199' column='1'/>
      <parameter type-id='6002756d' name='addr' filepath='pci.c' line='1199' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_hook_device' mangled-name='spdk_pci_hook_device' filepath='pci.c' line='1215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_hook_device' hash='4413e9ea99d2f810'>
      <parameter type-id='a10bedff' name='drv' filepath='pci.c' line='1215' column='1'/>
      <parameter type-id='efc5406b' name='dev' filepath='pci.c' line='1215' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_unhook_device' mangled-name='spdk_pci_unhook_device' filepath='pci.c' line='1240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_unhook_device' hash='c152b797b087b0d8'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_register_device_provider' mangled-name='spdk_pci_register_device_provider' filepath='pci.c' line='1247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_device_provider' hash='eabb30b7e0da3c79'>
      <parameter type-id='35ee3f91' name='provider' filepath='pci.c' line='1247' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_type' mangled-name='spdk_pci_device_get_type' filepath='pci.c' line='1253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_type' hash='873ec2dade09fa38'>
      <parameter type-id='8ef445e6' name='dev' filepath='pci.c' line='1253' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_pci_device_allow' mangled-name='spdk_pci_device_allow' filepath='pci.c' line='1259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_allow' hash='bf5a32d3352b6054'>
      <parameter type-id='a714fad8' name='pci_addr' filepath='pci.c' line='1259' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='pci_dpdk.h' line='11' column='1' id='469e1bd7'/>
    <function-type size-in-bits='64' hash='c5128a7c8af1bf3f' id='630f2781'>
      <parameter type-id='6002756d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='35f9072fdd1fcb6c' id='d8ef6f95'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='05b34402ba93ca54' id='fa9ac61d'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='62d730029a69659a' id='e704d407'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='4413e9ea99d2f810' id='7c9d37e3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='c152b797b087b0d8' id='8382c070'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='c152b797b087b0d8' id='28bf3cba'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci_dpdk.c' language='LANG_C11'>
    <var-decl name='fn_table_2207' type-id='94e802c6' visibility='default' filepath='pci_dpdk.c' line='11' column='1'/>
    <var-decl name='fn_table_2211' type-id='94e802c6' visibility='default' filepath='pci_dpdk.c' line='12' column='1'/>
    <class-decl name='dpdk_fn_table' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='pci_dpdk.h' line='28' column='1' id='94e802c6'/>
  </abi-instr>
  <abi-instr address-size='64' path='pci_event.c' language='LANG_C11'>
    <enum-decl name='spdk_pci_event_type' size-in-bits='32' alignment-in-bits='32' filepath='env.h' line='1543' column='1' hash='7a762d2f50e28a45' id='09d5c853'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_UEVENT_ADD' value='0'/>
      <enumerator name='SPDK_UEVENT_REMOVE' value='1'/>
    </enum-decl>
    <class-decl name='spdk_pci_event' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='1548' column='1' hash='b25e2642ecbbaf4a' id='c488f7e7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='09d5c853' visibility='default' filepath='env.h' line='1549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='traddr' type-id='ec72f59a' visibility='default' filepath='env.h' line='1550' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c488f7e7' size-in-bits='64' hash='0e14627814de1adb' id='f0aa383f'/>
    <function-decl name='spdk_pci_event_listen' mangled-name='spdk_pci_event_listen' filepath='pci_event.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_event_listen' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_get_event' mangled-name='spdk_pci_get_event' filepath='pci_event.c' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_event' hash='fa6580314593e6bd'>
      <parameter type-id='95e97e5e' name='fd' filepath='pci_event.c' line='189' column='1'/>
      <parameter type-id='f0aa383f' name='event' filepath='pci_event.c' line='189' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_idxd.c' language='LANG_C11'>
    <pointer-type-def type-id='469e1bd8' size-in-bits='64' id='a10bee00'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd8'/>
    <function-decl name='spdk_pci_idxd_get_driver' mangled-name='spdk_pci_idxd_get_driver' filepath='pci_idxd.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_idxd_get_driver' hash='7f32ffea222edbe7'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_ioat.c' language='LANG_C11'>
    <pointer-type-def type-id='469e1bd9' size-in-bits='64' id='a10bee01'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd9'/>
    <function-decl name='spdk_pci_ioat_get_driver' mangled-name='spdk_pci_ioat_get_driver' filepath='pci_ioat.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_ioat_get_driver' hash='7f32ffea222edbe7'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_virtio.c' language='LANG_C11'>
    <pointer-type-def type-id='469e1bda' size-in-bits='64' id='a10bee02'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bda'/>
    <function-decl name='spdk_pci_virtio_get_driver' mangled-name='spdk_pci_virtio_get_driver' filepath='pci_virtio.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_virtio_get_driver' hash='7f32ffea222edbe7'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_vmd.c' language='LANG_C11'>
    <pointer-type-def type-id='469e1bdb' size-in-bits='64' id='a10bee03'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bdb'/>
    <function-decl name='spdk_pci_vmd_get_driver' mangled-name='spdk_pci_vmd_get_driver' filepath='pci_vmd.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_vmd_get_driver' hash='7f32ffea222edbe7'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sigbus_handler.c' language='LANG_C11'>
    <typedef-decl name='spdk_pci_error_handler' type-id='30f9af41' size-in-bits='64' filepath='env.h' line='1553' column='1' hash='fd7a63c0c6c822c4' id='bb61f2cb'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='30f9af41'/>
    <function-decl name='spdk_pci_register_error_handler' mangled-name='spdk_pci_register_error_handler' filepath='sigbus_handler.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_error_handler' hash='a7f99494147764a8'>
      <parameter type-id='bb61f2cb' name='sighandler' filepath='sigbus_handler.c' line='55' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='sigbus_handler.c' line='55' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_unregister_error_handler' mangled-name='spdk_pci_unregister_error_handler' filepath='sigbus_handler.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_unregister_error_handler' hash='5695f5ce05a4c55f'>
      <parameter type-id='bb61f2cb' name='sighandler' filepath='sigbus_handler.c' line='91' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c039af2e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='threads.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_cpuset' is-struct='yes' visibility='default' size-in-bits='3080' filepath='cpuset.h' line='25' column='1' hash='c4979574ded471d6' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='thread_start_fn' type-id='c04372aa' size-in-bits='64' filepath='env.h' line='599' column='1' hash='fd7a63c0c6c822c4' id='25440708'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c04372aa'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' hash='3b069d0e8f010cd1' id='d5319498'/>
    <function-decl name='spdk_env_get_core_count' mangled-name='spdk_env_get_core_count' filepath='threads.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_core_count' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_current_core' mangled-name='spdk_env_get_current_core' filepath='threads.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_current_core' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_main_core' mangled-name='spdk_env_get_main_core' filepath='threads.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_main_core' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_first_core' mangled-name='spdk_env_get_first_core' filepath='threads.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_first_core' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_last_core' mangled-name='spdk_env_get_last_core' filepath='threads.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_last_core' hash='2bb88322482ae81c'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_next_core' mangled-name='spdk_env_get_next_core' filepath='threads.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_next_core' hash='0389e499374a3f97'>
      <parameter type-id='8f92235e' name='core' filepath='threads.c' line='82' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_numa_id' mangled-name='spdk_env_get_numa_id' filepath='threads.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_numa_id' hash='6668baab5275d4c5'>
      <parameter type-id='8f92235e' name='core' filepath='threads.c' line='70' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_env_get_socket_id' mangled-name='spdk_env_get_socket_id' filepath='threads.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_socket_id' hash='0389e499374a3f97'>
      <parameter type-id='8f92235e' name='core' filepath='threads.c' line='82' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_first_numa_id' mangled-name='spdk_env_get_first_numa_id' filepath='threads.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_first_numa_id' hash='388da3fa973fde78'>
      <return type-id='3ff5601b'/>
    </function-decl>
