<abi-corpus version='2.4' soname='libspdk_ioat.so.7.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_ioat_build_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_build_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_detach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_get_dma_capabilities' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_get_max_descriptors' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_probe' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_process_events' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ioat_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pthread_mutex_lock' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pthread_mutex_unlock' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_delay_us' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_write32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_enumerate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_ioat_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='ioat.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='776' column='1' hash='38fc92e059e2dd5b' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' is-struct='yes' visibility='default' size-in-bits='960' filepath='env.h' line='756' column='1' hash='f69b0a5b42882896' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='1b5ad344' visibility='default' filepath='env.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='50305372' visibility='default' filepath='env.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='e25894ac' visibility='default' filepath='env.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='e25894ac' visibility='default' filepath='env.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='741' column='1' hash='12edc1ed2493e379' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='788' column='1' hash='75df1d70e5e3877c' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='spdk_ioat_attach_cb' type-id='4fb4fe2e' size-in-bits='64' filepath='ioat.h' line='52' column='1' hash='fd7a63c0c6c822c4' id='8cd955d6'/>
    <typedef-decl name='spdk_ioat_probe_cb' type-id='9292f889' size-in-bits='64' filepath='ioat.h' line='42' column='1' hash='fd7a63c0c6c822c4' id='f6c74e99'/>
    <typedef-decl name='spdk_ioat_req_cb' type-id='61359e15' size-in-bits='64' filepath='ioat.h' line='32' column='1' hash='fd7a63c0c6c822c4' id='577fc623'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='env.h' line='761' column='1' hash='dc65722026032fd3' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='numa_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='762' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='763' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eeb'/>
    <pointer-type-def type-id='382815ac' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9292f889'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='d8ef6f95' size-in-bits='64' hash='fd7a63c0c6c822c4' id='50305372'/>
    <pointer-type-def type-id='fa9ac61d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='1b5ad344'/>
    <pointer-type-def type-id='e704d407' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e25894ac'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' hash='4670fa82230db99b' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' hash='8bc7219f41f400e9' id='b4842653'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='61359e15'/>
    <pointer-type-def type-id='6577fd51' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4fb4fe2e'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='fff4b13a' size-in-bits='64' id='3319d698'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <function-decl name='spdk_ioat_flush' mangled-name='spdk_ioat_flush' filepath='ioat.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_flush' hash='7f32ffea222edbe7'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='559' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioat_get_max_descriptors' mangled-name='spdk_ioat_get_max_descriptors' filepath='ioat.c' line='351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_get_max_descriptors' hash='2bb88322482ae81c'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='729' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_ioat_probe' mangled-name='spdk_ioat_probe' filepath='ioat.c' line='540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_probe' hash='dd4f6238e2200dff'>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='ioat.c' line='540' column='1'/>
      <parameter type-id='f6c74e99' name='probe_cb' filepath='ioat.c' line='540' column='1'/>
      <parameter type-id='8cd955d6' name='attach_cb' filepath='ioat.c' line='540' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_detach' mangled-name='spdk_ioat_detach' filepath='ioat.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_detach' hash='7f32ffea222edbe7'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='559' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioat_build_copy' mangled-name='spdk_ioat_build_copy' filepath='ioat.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_build_copy' hash='6f942c73482bd8e3'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='642' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_submit_copy' mangled-name='spdk_ioat_submit_copy' filepath='ioat.c' line='641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_submit_copy' hash='6f942c73482bd8e3'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='641' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='ioat.c' line='642' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='642' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_build_fill' mangled-name='spdk_ioat_build_fill' filepath='ioat.c' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_build_fill' hash='d36bb6161e780710'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='fill_pattern' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='715' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_submit_fill' mangled-name='spdk_ioat_submit_fill' filepath='ioat.c' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_submit_fill' hash='d36bb6161e780710'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='577fc623' name='cb_fn' filepath='ioat.c' line='714' column='1'/>
      <parameter type-id='eaa32e2f' name='dst' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='fill_pattern' filepath='ioat.c' line='715' column='1'/>
      <parameter type-id='9c313c2d' name='nbytes' filepath='ioat.c' line='715' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ioat_get_dma_capabilities' mangled-name='spdk_ioat_get_dma_capabilities' filepath='ioat.c' line='729' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_get_dma_capabilities' hash='2bb88322482ae81c'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='729' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_ioat_process_events' mangled-name='spdk_ioat_process_events' filepath='ioat.c' line='738' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioat_process_events' hash='388da3fa973fde78'>
      <parameter type-id='3319d698' name='ioat' filepath='ioat.c' line='738' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_ioat_chan' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='ioat_internal.h' line='26' column='1' id='fff4b13a'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='125b7d576da7b7a3' id='382815ac'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' hash='35f9072fdd1fcb6c' id='d8ef6f95'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='05b34402ba93ca54' id='fa9ac61d'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='62d730029a69659a' id='e704d407'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='c152b797b087b0d8' id='6577fd51'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <parameter type-id='3319d698'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
