<abi-corpus version='2.4' soname='libspdk_scsi.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.7.0'/>
    <dependency name='libspdk_trace.so.11.0'/>
    <dependency name='libspdk_bdev.so.17.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_scsi_dev_add_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_lun_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_port' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_allocate_io_channels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_bdev_open_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_queue_io_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_readv_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_unmap_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_writev_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dif_ctx_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_io_channel_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_array_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_array_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_end_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_poller_register_named' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_poller_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_put_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_register_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strcpy_pad' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_description' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_owner_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u32log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='dev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' is-struct='yes' visibility='default' size-in-bits='320' filepath='bdev.h' line='2111' column='1' hash='35379864373f4bb6' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='2112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='2113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='2114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='bdev.h' line='2115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_task' is-struct='yes' visibility='default' size-in-bits='2048' filepath='scsi.h' line='65' column='1' hash='f6a24d870dc730d3' id='806d5c76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='b96825af' visibility='default' filepath='scsi.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='function' type-id='b96825af' visibility='default' filepath='scsi.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='response' type-id='b96825af' visibility='default' filepath='scsi.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='ae62b094' visibility='default' filepath='scsi.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='target_port' type-id='bd4f4b0e' visibility='default' filepath='scsi.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initiator_port' type-id='bd4f4b0e' visibility='default' filepath='scsi.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpl_fn' type-id='06438a61' visibility='default' filepath='scsi.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_fn' type-id='4d4c0ac2' visibility='default' filepath='scsi.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='8f92235e' visibility='default' filepath='scsi.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='transfer_len' type-id='8f92235e' visibility='default' filepath='scsi.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dxfer_dir' type-id='8f92235e' visibility='default' filepath='scsi.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='scsi.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='data_transferred' type-id='8f92235e' visibility='default' filepath='scsi.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='scsi.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cdb' type-id='ae3e8ca6' visibility='default' filepath='scsi.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_len' type-id='8f92235e' visibility='default' filepath='scsi.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='scsi.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='caw_iov' type-id='0f042891' visibility='default' filepath='scsi.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='scsi.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='iovcnt' type-id='149c6638' visibility='default' filepath='scsi.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='sense_data' type-id='d0f1c0cb' visibility='default' filepath='scsi.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='sense_data_len' type-id='b59d7dce' visibility='default' filepath='scsi.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bdev_io' type-id='eaa32e2f' visibility='default' filepath='scsi.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='scsi_link' type-id='e7f43f73' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='abort_id' type-id='8f92235e' visibility='default' filepath='scsi.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default' filepath='scsi.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev.h' line='2115' column='1' hash='1d6be5d923ee5c29' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='2115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='2115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='scsi.h' line='111' column='1' hash='85e46d78443cb673#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='12b36f7c' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c6784462' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eed' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='61359e15' size-in-bits='64' filepath='bdev.h' line='2106' column='1' hash='fd7a63c0c6c822c4' id='065af103'/>
    <typedef-decl name='spdk_scsi_dev_destruct_cb_t' type-id='82328a76' size-in-bits='64' filepath='scsi.h' line='123' column='1' hash='fd7a63c0c6c822c4' id='d48d236f'/>
    <typedef-decl name='spdk_scsi_task_cpl' type-id='9db61bb0' size-in-bits='64' filepath='scsi.h' line='62' column='1' hash='fd7a63c0c6c822c4' id='06438a61'/>
    <typedef-decl name='spdk_scsi_task_free' type-id='9db61bb0' size-in-bits='64' filepath='scsi.h' line='63' column='1' hash='fd7a63c0c6c822c4' id='4d4c0ac2'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' hash='037c09e5626cce93' id='d0f1c0cb'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' hash='cea1d4b0943594a3' id='7d3cd834'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' hash='c39cdf2a9611d4e3' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' hash='07d61e08616d2ce2' id='fccc38b9'/>
    <pointer-type-def type-id='806d5c76' size-in-bits='64' hash='f6e3ced90d44429a' id='12b36f7c'/>
    <pointer-type-def type-id='12b36f7c' size-in-bits='64' hash='61e6c062618f448d' id='c6784462'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' hash='24d8cca8965ce13e' id='ae3e8ca6'/>
    <pointer-type-def type-id='bb054cbc' size-in-bits='64' hash='fd7a63c0c6c822c4' id='af3f33fd'/>
    <pointer-type-def type-id='0ed3c515' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9db61bb0'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='61359e15'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <qualified-type-def type-id='74e6cc2e' const='yes' id='fef6abad'/>
    <pointer-type-def type-id='fef6abad' size-in-bits='64' id='e5500585'/>
    <qualified-type-def type-id='1677014e' const='yes' id='4db60f3d'/>
    <pointer-type-def type-id='4db60f3d' size-in-bits='64' id='6c99c135'/>
    <qualified-type-def type-id='ae540668' const='yes' id='3cb8ef61'/>
    <pointer-type-def type-id='3cb8ef61' size-in-bits='64' id='e220b311'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='74e6cc2e' size-in-bits='64' id='491ccef4'/>
    <pointer-type-def type-id='1677014e' size-in-bits='64' id='ae62b094'/>
    <pointer-type-def type-id='ae540668' size-in-bits='64' id='bd4f4b0e'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <function-decl name='spdk_scsi_dev_destruct' mangled-name='spdk_scsi_dev_destruct' filepath='dev.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_destruct' hash='5695f5ce05a4c55f'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='52' column='1'/>
      <parameter type-id='d48d236f' name='cb_fn' filepath='dev.c' line='53' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='dev.c' line='53' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun' mangled-name='spdk_scsi_dev_add_lun' filepath='dev.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun' hash='b2ef61a93093af56'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='80f4b756' name='bdev_name' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='af3f33fd' name='hotremove_cb' filepath='dev.c' line='134' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='135' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun_ext' mangled-name='spdk_scsi_dev_add_lun_ext' filepath='dev.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun_ext' hash='dd43c57444c07a37'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='80f4b756' name='bdev_name' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='af3f33fd' name='resize_cb' filepath='dev.c' line='144' column='1'/>
      <parameter type-id='eaa32e2f' name='resize_ctx' filepath='dev.c' line='145' column='1'/>
      <parameter type-id='af3f33fd' name='hotremove_cb' filepath='dev.c' line='146' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='147' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_lun' mangled-name='spdk_scsi_dev_delete_lun' filepath='dev.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_lun' hash='7f32ffea222edbe7'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='187' column='1'/>
      <parameter type-id='ae62b094' name='lun' filepath='dev.c' line='188' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct' mangled-name='spdk_scsi_dev_construct' filepath='dev.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct' hash='62edee85aafb5fe8'>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='197' column='1'/>
      <parameter type-id='7d3cd834' name='bdev_name_list' filepath='dev.c' line='197' column='1'/>
      <parameter type-id='7292109c' name='lun_id_list' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='95e97e5e' name='num_luns' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='b96825af' name='protocol_id' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='af3f33fd' name='hotremove_cb' filepath='dev.c' line='199' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='200' column='1'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct_ext' mangled-name='spdk_scsi_dev_construct_ext' filepath='dev.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct_ext' hash='10f2d7b9c193c858'>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='208' column='1'/>
      <parameter type-id='7d3cd834' name='bdev_name_list' filepath='dev.c' line='208' column='1'/>
      <parameter type-id='7292109c' name='lun_id_list' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='95e97e5e' name='num_luns' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='b96825af' name='protocol_id' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='af3f33fd' name='resize_cb' filepath='dev.c' line='210' column='1'/>
      <parameter type-id='eaa32e2f' name='resize_ctx' filepath='dev.c' line='211' column='1'/>
      <parameter type-id='af3f33fd' name='hotremove_cb' filepath='dev.c' line='212' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='213' column='1'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_mgmt_task' mangled-name='spdk_scsi_dev_queue_mgmt_task' filepath='dev.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_mgmt_task' hash='3bc2fc6e7d4b5d3a'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='286' column='1'/>
      <parameter type-id='12b36f7c' name='task' filepath='dev.c' line='287' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_task' mangled-name='spdk_scsi_dev_queue_task' filepath='dev.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_task' hash='3bc2fc6e7d4b5d3a'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='286' column='1'/>
      <parameter type-id='12b36f7c' name='task' filepath='dev.c' line='287' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_port' mangled-name='spdk_scsi_dev_add_port' filepath='dev.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_port' hash='060631f163ac4382'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='309' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='309' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='309' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_port' mangled-name='spdk_scsi_dev_delete_port' filepath='dev.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_port' hash='b6a97d07f8261bc0'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='341' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='341' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_find_port_by_id' mangled-name='spdk_scsi_dev_find_port_by_id' filepath='dev.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_find_port_by_id' hash='e0055d99adb0e173'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='359' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='359' column='1'/>
      <return type-id='bd4f4b0e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_free_io_channels' mangled-name='spdk_scsi_dev_free_io_channels' filepath='dev.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_free_io_channels' hash='7f32ffea222edbe7'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='377' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_allocate_io_channels' mangled-name='spdk_scsi_dev_allocate_io_channels' filepath='dev.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_allocate_io_channels' hash='388da3fa973fde78'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='387' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_name' mangled-name='spdk_scsi_dev_get_name' filepath='dev.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_name' hash='53885bde0aa65efe'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='404' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_id' mangled-name='spdk_scsi_dev_get_id' filepath='dev.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_id' hash='388da3fa973fde78'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='410' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_lun' mangled-name='spdk_scsi_dev_get_lun' filepath='dev.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_lun' hash='388da3fa973fde78'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='416' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='416' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_first_lun' mangled-name='spdk_scsi_dev_get_first_lun' filepath='dev.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_first_lun' hash='7f32ffea222edbe7'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='434' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_next_lun' mangled-name='spdk_scsi_dev_get_next_lun' filepath='dev.c' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_next_lun' hash='7f32ffea222edbe7'>
      <parameter type-id='ae62b094' name='prev_lun' filepath='dev.c' line='448' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_has_pending_tasks' mangled-name='spdk_scsi_dev_has_pending_tasks' filepath='dev.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_has_pending_tasks' hash='c7c710e908194b91'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='474' column='1'/>
      <parameter type-id='e220b311' name='initiator_port' filepath='dev.c' line='475' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <class-decl name='spdk_scsi_port' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='scsi_internal.h' line='28' column='1' id='ae540668'/>
    <class-decl name='spdk_scsi_dev' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='scsi_internal.h' line='60' column='1' id='74e6cc2e'/>
    <class-decl name='spdk_scsi_lun' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='scsi_internal.h' line='84' column='1' id='1677014e'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='bb054cbc'>
      <parameter type-id='6c99c135'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='3bc2fc6e7d4b5d3a' id='0ed3c515'>
      <parameter type-id='12b36f7c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='lun.c' language='LANG_C11'>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='spdk_dif_ctx' is-struct='yes' visibility='default' size-in-bits='512' filepath='dif.h' line='65' column='1' hash='3fa86a99bcca3589' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f74' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='spdk_scsi_lun_remove_cb_t' type-id='1c77bc68' size-in-bits='64' filepath='scsi.h' line='122' column='1' hash='fd7a63c0c6c822c4' id='4a415871'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' hash='953f9801eb087566' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='6e011169' size-in-bits='64' hash='09fde6bcda1f9892' id='a3141401'/>
    <pointer-type-def type-id='a6dc9de4' size-in-bits='64' hash='f13879d37c217898' id='ddda0722'/>
    <pointer-type-def type-id='dd5b8639' size-in-bits='64' hash='fd7a63c0c6c822c4' id='1c77bc68'/>
    <qualified-type-def type-id='74e6cc2e' const='yes' id='fef6abae'/>
    <pointer-type-def type-id='fef6abae' size-in-bits='64' id='e5500586'/>
    <qualified-type-def type-id='1677014e' const='yes' id='4db60f3e'/>
    <pointer-type-def type-id='4db60f3e' size-in-bits='64' id='6c99c136'/>
    <pointer-type-def type-id='1677014e' size-in-bits='64' id='ae62b095'/>
    <pointer-type-def type-id='544a7a5e' size-in-bits='64' id='0029b6e4'/>
    <pointer-type-def type-id='0029b6e4' size-in-bits='64' id='0faac64a'/>
    <var-decl name='g_trace_file' type-id='ddda0722' visibility='default' filepath='trace.h' line='149' column='1' elf-symbol-id='g_trace_file'/>
    <function-decl name='spdk_scsi_lun_open' mangled-name='spdk_scsi_lun_open' filepath='lun.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_open' hash='a7f99494147764a8'>
      <parameter type-id='ae62b095' name='lun' filepath='lun.c' line='480' column='1'/>
      <parameter type-id='4a415871' name='hotremove_cb' filepath='lun.c' line='480' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='lun.c' line='481' column='1'/>
      <parameter type-id='0faac64a' name='_desc' filepath='lun.c' line='481' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_close' mangled-name='spdk_scsi_lun_close' filepath='lun.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_close' hash='7f32ffea222edbe7'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='561' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_allocate_io_channel' mangled-name='spdk_scsi_lun_allocate_io_channel' filepath='lun.c' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_allocate_io_channel' hash='388da3fa973fde78'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='553' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_free_io_channel' mangled-name='spdk_scsi_lun_free_io_channel' filepath='lun.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_free_io_channel' hash='7f32ffea222edbe7'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='561' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_id' mangled-name='spdk_scsi_lun_get_id' filepath='lun.c' line='569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_id' hash='388da3fa973fde78'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='569' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_bdev_name' mangled-name='spdk_scsi_lun_get_bdev_name' filepath='lun.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_bdev_name' hash='53885bde0aa65efe'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='575' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_dev' mangled-name='spdk_scsi_lun_get_dev' filepath='lun.c' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_dev' hash='7f32ffea222edbe7'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='581' column='1'/>
      <return type-id='e5500586'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_is_removing' mangled-name='spdk_scsi_lun_is_removing' filepath='lun.c' line='639' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_is_removing' hash='c7c710e908194b91'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='639' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_dif_ctx' mangled-name='spdk_scsi_lun_get_dif_ctx' filepath='lun.c' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_dif_ctx' hash='72d9703cfb8ffafa'>
      <parameter type-id='ae62b095' name='lun' filepath='lun.c' line='645' column='1'/>
      <parameter type-id='12b36f7c' name='task' filepath='lun.c' line='645' column='1'/>
      <parameter type-id='a3141401' name='dif_ctx' filepath='lun.c' line='646' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <class-decl name='spdk_scsi_lun_desc' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='scsi_internal.h' line='77' column='1' id='544a7a5e'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='dd5b8639'>
      <parameter type-id='ae62b095'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='port.c' language='LANG_C11'>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='ae540668' const='yes' id='3cb8ef62'/>
    <pointer-type-def type-id='3cb8ef62' size-in-bits='64' id='e220b312'/>
    <pointer-type-def type-id='ae540668' size-in-bits='64' id='bd4f4b0f'/>
    <pointer-type-def type-id='bd4f4b0f' size-in-bits='64' id='27d349ac'/>
    <function-decl name='spdk_scsi_port_create' mangled-name='spdk_scsi_port_create' filepath='port.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_create' hash='b6d9df83660d7d7b'>
      <parameter type-id='9c313c2d' name='id' filepath='port.c' line='12' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='port.c' line='12' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='port.c' line='12' column='1'/>
      <return type-id='bd4f4b0f'/>
    </function-decl>
    <function-decl name='spdk_scsi_port_free' mangled-name='spdk_scsi_port_free' filepath='port.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_free' hash='7f32ffea222edbe7'>
      <parameter type-id='27d349ac' name='pport' filepath='port.c' line='31' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_port_get_name' mangled-name='spdk_scsi_port_get_name' filepath='port.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_get_name' hash='53885bde0aa65efe'>
      <parameter type-id='e220b312' name='port' filepath='port.c' line='67' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_port_set_iscsi_transport_id' mangled-name='spdk_scsi_port_set_iscsi_transport_id' filepath='port.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_port_set_iscsi_transport_id' hash='ac947bf3f290a477'>
      <parameter type-id='bd4f4b0f' name='port' filepath='port.c' line='77' column='1'/>
      <parameter type-id='26a90f95' name='iscsi_name' filepath='port.c' line='77' column='1'/>
      <parameter type-id='9c313c2d' name='isid' filepath='port.c' line='78' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='scsi.c' language='LANG_C11'>
    <function-decl name='spdk_scsi_init' mangled-name='spdk_scsi_init' filepath='scsi.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_init' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_fini' mangled-name='spdk_scsi_fini' filepath='scsi.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_id_int_to_fmt' mangled-name='spdk_scsi_lun_id_int_to_fmt' filepath='scsi.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_id_int_to_fmt' hash='2dc81cf21cc431f4'>
      <parameter type-id='95e97e5e' name='lun_id' filepath='scsi.c' line='36' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_id_fmt_to_int' mangled-name='spdk_scsi_lun_id_fmt_to_int' filepath='scsi.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_id_fmt_to_int' hash='b6a97d07f8261bc0'>
      <parameter type-id='9c313c2d' name='fmt_lun' filepath='scsi.c' line='59' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_sbc_opcode_string' mangled-name='spdk_scsi_sbc_opcode_string' filepath='scsi.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_sbc_opcode_string' hash='c81f67b93948ac0f'>
      <parameter type-id='b96825af' name='opcode' filepath='scsi.c' line='124' column='1'/>
      <parameter type-id='149c6638' name='sa' filepath='scsi.c' line='124' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='scsi_bdev.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eed' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eeb' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
  </abi-instr>
  <abi-instr address-size='64' path='task.c' language='LANG_C11'>
    <function-decl name='spdk_scsi_task_put' mangled-name='spdk_scsi_task_put' filepath='task.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_task_put' hash='3bc2fc6e7d4b5d3a'>
      <parameter type-id='12b36f7c'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_task_construct' mangled-name='spdk_scsi_task_construct' filepath='task.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_task_construct' hash='a9cd250bff051bfa'>
      <parameter type-id='12b36f7c' name='task' filepath='task.c' line='48' column='1'/>
      <parameter type-id='06438a61' name='cpl_fn' filepath='task.c' line='49' column='1'/>
      <parameter type-id='4d4c0ac2' name='free_fn' filepath='task.c' line='50' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_task_scatter_data' mangled-name='spdk_scsi_task_scatter_data' filepath='task.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_task_scatter_data' hash='709fe061b474d984'>
      <parameter type-id='12b36f7c' name='task' filepath='task.c' line='90' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='task.c' line='90' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='task.c' line='90' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_task_gather_data' mangled-name='spdk_scsi_task_gather_data' filepath='task.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_task_gather_data' hash='c9ea0eac869a1a61'>
      <parameter type-id='12b36f7c' name='task' filepath='task.c' line='133' column='1'/>
      <parameter type-id='7292109c' name='len' filepath='task.c' line='133' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
