<abi-corpus version='2.4' soname='libspdk_virtio.so.7.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libspdk_json.so.6.1'/>
    <dependency name='libspdk_thread.so.11.0'/>
    <dependency name='libspdk_vfio_user.so.5.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='virtio_dev_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_backend_ops' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_dump_json_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_find_and_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_get_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vfio_user_pci_bar_access' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vfio_user_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vfio_user_setup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_alloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_compare' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_fmt' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_attach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_detach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_addr' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_device_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_subdevice_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_is_removed' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_enumerate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_get_event' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_register_error_handler' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_virtio_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_process_is_primary' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='virtio.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' hash='e7f9696e246a3049' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_virtio_desc_type' size-in-bits='32' alignment-in-bits='32' filepath='virtio.h' line='149' column='1' hash='1e47f95bde429d7a' id='82458b79'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_VIRTIO_DESC_RO' value='0'/>
      <enumerator name='SPDK_VIRTIO_DESC_WR' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='95e97e60'/>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_dev' is-struct='yes' visibility='default' size-in-bits='768' filepath='virtio.h' line='38' column='1' hash='51b6d527ba690900' id='220c9082'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vqs' type-id='06ce3ba1' visibility='default' filepath='virtio.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='virtio.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fixed_queues_num' type-id='149c6638' visibility='default' filepath='virtio.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='max_queues' type-id='149c6638' visibility='default' filepath='virtio.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='negotiated_features' type-id='9c313c2d' visibility='default' filepath='virtio.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='is_hw' type-id='95e97e5e' visibility='default' filepath='virtio.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='modern' type-id='b96825af' visibility='default' filepath='virtio.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='virtio.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backend_ops' type-id='7fd10606' visibility='default' filepath='virtio.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_dev_ops' is-struct='yes' visibility='default' size-in-bits='832' filepath='virtio.h' line='68' column='1' hash='723adfb167be700a' id='eca1d791'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_dev_cfg' type-id='5965f78a' visibility='default' filepath='virtio.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_dev_cfg' type-id='5965f78a' visibility='default' filepath='virtio.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_status' type-id='df0bb755' visibility='default' filepath='virtio.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_status' type-id='b77463c3' visibility='default' filepath='virtio.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_features' type-id='271acbcd' visibility='default' filepath='virtio.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_features' type-id='05a500f4' visibility='default' filepath='virtio.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='destruct_dev' type-id='089a9238' visibility='default' filepath='virtio.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_queue_size' type-id='0c87ce06' visibility='default' filepath='virtio.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setup_queue' type-id='39eb6eeb' visibility='default' filepath='virtio.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='del_queue' type-id='c4980c58' visibility='default' filepath='virtio.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_queue' type-id='c4980c58' visibility='default' filepath='virtio.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dump_json_info' type-id='b1eb5b85' visibility='default' filepath='virtio.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='write_json_config' type-id='b1eb5b85' visibility='default' filepath='virtio.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='virtqueue' is-struct='yes' visibility='default' size-in-bits='832' filepath='virtio.h' line='106' column='1' hash='11e3d15949ec9326' id='d7c60ba9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vdev' type-id='c4ba6c30' visibility='default' filepath='virtio.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vq_ring' type-id='83eac9f7' visibility='default' filepath='virtio.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vq_used_cons_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vq_nentries' type-id='149c6638' visibility='default' filepath='virtio.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='vq_free_cnt' type-id='149c6638' visibility='default' filepath='virtio.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='vq_avail_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vq_ring_virt_mem' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vq_ring_size' type-id='f0981eec' visibility='default' filepath='virtio.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='vq_ring_mem' type-id='9c313c2d' visibility='default' filepath='virtio.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vq_desc_head_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='vq_desc_tail_idx' type-id='149c6638' visibility='default' filepath='virtio.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='vq_queue_index' type-id='149c6638' visibility='default' filepath='virtio.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_addr' type-id='8a121f49' visibility='default' filepath='virtio.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='owner_thread' type-id='f8fcfe66' visibility='default' filepath='virtio.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='req_start' type-id='149c6638' visibility='default' filepath='virtio.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='req_end' type-id='149c6638' visibility='default' filepath='virtio.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reqs_finished' type-id='149c6638' visibility='default' filepath='virtio.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vq_descx' type-id='f3c55529' visibility='default' filepath='virtio.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='vq_desc_extra' is-struct='yes' visibility='default' size-in-bits='128' filepath='virtio.h' line='101' column='1' hash='a149f3f5d88545ff' id='fb448689'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='eaa32e2f' visibility='default' filepath='virtio.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ndescs' type-id='149c6638' visibility='default' filepath='virtio.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' size-in-bits='128' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' size-in-bits='320' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <union-decl name='pthread_mutex_t' naming-typedef-id='7a6844eb' visibility='default' size-in-bits='320' filepath='pthreadtypes.h' line='67' column='1' hash='8e3e5ddbcaed875f' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default' filepath='pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default' filepath='pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eed'/>
    <array-type-def dimensions='1' type-id='fb448689' size-in-bits='unknown' hash='e565df1b1f44afe5' id='f3c55529'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' hash='b83eb2deac70d470' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='eca1d791' const='yes' hash='5bfeab0ff3330468' id='d2d03d88'/>
    <pointer-type-def type-id='d2d03d88' size-in-bits='64' hash='67d3578238199899' id='7fd10606'/>
    <pointer-type-def type-id='78d61085' size-in-bits='64' hash='fd7a63c0c6c822c4' id='5965f78a'/>
    <pointer-type-def type-id='4c598157' size-in-bits='64' hash='fd7a63c0c6c822c4' id='05a500f4'/>
    <pointer-type-def type-id='8ee50edc' size-in-bits='64' hash='fd7a63c0c6c822c4' id='39eb6eeb'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='939b848b' size-in-bits='64' hash='fd7a63c0c6c822c4' id='0c87ce06'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' hash='bd1d889facccead8' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <pointer-type-def type-id='38d14106' size-in-bits='64' hash='fd7a63c0c6c822c4' id='271acbcd'/>
    <pointer-type-def type-id='0a2904a6' size-in-bits='64' hash='fd7a63c0c6c822c4' id='df0bb755'/>
    <pointer-type-def type-id='220c9082' size-in-bits='64' hash='9b8f33284db9a3fd' id='c4ba6c30'/>
    <pointer-type-def type-id='d7c60ba9' size-in-bits='64' hash='d79c387f6902ea99' id='91d0de51'/>
    <pointer-type-def type-id='91d0de51' size-in-bits='64' hash='cc1e8c287afd4198' id='06ce3ba1'/>
    <pointer-type-def type-id='1b4dff91' size-in-bits='64' hash='fd7a63c0c6c822c4' id='089a9238'/>
    <pointer-type-def type-id='69547f68' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b1eb5b85'/>
    <pointer-type-def type-id='e080bc24' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b77463c3'/>
    <pointer-type-def type-id='0282c3dd' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c4980c58'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <class-decl name='vring' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='virtio_ring.h' line='122' column='1' id='83eac9f7'/>
    <function-decl name='virtio_dev_construct' mangled-name='virtio_dev_construct' filepath='virtio.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_construct' hash='dda70e1f39065fb6'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='229' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio.c' line='229' column='1'/>
      <parameter type-id='7fd10606' name='ops' filepath='virtio.c' line='230' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='virtio.c' line='230' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_reset' mangled-name='virtio_dev_reset' filepath='virtio.c' line='252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_reset' hash='702ef7b9ddf8fd4d'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_start' mangled-name='virtio_dev_start' filepath='virtio.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_start' hash='b08e2ce4d414d516'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='274' column='1'/>
      <parameter type-id='149c6638' name='max_queues' filepath='virtio.c' line='274' column='1'/>
      <parameter type-id='149c6638' name='fixed_queue_num' filepath='virtio.c' line='274' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_destruct' mangled-name='virtio_dev_destruct' filepath='virtio.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_destruct' hash='97a6a239c7c5ec4e'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_start' mangled-name='virtqueue_req_start' filepath='virtio.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_start' hash='b348cfb4f1ff7ad1'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='394' column='1'/>
      <parameter type-id='eaa32e2f' name='cookie' filepath='virtio.c' line='394' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='virtio.c' line='394' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtqueue_req_flush' mangled-name='virtqueue_req_flush' filepath='virtio.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_flush' hash='94b78a8969f6526b'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='451' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_abort' mangled-name='virtqueue_req_abort' filepath='virtio.c' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_abort' hash='94b78a8969f6526b'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='451' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_add_iovs' mangled-name='virtqueue_req_add_iovs' filepath='virtio.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_add_iovs' hash='4f69c0ef8774c649'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='468' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='virtio.c' line='468' column='1'/>
      <parameter type-id='149c6638' name='iovcnt' filepath='virtio.c' line='468' column='1'/>
      <parameter type-id='82458b79' name='desc_type' filepath='virtio.c' line='469' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_recv_pkts' mangled-name='virtio_recv_pkts' filepath='virtio.c' line='531' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_recv_pkts' hash='9811f2c4a9a9dd79'>
      <parameter type-id='91d0de51' name='vq' filepath='virtio.c' line='531' column='1'/>
      <parameter type-id='63e171df' name='io' filepath='virtio.c' line='531' column='1'/>
      <parameter type-id='90421557' name='len' filepath='virtio.c' line='531' column='1'/>
      <parameter type-id='149c6638' name='nb_pkts' filepath='virtio.c' line='531' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='virtio_dev_acquire_queue' mangled-name='virtio_dev_acquire_queue' filepath='virtio.c' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_acquire_queue' hash='a184dedc7dfec040'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='547' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='547' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_find_and_acquire_queue' mangled-name='virtio_dev_find_and_acquire_queue' filepath='virtio.c' line='570' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_find_and_acquire_queue' hash='a184dedc7dfec040'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='570' column='1'/>
      <parameter type-id='149c6638' name='start_index' filepath='virtio.c' line='570' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_get_thread' mangled-name='virtio_dev_queue_get_thread' filepath='virtio.c' line='595' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_get_thread' hash='332486a89060dbfa'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='595' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='595' column='1'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_is_acquired' mangled-name='virtio_dev_queue_is_acquired' filepath='virtio.c' line='613' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_is_acquired' hash='7dd52df14ef23ebb'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='613' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='613' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='virtio_dev_release_queue' mangled-name='virtio_dev_release_queue' filepath='virtio.c' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_release_queue' hash='332486a89060dbfa'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio.c' line='619' column='1'/>
      <parameter type-id='149c6638' name='index' filepath='virtio.c' line='619' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_read_dev_config' mangled-name='virtio_dev_read_dev_config' filepath='virtio.c' line='643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_read_dev_config' hash='37bbee2266409486'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_write_dev_config' mangled-name='virtio_dev_write_dev_config' filepath='virtio.c' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_write_dev_config' hash='37bbee2266409486'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_stop' mangled-name='virtio_dev_stop' filepath='virtio.c' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_stop' hash='97a6a239c7c5ec4e'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_set_status' mangled-name='virtio_dev_set_status' filepath='virtio.c' line='666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_set_status' hash='3eb29b7b37bac089'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b96825af'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_get_status' mangled-name='virtio_dev_get_status' filepath='virtio.c' line='676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_get_status' hash='d9101b04df6e6d17'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='virtio_dev_backend_ops' mangled-name='virtio_dev_backend_ops' filepath='virtio.c' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_backend_ops' hash='af52c32e843edff4'>
      <parameter type-id='c4ba6c30' name='dev' filepath='virtio.c' line='682' column='1'/>
      <return type-id='7fd10606'/>
    </function-decl>
    <function-decl name='virtio_dev_dump_json_info' mangled-name='virtio_dev_dump_json_info' filepath='virtio.c' line='688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_dump_json_info' hash='97a6a239c7c5ec4e'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='37bbee2266409486' id='78d61085'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='702ef7b9ddf8fd4d' id='4c598157'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='4aaa575d7f990ca5' id='8ee50edc'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='2be45fbd12cc8bc8' id='939b848b'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='149c6638'/>
      <return type-id='149c6638'/>
    </function-type>
    <function-type size-in-bits='64' hash='538e48a3fbf3a429' id='38d14106'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' hash='d9101b04df6e6d17' id='0a2904a6'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='b96825af'/>
    </function-type>
    <function-type size-in-bits='64' hash='97a6a239c7c5ec4e' id='1b4dff91'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='97a6a239c7c5ec4e' id='69547f68'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='3eb29b7b37bac089' id='e080bc24'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b96825af'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='96ddfce1561f6cae' id='0282c3dd'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_pci.c' language='LANG_C11'>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='virtio_pci_create_cb' type-id='bcd9f4d8' size-in-bits='64' filepath='virtio.h' line='164' column='1' hash='fd7a63c0c6c822c4' id='9d774d53'/>
    <pointer-type-def type-id='04b7c0a5' size-in-bits='64' hash='fd7a63c0c6c822c4' id='bcd9f4d8'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' hash='699a45d446346234' id='a714fad8'/>
    <class-decl name='virtio_pci_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7790783'/>
    <pointer-type-def type-id='b7790783' size-in-bits='64' id='486c7873'/>
    <function-decl name='virtio_pci_dev_event_process' mangled-name='virtio_pci_dev_event_process' filepath='virtio_pci.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_event_process' hash='dcb8fca6ca022020'>
      <parameter type-id='95e97e5e' name='fd' filepath='virtio_pci.c' line='159' column='1'/>
      <parameter type-id='149c6638' name='device_id' filepath='virtio_pci.c' line='159' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_enumerate' mangled-name='virtio_pci_dev_enumerate' filepath='virtio_pci.c' line='723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_enumerate' hash='258fcba59d77c34b'>
      <parameter type-id='9d774d53' name='enum_cb' filepath='virtio_pci.c' line='723' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='virtio_pci.c' line='723' column='1'/>
      <parameter type-id='149c6638' name='pci_device_id' filepath='virtio_pci.c' line='724' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_attach' mangled-name='virtio_pci_dev_attach' filepath='virtio_pci.c' line='742' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_attach' hash='08b2dda64932677e'>
      <parameter type-id='9d774d53' name='enum_cb' filepath='virtio_pci.c' line='742' column='1'/>
      <parameter type-id='eaa32e2f' name='enum_ctx' filepath='virtio_pci.c' line='742' column='1'/>
      <parameter type-id='149c6638' name='device_id' filepath='virtio_pci.c' line='743' column='1'/>
      <parameter type-id='a714fad8' name='pci_address' filepath='virtio_pci.c' line='743' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_init' mangled-name='virtio_pci_dev_init' filepath='virtio_pci.c' line='761' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_init' hash='dacb378e2a5b6a12'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio_pci.c' line='761' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio_pci.c' line='761' column='1'/>
      <parameter type-id='486c7873' name='pci_ctx' filepath='virtio_pci.c' line='762' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='04b7c0a5'>
      <parameter type-id='486c7873'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_vfio_user.c' language='LANG_C11'>
    <function-decl name='virtio_vfio_user_dev_init' mangled-name='virtio_vfio_user_dev_init' filepath='virtio_vfio_user.c' line='391' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_vfio_user_dev_init' hash='0977015262b042c1'>
      <parameter type-id='c4ba6c30' name='vdev' filepath='virtio_vfio_user.c' line='391' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='virtio_vfio_user.c' line='391' column='1'/>
