<abi-corpus version='2.4' soname='libspdk_rdma_utils.so.1.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libspdk_dma.so.5.0'/>
    <dependency name='libspdk_log.so.7.1'/>
    <dependency name='libspdk_util.so.10.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_rdma_cm_id_get_numa_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_create_mem_map' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_free_mem_map' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_get_memory_domain' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_get_pd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_get_translation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rdma_utils_put_memory_domain' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='pthread_mutex_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='pthread_mutex_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='qsort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rdma_free_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='rdma_get_devices' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_memory_domain_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_memory_domain_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_net_get_address_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_net_get_interface_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_read_sysfs_attribute_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_alloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_clear_translation' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_set_translation' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_map_translate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='rdma_utils.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='944' hash='e78758ef10066232' id='d8449f07'>
      <subrange length='118' lower-bound='0' upper-bound='117' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6f97e773a1e88e39' id='d3d55f9f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' hash='6ed507bb73d52e47' id='ca634421'>
      <subrange length='224' lower-bound='0' upper-bound='223' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='13efbde50778ea2c' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' hash='b1acd4e4c2ca8eab' id='d1617432'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' hash='4b216217eb2844ff' id='12da2087'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' hash='e7f9696e246a3049' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='384' hash='46395ec6e3501f5e' id='36d7f119'>
      <subrange length='48' lower-bound='0' upper-bound='47' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='c984f699f4a9c7be' id='8f6d2a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' hash='ea93b43678875247' id='59daf3ef'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='b10be967'/>
    </array-type-def>
    <enum-decl name='ibv_atomic_cap' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='155' column='1' hash='f1dd2fd97ff56b28' id='b830f00a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_ATOMIC_NONE' value='0'/>
      <enumerator name='IBV_ATOMIC_HCA' value='1'/>
      <enumerator name='IBV_ATOMIC_GLOB' value='2'/>
    </enum-decl>
    <enum-decl name='ibv_mw_type' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='680' column='1' hash='1e502da018b719fd' id='1795416d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_MW_TYPE_1' value='1'/>
      <enumerator name='IBV_MW_TYPE_2' value='2'/>
    </enum-decl>
    <enum-decl name='ibv_node_type' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='95' column='1' hash='0798f637ec3a6020' id='0267f9f9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_NODE_UNKNOWN' value='-1'/>
      <enumerator name='IBV_NODE_CA' value='1'/>
      <enumerator name='IBV_NODE_SWITCH' value='2'/>
      <enumerator name='IBV_NODE_ROUTER' value='3'/>
      <enumerator name='IBV_NODE_RNIC' value='4'/>
      <enumerator name='IBV_NODE_USNIC' value='5'/>
      <enumerator name='IBV_NODE_USNIC_UDP' value='6'/>
      <enumerator name='IBV_NODE_UNSPECIFIED' value='7'/>
    </enum-decl>
    <enum-decl name='ibv_qp_state' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='1052' column='1' hash='5e1c640041e25c15' id='002258df'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_QPS_RESET' value='0'/>
      <enumerator name='IBV_QPS_INIT' value='1'/>
      <enumerator name='IBV_QPS_RTR' value='2'/>
      <enumerator name='IBV_QPS_RTS' value='3'/>
      <enumerator name='IBV_QPS_SQD' value='4'/>
      <enumerator name='IBV_QPS_SQE' value='5'/>
      <enumerator name='IBV_QPS_ERR' value='6'/>
      <enumerator name='IBV_QPS_UNKNOWN' value='7'/>
    </enum-decl>
    <enum-decl name='ibv_qp_type' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='903' column='1' hash='ff1f55ab3695427f' id='d412ad8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_QPT_RC' value='2'/>
      <enumerator name='IBV_QPT_UC' value='3'/>
      <enumerator name='IBV_QPT_UD' value='4'/>
      <enumerator name='IBV_QPT_RAW_PACKET' value='8'/>
      <enumerator name='IBV_QPT_XRC_SEND' value='9'/>
      <enumerator name='IBV_QPT_XRC_RECV' value='10'/>
      <enumerator name='IBV_QPT_DRIVER' value='255'/>
    </enum-decl>
    <enum-decl name='ibv_transport_type' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='106' column='1' hash='464c8270e5bd2a32' id='b31d4ee6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_TRANSPORT_UNKNOWN' value='-1'/>
      <enumerator name='IBV_TRANSPORT_IB' value='0'/>
      <enumerator name='IBV_TRANSPORT_IWARP' value='1'/>
      <enumerator name='IBV_TRANSPORT_USNIC' value='2'/>
      <enumerator name='IBV_TRANSPORT_USNIC_UDP' value='3'/>
      <enumerator name='IBV_TRANSPORT_UNSPECIFIED' value='4'/>
    </enum-decl>
    <enum-decl name='ibv_wc_opcode' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='515' column='1' hash='5a1a4af6a43459ba' id='e20702a5'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WC_SEND' value='0'/>
      <enumerator name='IBV_WC_RDMA_WRITE' value='1'/>
      <enumerator name='IBV_WC_RDMA_READ' value='2'/>
      <enumerator name='IBV_WC_COMP_SWAP' value='3'/>
      <enumerator name='IBV_WC_FETCH_ADD' value='4'/>
      <enumerator name='IBV_WC_BIND_MW' value='5'/>
      <enumerator name='IBV_WC_LOCAL_INV' value='6'/>
      <enumerator name='IBV_WC_TSO' value='7'/>
      <enumerator name='IBV_WC_FLUSH' value='8'/>
      <enumerator name='IBV_WC_ATOMIC_WRITE' value='9'/>
      <enumerator name='IBV_WC_RECV' value='128'/>
      <enumerator name='IBV_WC_RECV_RDMA_WITH_IMM' value='129'/>
      <enumerator name='IBV_WC_TM_ADD' value='130'/>
      <enumerator name='IBV_WC_TM_DEL' value='131'/>
      <enumerator name='IBV_WC_TM_SYNC' value='132'/>
      <enumerator name='IBV_WC_TM_RECV' value='133'/>
      <enumerator name='IBV_WC_TM_NO_TAG' value='134'/>
      <enumerator name='IBV_WC_DRIVER1' value='135'/>
      <enumerator name='IBV_WC_DRIVER2' value='136'/>
      <enumerator name='IBV_WC_DRIVER3' value='137'/>
    </enum-decl>
    <enum-decl name='ibv_wc_status' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='487' column='1' hash='a38663d5844b130f' id='f7f54079'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WC_SUCCESS' value='0'/>
      <enumerator name='IBV_WC_LOC_LEN_ERR' value='1'/>
      <enumerator name='IBV_WC_LOC_QP_OP_ERR' value='2'/>
      <enumerator name='IBV_WC_LOC_EEC_OP_ERR' value='3'/>
      <enumerator name='IBV_WC_LOC_PROT_ERR' value='4'/>
      <enumerator name='IBV_WC_WR_FLUSH_ERR' value='5'/>
      <enumerator name='IBV_WC_MW_BIND_ERR' value='6'/>
      <enumerator name='IBV_WC_BAD_RESP_ERR' value='7'/>
      <enumerator name='IBV_WC_LOC_ACCESS_ERR' value='8'/>
      <enumerator name='IBV_WC_REM_INV_REQ_ERR' value='9'/>
      <enumerator name='IBV_WC_REM_ACCESS_ERR' value='10'/>
      <enumerator name='IBV_WC_REM_OP_ERR' value='11'/>
      <enumerator name='IBV_WC_RETRY_EXC_ERR' value='12'/>
      <enumerator name='IBV_WC_RNR_RETRY_EXC_ERR' value='13'/>
      <enumerator name='IBV_WC_LOC_RDD_VIOL_ERR' value='14'/>
      <enumerator name='IBV_WC_REM_INV_RD_REQ_ERR' value='15'/>
      <enumerator name='IBV_WC_REM_ABORT_ERR' value='16'/>
      <enumerator name='IBV_WC_INV_EECN_ERR' value='17'/>
      <enumerator name='IBV_WC_INV_EEC_STATE_ERR' value='18'/>
      <enumerator name='IBV_WC_FATAL_ERR' value='19'/>
      <enumerator name='IBV_WC_RESP_TIMEOUT_ERR' value='20'/>
      <enumerator name='IBV_WC_GENERAL_ERR' value='21'/>
      <enumerator name='IBV_WC_TM_ERR' value='22'/>
      <enumerator name='IBV_WC_TM_RNDV_INCOMPLETE' value='23'/>
    </enum-decl>
    <enum-decl name='ibv_wr_opcode' size-in-bits='32' alignment-in-bits='32' filepath='verbs.h' line='1105' column='1' hash='7d66aab96a7d6da3' id='e884e4f8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WR_RDMA_WRITE' value='0'/>
      <enumerator name='IBV_WR_RDMA_WRITE_WITH_IMM' value='1'/>
      <enumerator name='IBV_WR_SEND' value='2'/>
      <enumerator name='IBV_WR_SEND_WITH_IMM' value='3'/>
      <enumerator name='IBV_WR_RDMA_READ' value='4'/>
      <enumerator name='IBV_WR_ATOMIC_CMP_AND_SWP' value='5'/>
      <enumerator name='IBV_WR_ATOMIC_FETCH_AND_ADD' value='6'/>
      <enumerator name='IBV_WR_LOCAL_INV' value='7'/>
      <enumerator name='IBV_WR_BIND_MW' value='8'/>
      <enumerator name='IBV_WR_SEND_WITH_INV' value='9'/>
      <enumerator name='IBV_WR_TSO' value='10'/>
      <enumerator name='IBV_WR_DRIVER1' value='11'/>
      <enumerator name='IBV_WR_FLUSH' value='14'/>
      <enumerator name='IBV_WR_ATOMIC_WRITE' value='15'/>
    </enum-decl>
    <enum-decl name='rdma_cm_event_type' size-in-bits='32' alignment-in-bits='32' filepath='rdma_cma.h' line='50' column='1' hash='832cd8b6733d7496' id='05dc1927'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='RDMA_CM_EVENT_ADDR_RESOLVED' value='0'/>
      <enumerator name='RDMA_CM_EVENT_ADDR_ERROR' value='1'/>
      <enumerator name='RDMA_CM_EVENT_ROUTE_RESOLVED' value='2'/>
      <enumerator name='RDMA_CM_EVENT_ROUTE_ERROR' value='3'/>
      <enumerator name='RDMA_CM_EVENT_CONNECT_REQUEST' value='4'/>
      <enumerator name='RDMA_CM_EVENT_CONNECT_RESPONSE' value='5'/>
      <enumerator name='RDMA_CM_EVENT_CONNECT_ERROR' value='6'/>
      <enumerator name='RDMA_CM_EVENT_UNREACHABLE' value='7'/>
      <enumerator name='RDMA_CM_EVENT_REJECTED' value='8'/>
      <enumerator name='RDMA_CM_EVENT_ESTABLISHED' value='9'/>
      <enumerator name='RDMA_CM_EVENT_DISCONNECTED' value='10'/>
      <enumerator name='RDMA_CM_EVENT_DEVICE_REMOVAL' value='11'/>
      <enumerator name='RDMA_CM_EVENT_MULTICAST_JOIN' value='12'/>
      <enumerator name='RDMA_CM_EVENT_MULTICAST_ERROR' value='13'/>
      <enumerator name='RDMA_CM_EVENT_ADDR_CHANGE' value='14'/>
      <enumerator name='RDMA_CM_EVENT_TIMEWAIT_EXIT' value='15'/>
    </enum-decl>
    <enum-decl name='rdma_port_space' size-in-bits='32' alignment-in-bits='32' filepath='rdma_cma.h' line='69' column='1' hash='0cce734a2f2818da' id='3eec159f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='RDMA_PS_IPOIB' value='2'/>
      <enumerator name='RDMA_PS_TCP' value='262'/>
      <enumerator name='RDMA_PS_UDP' value='273'/>
      <enumerator name='RDMA_PS_IB' value='319'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='435' column='1' hash='a773cdff5c729a70' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='116' column='1' hash='26614543a63ed59a' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='95e97e60'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='95e97e61'/>
    <class-decl name='__pthread_cond_s' is-struct='yes' visibility='default' size-in-bits='384' filepath='thread-shared-types.h' line='94' column='1' hash='d9e2565ba80dd9b7' id='c987b47c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='f3b40860' visibility='default' filepath='thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='f3b40860' visibility='default' filepath='thread-shared-types.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_size' type-id='0d532ec1' visibility='default' filepath='thread-shared-types.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g1_orig_size' type-id='f0981eec' visibility='default' filepath='thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='__wrefs' type-id='f0981eec' visibility='default' filepath='thread-shared-types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g_signals' type-id='0d532ec1' visibility='default' filepath='thread-shared-types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__unused_initialized_1' type-id='f0981eec' visibility='default' filepath='thread-shared-types.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='__unused_initialized_2' type-id='f0981eec' visibility='default' filepath='thread-shared-types.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e61' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e61' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ibv_device_ops' is-struct='yes' visibility='default' size-in-bits='128' filepath='verbs.h' line='1976' column='1' hash='929ef15b8515ff3b' id='f904f53f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_dummy1' type-id='bc46f1a7' visibility='default' filepath='verbs.h' line='1977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_dummy2' type-id='21495b24' visibility='default' filepath='verbs.h' line='1978' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_ah' is-struct='yes' visibility='default' size-in-bits='192' filepath='verbs.h' line='1702' column='1' hash='39207e80dbd73d75' id='37442b88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='1703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='verbs.h' line='1704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1705' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_ah_attr' is-struct='yes' visibility='default' size-in-bits='256' filepath='verbs.h' line='764' column='1' hash='bcf2fd0d0b651bb4' id='6ddac042'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='grh' type-id='e13aff04' visibility='default' filepath='verbs.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dlid' type-id='149c6638' visibility='default' filepath='verbs.h' line='766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='sl' type-id='b96825af' visibility='default' filepath='verbs.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='src_path_bits' type-id='b96825af' visibility='default' filepath='verbs.h' line='768' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='static_rate' type-id='b96825af' visibility='default' filepath='verbs.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='is_global' type-id='b96825af' visibility='default' filepath='verbs.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='port_num' type-id='b96825af' visibility='default' filepath='verbs.h' line='771' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_comp_channel' is-struct='yes' visibility='default' size-in-bits='128' filepath='verbs.h' line='1509' column='1' hash='7e7d5b36db313088' id='7ef9d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='1510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='1511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='refcnt' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='1512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_context' is-struct='yes' visibility='default' size-in-bits='2624' filepath='verbs.h' line='2044' column='1' hash='211e7853ac60e8ea' id='47b432f8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='e658b277' visibility='default' filepath='verbs.h' line='2045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='f348463b' visibility='default' filepath='verbs.h' line='2046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='cmd_fd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='2047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='async_fd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='2048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='num_comp_vectors' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='2049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='verbs.h' line='2050' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='abi_compat' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='2051' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_context_ops' is-struct='yes' visibility='default' size-in-bits='2048' filepath='verbs.h' line='2001' column='1' hash='809971fbb34577c2' id='f348463b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_compat_query_device' type-id='51aecc0b' visibility='default' filepath='verbs.h' line='2002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_compat_query_port' type-id='aacf4b85' visibility='default' filepath='verbs.h' line='2004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_compat_alloc_pd' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_compat_dealloc_pd' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_compat_reg_mr' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_compat_rereg_mr' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_compat_dereg_mr' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='alloc_mw' type-id='5141a3fe' visibility='default' filepath='verbs.h' line='2012' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bind_mw' type-id='d4fc6013' visibility='default' filepath='verbs.h' line='2013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dealloc_mw' type-id='b3f1f6f0' visibility='default' filepath='verbs.h' line='2015' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_compat_create_cq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2016' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='poll_cq' type-id='675226d1' visibility='default' filepath='verbs.h' line='2017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='req_notify_cq' type-id='eae3d669' visibility='default' filepath='verbs.h' line='2018' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_compat_cq_event' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2019' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_compat_resize_cq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2020' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_compat_destroy_cq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2021' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_compat_create_srq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_compat_modify_srq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2023' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_compat_query_srq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2024' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_compat_destroy_srq' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2025' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='post_srq_recv' type-id='eb6c86ae' visibility='default' filepath='verbs.h' line='2026' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_compat_create_qp' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2029' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_compat_query_qp' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2030' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_compat_modify_qp' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2031' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_compat_destroy_qp' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2032' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='post_send' type-id='ff73ecdf' visibility='default' filepath='verbs.h' line='2033' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='post_recv' type-id='bd006c7b' visibility='default' filepath='verbs.h' line='2035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='_compat_create_ah' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2037' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='_compat_destroy_ah' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2038' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='_compat_attach_mcast' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2039' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='_compat_detach_mcast' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='_compat_async_event' type-id='22c4a77b' visibility='default' filepath='verbs.h' line='2041' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_cq' is-struct='yes' visibility='default' size-in-bits='1024' filepath='verbs.h' line='1515' column='1' hash='ef5a0cd599069885' id='2c489765'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='1516' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='f54ea160' visibility='default' filepath='verbs.h' line='1517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cq_context' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='1518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cqe' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='verbs.h' line='1522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cond' type-id='62fab762' visibility='default' filepath='verbs.h' line='1523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='comp_events_completed' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='async_events_completed' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1525' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_device' is-struct='yes' visibility='default' size-in-bits='5312' filepath='verbs.h' line='1986' column='1' hash='a291f69f67247112' id='a91fc35f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_ops' type-id='f904f53f' visibility='default' filepath='verbs.h' line='1987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node_type' type-id='0267f9f9' visibility='default' filepath='verbs.h' line='1988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_type' type-id='b31d4ee6' visibility='default' filepath='verbs.h' line='1989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='verbs.h' line='1991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dev_name' type-id='59daf3ef' visibility='default' filepath='verbs.h' line='1993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='dev_path' type-id='d1617432' visibility='default' filepath='verbs.h' line='1995' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='ibdev_path' type-id='d1617432' visibility='default' filepath='verbs.h' line='1997' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_device_attr' is-struct='yes' visibility='default' size-in-bits='1856' filepath='verbs.h' line='182' column='1' hash='eb1b80e818d601fe' id='57df2883'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fw_ver' type-id='59daf3ef' visibility='default' filepath='verbs.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='node_guid' type-id='0899c7ad' visibility='default' filepath='verbs.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sys_image_guid' type-id='0899c7ad' visibility='default' filepath='verbs.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_mr_size' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='page_size_cap' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='vendor_id' type-id='8f92235e' visibility='default' filepath='verbs.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='vendor_part_id' type-id='8f92235e' visibility='default' filepath='verbs.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='hw_ver' type-id='8f92235e' visibility='default' filepath='verbs.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='max_qp' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='max_qp_wr' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='device_cap_flags' type-id='f0981eec' visibility='default' filepath='verbs.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_sge' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='max_sge_rd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='max_cq' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='max_cqe' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='max_mr' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='max_pd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_qp_rd_atom' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='max_ee_rd_atom' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='max_res_rd_atom' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='max_qp_init_rd_atom' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_ee_init_rd_atom' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='atomic_cap' type-id='b830f00a' visibility='default' filepath='verbs.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='max_ee' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='max_rdd' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='max_mw' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1440'>
        <var-decl name='max_raw_ipv6_qp' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='max_raw_ethy_qp' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='max_mcast_grp' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='max_mcast_qp_attach' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='max_total_mcast_qp_attach' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='max_ah' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1632'>
        <var-decl name='max_fmr' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='max_map_per_fmr' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='max_srq' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='max_srq_wr' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1760'>
        <var-decl name='max_srq_sge' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='max_pkeys' type-id='149c6638' visibility='default' filepath='verbs.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1808'>
        <var-decl name='local_ca_ack_delay' type-id='b96825af' visibility='default' filepath='verbs.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1816'>
        <var-decl name='phys_port_cnt' type-id='b96825af' visibility='default' filepath='verbs.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_global_route' is-struct='yes' visibility='default' size-in-bits='192' filepath='verbs.h' line='693' column='1' hash='b66336bd60766004' id='e13aff04'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dgid' type-id='9c3d32dc' visibility='default' filepath='verbs.h' line='694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flow_label' type-id='8f92235e' visibility='default' filepath='verbs.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sgid_index' type-id='b96825af' visibility='default' filepath='verbs.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='hop_limit' type-id='b96825af' visibility='default' filepath='verbs.h' line='697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='traffic_class' type-id='b96825af' visibility='default' filepath='verbs.h' line='698' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_mr' is-struct='yes' visibility='default' size-in-bits='384' filepath='verbs.h' line='670' column='1' hash='aefb7430c054efc5' id='29622a92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='verbs.h' line='672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='b59d7dce' visibility='default' filepath='verbs.h' line='674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='lkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='677' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_mw' is-struct='yes' visibility='default' size-in-bits='256' filepath='verbs.h' line='685' column='1' hash='ea4ac1ee8e8c9c58' id='266225d9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='verbs.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='type' type-id='1795416d' visibility='default' filepath='verbs.h' line='690' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_mw_bind' is-struct='yes' visibility='default' size-in-bits='384' filepath='verbs.h' line='1244' column='1' hash='407a99f5616f0a45' id='6e768691'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wr_id' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_flags' type-id='f0981eec' visibility='default' filepath='verbs.h' line='1246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bind_info' type-id='fab191d2' visibility='default' filepath='verbs.h' line='1247' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_mw_bind_info' is-struct='yes' visibility='default' size-in-bits='256' filepath='verbs.h' line='627' column='1' hash='ba30d93fb11315d3' id='fab191d2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mr' type-id='bf381eb0' visibility='default' filepath='verbs.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mw_access_flags' type-id='f0981eec' visibility='default' filepath='verbs.h' line='631' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_pd' is-struct='yes' visibility='default' size-in-bits='128' filepath='verbs.h' line='634' column='1' hash='1177bc85e0d72b08' id='391f5dd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='636' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_qp' is-struct='yes' visibility='default' size-in-bits='1280' filepath='verbs.h' line='1290' column='1' hash='66b93f988fdbfeaf' id='1f1cf650'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qp_context' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='verbs.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='send_cq' type-id='d6ed2b75' visibility='default' filepath='verbs.h' line='1294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recv_cq' type-id='d6ed2b75' visibility='default' filepath='verbs.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='srq' type-id='a323be6f' visibility='default' filepath='verbs.h' line='1296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='qp_num' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='state' type-id='002258df' visibility='default' filepath='verbs.h' line='1299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='qp_type' type-id='d412ad8a' visibility='default' filepath='verbs.h' line='1300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='verbs.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='cond' type-id='62fab762' visibility='default' filepath='verbs.h' line='1303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='events_completed' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_recv_wr' is-struct='yes' visibility='default' size-in-bits='256' filepath='verbs.h' line='1208' column='1' hash='a95f692e91de41fe' id='a761d757'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wr_id' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='c6e38adf' visibility='default' filepath='verbs.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sg_list' type-id='e3920c40' visibility='default' filepath='verbs.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_sge' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='1212' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_sa_path_rec' is-struct='yes' visibility='default' size-in-bits='512' filepath='sa.h' line='40' column='1' hash='85c485f5ce241c23' id='9b6490c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dgid' type-id='9c3d32dc' visibility='default' filepath='sa.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sgid' type-id='9c3d32dc' visibility='default' filepath='sa.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dlid' type-id='84a5c3d4' visibility='default' filepath='sa.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='slid' type-id='84a5c3d4' visibility='default' filepath='sa.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='raw_traffic' type-id='95e97e5e' visibility='default' filepath='sa.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flow_label' type-id='78a133c2' visibility='default' filepath='sa.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='hop_limit' type-id='b96825af' visibility='default' filepath='sa.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='traffic_class' type-id='b96825af' visibility='default' filepath='sa.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reversible' type-id='95e97e5e' visibility='default' filepath='sa.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='numb_path' type-id='b96825af' visibility='default' filepath='sa.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='pkey' type-id='84a5c3d4' visibility='default' filepath='sa.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sl' type-id='b96825af' visibility='default' filepath='sa.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='mtu_selector' type-id='b96825af' visibility='default' filepath='sa.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='mtu' type-id='b96825af' visibility='default' filepath='sa.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='472'>
        <var-decl name='rate_selector' type-id='b96825af' visibility='default' filepath='sa.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='rate' type-id='b96825af' visibility='default' filepath='sa.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='packet_life_time_selector' type-id='b96825af' visibility='default' filepath='sa.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='packet_life_time' type-id='b96825af' visibility='default' filepath='sa.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='504'>
        <var-decl name='preference' type-id='b96825af' visibility='default' filepath='sa.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_send_wr' is-struct='yes' visibility='default' size-in-bits='1024' filepath='verbs.h' line='1158' column='1' hash='6cc905512001fc83' id='84e3f871'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wr_id' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='ce6e7e09' visibility='default' filepath='verbs.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sg_list' type-id='e3920c40' visibility='default' filepath='verbs.h' line='1161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_sge' type-id='95e97e5e' visibility='default' filepath='verbs.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='opcode' type-id='e884e4f8' visibility='default' filepath='verbs.h' line='1163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='send_flags' type-id='f0981eec' visibility='default' filepath='verbs.h' line='1164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='wr' type-id='ac5ab596' visibility='default' filepath='verbs.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='qp_type' type-id='ac5ab597' visibility='default' filepath='verbs.h' line='1193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_sge' is-struct='yes' visibility='default' size-in-bits='128' filepath='verbs.h' line='1147' column='1' hash='eedc047e9f13b066' id='0c925402'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='lkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_srq' is-struct='yes' visibility='default' size-in-bits='1024' filepath='verbs.h' line='1250' column='1' hash='14ec4fd7aaf7d39f' id='0cc1b237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default' filepath='verbs.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='srq_context' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='1252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='verbs.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='handle' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='verbs.h' line='1256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cond' type-id='62fab762' visibility='default' filepath='verbs.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='events_completed' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_wc' is-struct='yes' visibility='default' size-in-bits='384' filepath='verbs.h' line='591' column='1' hash='ae9909c06560043b' id='322a8bc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wr_id' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='status' type-id='f7f54079' visibility='default' filepath='verbs.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='opcode' type-id='e20702a5' visibility='default' filepath='verbs.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vendor_err' type-id='8f92235e' visibility='default' filepath='verbs.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='byte_len' type-id='8f92235e' visibility='default' filepath='verbs.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='qp_num' type-id='8f92235e' visibility='default' filepath='verbs.h' line='604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='src_qp' type-id='8f92235e' visibility='default' filepath='verbs.h' line='605' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='wc_flags' type-id='f0981eec' visibility='default' filepath='verbs.h' line='606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='pkey_index' type-id='149c6638' visibility='default' filepath='verbs.h' line='607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='slid' type-id='149c6638' visibility='default' filepath='verbs.h' line='608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='sl' type-id='b96825af' visibility='default' filepath='verbs.h' line='609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='360'>
        <var-decl name='dlid_path_bits' type-id='b96825af' visibility='default' filepath='verbs.h' line='610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in6_addr' is-struct='yes' visibility='default' size-in-bits='128' filepath='in.h' line='223' column='1' hash='8b501153bb93cbb0' id='f6ed712a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='ac5ab59a' visibility='default' filepath='in.h' line='230' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in_addr' is-struct='yes' visibility='default' size-in-bits='32' filepath='in.h' line='31' column='1' hash='8335790ae1212c07' id='34f03654'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='f8234714' visibility='default' filepath='in.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_addr' is-struct='yes' visibility='default' size-in-bits='2368' filepath='rdma_cma.h' line='94' column='1' hash='ea31b903bfc1fb17' id='16c9ab71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='addr' type-id='ac5ab59d' visibility='default' filepath='rdma_cma.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_cm_event' is-struct='yes' visibility='default' size-in-bits='640' filepath='rdma_cma.h' line='166' column='1' hash='ddd4a06a56b5a23d' id='cb0529dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='0765c610' visibility='default' filepath='rdma_cma.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='listen_id' type-id='0765c610' visibility='default' filepath='rdma_cma.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='event' type-id='05dc1927' visibility='default' filepath='rdma_cma.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='status' type-id='95e97e5e' visibility='default' filepath='rdma_cma.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='param' type-id='ac5ab59e' visibility='default' filepath='rdma_cma.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_cm_id' is-struct='yes' visibility='default' size-in-bits='3328' filepath='rdma_cma.h' line='122' column='1' hash='bb7bba16bb7ce6f8' id='9c92e232'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='verbs' type-id='1aaec10e' visibility='default' filepath='rdma_cma.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='24eb1268' visibility='default' filepath='rdma_cma.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='context' type-id='eaa32e2f' visibility='default' filepath='rdma_cma.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='qp' type-id='a13996c6' visibility='default' filepath='rdma_cma.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='route' type-id='f6cc5dc3' visibility='default' filepath='rdma_cma.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='ps' type-id='3eec159f' visibility='default' filepath='rdma_cma.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='port_num' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='event' type-id='94404dad' visibility='default' filepath='rdma_cma.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='send_cq_channel' type-id='f54ea160' visibility='default' filepath='rdma_cma.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='send_cq' type-id='d6ed2b75' visibility='default' filepath='rdma_cma.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='recv_cq_channel' type-id='f54ea160' visibility='default' filepath='rdma_cma.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='recv_cq' type-id='d6ed2b75' visibility='default' filepath='rdma_cma.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='srq' type-id='a323be6f' visibility='default' filepath='rdma_cma.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='pd' type-id='18028d25' visibility='default' filepath='rdma_cma.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='qp_type' type-id='d412ad8a' visibility='default' filepath='rdma_cma.h' line='137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_conn_param' is-struct='yes' visibility='default' size-in-bits='192' filepath='rdma_cma.h' line='145' column='1' hash='4dfb84c5e9048010' id='02ac523a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='rdma_cma.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='private_data_len' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='responder_resources' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='initiator_depth' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='flow_control' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='retry_count' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rnr_retry_count' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='srq' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qp_num' type-id='8f92235e' visibility='default' filepath='rdma_cma.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_event_channel' is-struct='yes' visibility='default' size-in-bits='32' filepath='rdma_cma.h' line='118' column='1' hash='2bac68d200487fad' id='8620115a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='rdma_cma.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_ib_addr' is-struct='yes' visibility='default' size-in-bits='320' filepath='rdma_cma.h' line='88' column='1' hash='164acaffe83a94ef' id='021060f1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sgid' type-id='9c3d32dc' visibility='default' filepath='rdma_cma.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dgid' type-id='9c3d32dc' visibility='default' filepath='rdma_cma.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pkey' type-id='84a5c3d4' visibility='default' filepath='rdma_cma.h' line='91' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_route' is-struct='yes' visibility='default' size-in-bits='2496' filepath='rdma_cma.h' line='112' column='1' hash='680d6f51fcf6dff0' id='f6cc5dc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='16c9ab71' visibility='default' filepath='rdma_cma.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='path_rec' type-id='2b0f8256' visibility='default' filepath='rdma_cma.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='num_paths' type-id='95e97e5e' visibility='default' filepath='rdma_cma.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rdma_ud_param' is-struct='yes' visibility='default' size-in-bits='448' filepath='rdma_cma.h' line='158' column='1' hash='39a11ab7677e5aab' id='4e0cfdb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='private_data' type-id='eaa32e2f' visibility='default' filepath='rdma_cma.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='private_data_len' type-id='b96825af' visibility='default' filepath='rdma_cma.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ah_attr' type-id='6ddac042' visibility='default' filepath='rdma_cma.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='qp_num' type-id='8f92235e' visibility='default' filepath='rdma_cma.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='qkey' type-id='8f92235e' visibility='default' filepath='rdma_cma.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='socket.h' line='184' column='1' hash='17b889f8dd08e00f' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default' filepath='socket.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default' filepath='socket.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_in' is-struct='yes' visibility='default' size-in-bits='128' filepath='in.h' line='249' column='1' hash='6d05877afad19374' id='ce2f4af4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin_family' type-id='376fda66' visibility='default' filepath='in.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin_port' type-id='306989bc' visibility='default' filepath='in.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin_addr' type-id='34f03654' visibility='default' filepath='in.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin_zero' type-id='491d0410' visibility='default' filepath='in.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_in6' is-struct='yes' visibility='default' size-in-bits='224' filepath='in.h' line='266' column='1' hash='ee488f1c11271935' id='5672af66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sin6_family' type-id='376fda66' visibility='default' filepath='in.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sin6_port' type-id='306989bc' visibility='default' filepath='in.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sin6_flowinfo' type-id='8f92235e' visibility='default' filepath='in.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sin6_addr' type-id='f6ed712a' visibility='default' filepath='in.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sin6_scope_id' type-id='8f92235e' visibility='default' filepath='in.h' line='272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' is-struct='yes' visibility='default' size-in-bits='1024' filepath='socket.h' line='197' column='1' hash='3ad3c646386e818d' id='06b72fe4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='376fda66' visibility='default' filepath='socket.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='d8449f07' visibility='default' filepath='socket.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='f0981eeb' visibility='default' filepath='socket.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_rdma_hooks' is-struct='yes' visibility='default' size-in-bits='192' filepath='nvme.h' line='4439' column='1' hash='ed31e7eae2c5f2b3' id='b43759ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='get_ibv_pd' type-id='3e82b034' visibility='default' filepath='nvme.h' line='4448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_rkey' type-id='10d4684a' visibility='default' filepath='nvme.h' line='4460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='put_rkey' type-id='87945afe' visibility='default' filepath='nvme.h' line='4468' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' is-struct='yes' visibility='default' size-in-bits='4512' filepath='nvme.h' line='491' column='1' hash='ed30d5448f2f7c82' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='536' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_rdma_utils_memory_translation' is-struct='yes' visibility='default' size-in-bits='128' filepath='rdma_utils.h' line='27' column='1' hash='262fe45eed8d4058' id='a8529370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mr_or_key' type-id='ec10ffb5' visibility='default' filepath='rdma_utils.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='translation_type' type-id='b96825af' visibility='default' filepath='rdma_utils.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='verbs.h' line='67' column='1' hash='99987e7201b1a5a3' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subnet_prefix' type-id='0899c7ad' visibility='default' filepath='verbs.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='interface_id' type-id='0899c7ad' visibility='default' filepath='verbs.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='verbs.h' line='1183' column='1' hash='8761ce0eef99abca#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ah' type-id='f3cfd12e' visibility='default' filepath='verbs.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remote_qpn' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='remote_qkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='384' is-anonymous='yes' filepath='verbs.h' line='1195' column='1' hash='0290ce98877bfa4f#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mw' type-id='a13133b1' visibility='default' filepath='verbs.h' line='1196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bind_info' type-id='fab191d2' visibility='default' filepath='verbs.h' line='1198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='verbs.h' line='1190' column='1' hash='360bcdbc3feb7b83#4' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='remote_srqn' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1191' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='verbs.h' line='1173' column='1' hash='c7cec20a01d07f64#5' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='remote_addr' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1175' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='verbs.h' line='1177' column='1' hash='2be62bc9c6160b8c#6' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='remote_addr' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='compare_add' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='swap' type-id='9c313c2d' visibility='default' filepath='verbs.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='verbs.h' line='1181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='atomic_wide_counter.h' line='28' column='1' hash='6fe24ea039e73fed#7' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__low' type-id='f0981eec' visibility='default' filepath='atomic_wide_counter.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__high' type-id='f0981eec' visibility='default' filepath='atomic_wide_counter.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='verbs.h' line='1200' column='1' hash='3c6955a740d400ff#8' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hdr' type-id='eaa32e2f' visibility='default' filepath='verbs.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='hdr_sz' type-id='149c6638' visibility='default' filepath='verbs.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='mss' type-id='149c6638' visibility='default' filepath='verbs.h' line='1203' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__atomic_wide_counter' type-id='613ce450' size-in-bits='64' filepath='atomic_wide_counter.h' line='33' column='1' id='f3b40860'/>
    <typedef-decl name='__be16' type-id='d315442e' size-in-bits='16' filepath='types.h' line='32' column='1' hash='d7723bb93a30b11d' id='84a5c3d4'/>
    <typedef-decl name='__be32' type-id='3f1a6b60' size-in-bits='32' filepath='types.h' line='34' column='1' hash='e66b43f97c38e87a' id='78a133c2'/>
    <typedef-decl name='__be64' type-id='d3130597' size-in-bits='64' filepath='types.h' line='36' column='1' hash='ebdfc4685a1e82df' id='0899c7ad'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' size-in-bits='128' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__u16' type-id='f0981eed' size-in-bits='16' filepath='int-ll64.h' line='24' column='1' hash='d7723bb93a30b11d' id='d315442e'/>
    <typedef-decl name='__u32' type-id='f0981eec' size-in-bits='32' filepath='int-ll64.h' line='27' column='1' hash='e66b43f97c38e87a' id='3f1a6b60'/>
    <typedef-decl name='__u64' type-id='f0981eee' size-in-bits='64' filepath='int-ll64.h' line='31' column='1' hash='ebdfc4685a1e82df' id='d3130597'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='in_addr_t' type-id='8f92235e' size-in-bits='32' filepath='in.h' line='30' column='1' hash='e66b43f97c38e87a' id='f8234714'/>
    <typedef-decl name='in_port_t' type-id='149c6638' size-in-bits='16' filepath='in.h' line='127' column='1' hash='d7723bb93a30b11d' id='306989bc'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='pthread_cond_t' type-id='cbb12c12' size-in-bits='384' filepath='pthreadtypes.h' line='80' column='1' id='62fab762'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' size-in-bits='320' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='sa_family_t' type-id='f0981eed' size-in-bits='16' filepath='sockaddr.h' line='28' column='1' hash='d7723bb93a30b11d' id='376fda66'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='128' hash='d0221bf58f875ebc' id='8559ca65'>
