<abi-corpus version='2.1' soname='libspdk_nvmf.so.15.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_accel.so.12.0'/>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_sock.so.8.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libspdk_nvme.so.10.0'/>
    <dependency name='libspdk_thread.so.8.0'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_jsonrpc.so.5.0'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libspdk_trace.so.8.0'/>
    <dependency name='libspdk_bdev.so.12.0'/>
    <dependency name='libspdk_rdma.so.5.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_abort_cmd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_ctrlr_abort_aer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_ctrlr_async_event_error_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_nvmf_tgt_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_find_subsystem' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_get_transport' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_listen_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_new_qpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_pause_polling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_resume_polling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_stop_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_create_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_get_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_get_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_stop_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_stop_listen_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='ctrlr.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='2048' id='93b898c4'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='168' id='aa4d6a5a'>
      <subrange length='21' type-id='f0981eeb' id='01cc7eb2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' id='ca634421'>
      <subrange length='224' type-id='f0981eeb' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' id='12da2087'>
      <subrange length='33' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='328' id='32c6a1ac'>
      <subrange length='41' type-id='f0981eeb' id='cb834f44'/>
    </array-type-def>
    <enum-decl name='spdk_dif_type' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_json_val_type' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_ana_state' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_async_event_info_error' id='93b0ae67'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_WRITE_INVALID_DB' value='0'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_INVALID_DB_WRITE' value='1'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_DIAGNOSTIC_FAILURE' value='2'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_PERSISTENT_INTERNAL' value='3'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_TRANSIENT_INTERNAL' value='4'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_FW_IMAGE_LOAD' value='5'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_csi' id='fac3fed3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CSI_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CSI_KV' value='1'/>
      <enumerator name='SPDK_NVME_CSI_ZNS' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_type' id='bf8dc671'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_WRITE_EXCLUSIVE' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS' value='2'/>
      <enumerator name='SPDK_NVME_RESERVE_WRITE_EXCLUSIVE_REG_ONLY' value='3'/>
      <enumerator name='SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS_REG_ONLY' value='4'/>
      <enumerator name='SPDK_NVME_RESERVE_WRITE_EXCLUSIVE_ALL_REGS' value='5'/>
      <enumerator name='SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS_ALL_REGS' value='6'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_qpair_state' id='a7e1ea9e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_QPAIR_UNINITIALIZED' value='0'/>
      <enumerator name='SPDK_NVMF_QPAIR_ACTIVE' value='1'/>
      <enumerator name='SPDK_NVMF_QPAIR_DEACTIVATING' value='2'/>
      <enumerator name='SPDK_NVMF_QPAIR_ERROR' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_subsystem_state' id='f22d35ca'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_INACTIVE' value='0'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_ACTIVATING' value='1'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_ACTIVE' value='2'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_PAUSING' value='3'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_PAUSED' value='4'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_RESUMING' value='5'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_DEACTIVATING' value='6'/>
      <enumerator name='SPDK_NVMF_SUBSYSTEM_NUM_STATES' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_subtype' id='6b55363d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_SUBTYPE_DISCOVERY' value='1'/>
      <enumerator name='SPDK_NVMF_SUBTYPE_NVME' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_tgt_discovery_filter' id='54074f88'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_TGT_DISCOVERY_MATCH_ANY' value='0'/>
      <enumerator name='SPDK_NVMF_TGT_DISCOVERY_MATCH_TRANSPORT_TYPE' value='1'/>
      <enumerator name='SPDK_NVMF_TGT_DISCOVERY_MATCH_TRANSPORT_ADDRESS' value='2'/>
      <enumerator name='SPDK_NVMF_TGT_DISCOVERY_MATCH_TRANSPORT_SVCID' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_tgt_state' id='4e3c5b86'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NVMF_TGT_IDLE' value='0'/>
      <enumerator name='NVMF_TGT_RUNNING' value='1'/>
      <enumerator name='NVMF_TGT_PAUSING' value='2'/>
      <enumerator name='NVMF_TGT_PAUSED' value='3'/>
      <enumerator name='NVMF_TGT_RESUMING' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_zcopy_phase' id='5dbcddfc'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NVMF_ZCOPY_PHASE_NONE' value='0'/>
      <enumerator name='NVMF_ZCOPY_PHASE_INIT' value='1'/>
      <enumerator name='NVMF_ZCOPY_PHASE_EXECUTE' value='2'/>
      <enumerator name='NVMF_ZCOPY_PHASE_END_PENDING' value='3'/>
      <enumerator name='NVMF_ZCOPY_PHASE_COMPLETE' value='4'/>
      <enumerator name='NVMF_ZCOPY_PHASE_INIT_FAILED' value='5'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' id='d0740e9b'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' id='3a071e7d'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4224' id='8caeb6eb'>
      <subrange length='33' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b39d579c' size-in-bits='8192' id='08ba5752'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' id='bf64ebc5'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='5f953c61' size-in-bits='256' id='4f5ea9a9'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='429c70d3' size-in-bits='2048' id='ebf20746'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='log_page_head' size-in-bits='128' is-struct='yes' visibility='default' id='b4e084ac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='bee07f43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='e468924b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx' size-in-bits='384' is-struct='yes' visibility='default' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_guard' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='guard_seed' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer' size-in-bits='64' is-struct='yes' visibility='default' id='9321bf74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stailq' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='306e7691' visibility='default' id='79110b08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='136d6f32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ad45e2c8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_channel' size-in-bits='896' is-struct='yes' visibility='default' id='e8e2ad7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small' type-id='88eba988' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='large' type-id='88eba988' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parent' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' size-in-bits='192' is-struct='yes' visibility='default' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='da6a25d9' visibility='default' id='ce92b0c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='29210180' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='68f59e9e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool' size-in-bits='384' is-struct='yes' visibility='default' id='88eba988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='b2192338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='306e7691' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cache_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue' type-id='49599bfc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_ctratt' size-in-bits='32' is-struct='yes' visibility='default' id='b65f54af'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' size-in-bits='16' is-struct='yes' visibility='default' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' size-in-bits='2048' is-struct='yes' visibility='default' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' size-in-bits='16' is-struct='yes' visibility='default' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' size-in-bits='32' is-struct='yes' visibility='default' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' size-in-bits='16' is-struct='yes' visibility='default' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' size-in-bits='32' is-struct='yes' visibility='default' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' size-in-bits='128' is-struct='yes' visibility='default' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' size-in-bits='32768' is-struct='yes' visibility='default' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='b65f54af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f7c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' size-in-bits='32768' is-struct='yes' visibility='default' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43f88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43f8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43f8b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43f8c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43f8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_list' size-in-bits='32768' is-struct='yes' visibility='default' id='e22065d9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_list' type-id='e7530dc2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' size-in-bits='256' is-struct='yes' visibility='default' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_reservation_notification_log' size-in-bits='512' is-struct='yes' visibility='default' id='db23eaba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='log_page_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='num_avail_log_pages' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved' type-id='0f4b9e74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reserved1' type-id='17beb8d0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab59f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' size-in-bits='16' is-struct='yes' visibility='default' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_tcp_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' id='6d63b4d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sectype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='629227c2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' size-in-bits='4512' is-struct='yes' visibility='default' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_async_event_completion' size-in-bits='128' is-struct='yes' visibility='default' id='93077b9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='b39d579c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f8e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_capsule_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='8c27fb80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fabric_specific' type-id='014804d6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr' size-in-bits='39360' is-struct='yes' visibility='default' id='dde78329'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='subsys' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='cdata' type-id='76e51992' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='vcprop' type-id='d5e31df6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='feat' type-id='a2cb797e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='admin_qpair' type-id='fedf937b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='qpair_mask' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='listener' type-id='aac072c1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='aer_req' type-id='4f5ea9a9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='async_events' type-id='e7f43f8f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='notice_aen_mask' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='nr_aer_reqs' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5512'>
        <var-decl name='hostid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5664'>
        <var-decl name='association_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='changed_ns_list_count' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5728'>
        <var-decl name='changed_ns_list' type-id='e22065d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38528'>
        <var-decl name='log_page_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38592'>
        <var-decl name='num_avail_log_pages' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38656'>
        <var-decl name='log_head' type-id='b4e084ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38784'>
        <var-decl name='last_keep_alive_tick' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38848'>
        <var-decl name='keep_alive_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38912'>
        <var-decl name='association_timer' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='38976'>
        <var-decl name='cc_timer' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39040'>
        <var-decl name='cc_timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39104'>
        <var-decl name='cc_timeout_timer' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39168'>
        <var-decl name='dif_insert_or_strip' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39176'>
        <var-decl name='in_destruct' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39184'>
        <var-decl name='disconnect_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39192'>
        <var-decl name='disconnect_is_shn' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39200'>
        <var-decl name='acre_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39208'>
        <var-decl name='dynamic_ctrlr' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='39232'>
        <var-decl name='link' type-id='e7f43f90' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_data' size-in-bits='2240' is-struct='yes' visibility='default' id='76e51992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aerl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='kas' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_feat' size-in-bits='320' is-struct='yes' visibility='default' id='a2cb797e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arbitration' type-id='9f1a58c0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='power_management' type-id='64feb306' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error_recovery' type-id='af85b2af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='volatile_write_cache' type-id='c6a65caa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='number_of_queues' type-id='59e17753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='interrupt_coalescing' type-id='4694c65f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interrupt_vector_configuration' type-id='505edc3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='write_atomicity' type-id='ccc4bc8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='async_event_configuration' type-id='8a1225db' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='keep_alive_timer' type-id='47966266' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_migr_data' size-in-bits='32768' is-struct='yes' visibility='default' id='2b5c05b2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='regs_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='feat_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='regs' type-id='d5e31df6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='regs_reserved' type-id='af0d923d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='feat' type-id='a2cb797e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='feat_reserved' type-id='af0d923d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='acre' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='num_aer_cids' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='num_async_events' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='async_events' type-id='08ba5752' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='aer_cids' type-id='453ce391' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='notice_aen_mask' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='unused' type-id='7d6f480a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_dif_info' size-in-bits='448' is-struct='yes' visibility='default' id='1e55cf88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dif_ctx' type-id='6e011169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='elba_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='orig_length' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page_entry' size-in-bits='8192' is-struct='yes' visibility='default' id='6b40ccf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='adrfam' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='treq' type-id='e7f43f91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='portid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='asqsz' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='3d43e61c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trsvcid' type-id='d0f1c0cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reserved1' type-id='f3fa1b1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subnqn' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='traddr' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='tsas' type-id='e874a69d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='8fb0506b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recfmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='qid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='sqsize' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='cattr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='376'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kato' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved4' type-id='fa8ef949' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_rsp' size-in-bits='128' is-struct='yes' visibility='default' id='c9fa5b46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status_code_specific' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='7876bfd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved3' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_rsp' size-in-bits='128' is-struct='yes' visibility='default' id='d0bd555e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_set_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='fd1dedf7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved1' type-id='d0ef8234' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved2' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='value' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reserved4' type-id='13339fda' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_host' size-in-bits='1920' is-struct='yes' visibility='default' id='431afefa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='link' type-id='e7f43f93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listen_opts' size-in-bits='136' is-struct='yes' visibility='default' id='ac930882'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='secure_channel' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listener' size-in-bits='4672' is-struct='yes' visibility='default' id='d5c9cd10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trid' type-id='8712472c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='link' type-id='e7f43f94' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ns' size-in-bits='1280' is-struct='yes' visibility='default' id='9ebe04f3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subsystem' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='opts' type-id='f4e8c8a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='mask' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='gen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='registrants' type-id='e7f43f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='crkey' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='rtype' type-id='bf8dc671' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='holder' type-id='fff4627d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='ptpl_file' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='ptpl_activated' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1224'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='csi' type-id='fac3fed3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ns_opts' size-in-bits='512' is-struct='yes' visibility='default' id='f4e8c8a2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='eui64' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='reserved44' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='reserved60' type-id='d351502e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group' size-in-bits='1408' is-struct='yes' visibility='default' id='5f432901'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tgroups' type-id='e7f43f96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sgroups' type-id='ae6a5885' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_sgroups' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='current_unassociated_qpairs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='qpairs' type-id='e7f43f97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stat' type-id='cb344050' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='destroy_cb_fn' type-id='c58e4e5b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destroy_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='link' type-id='e7f43f98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group_stat' size-in-bits='256' is-struct='yes' visibility='default' id='cb344050'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='admin_qpairs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_qpairs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_admin_qpairs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='current_io_qpairs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_bdev_io' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='completed_nvme_io' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_qpair' size-in-bits='768' is-struct='yes' visibility='default' id='407d526b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='a7e1ea9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='state_cb' type-id='bafe66ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='state_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='transport' type-id='8003131d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctrlr' type-id='ba88e9a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='group' type-id='58736969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='qid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='sq_head' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='sq_head_max' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='432'>
        <var-decl name='connect_received' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='440'>
        <var-decl name='disconnect_started' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='outstanding' type-id='e7f43f99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='link' type-id='e7f43f9a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_rdma_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' id='210ab761'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdma_qptype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rdma_prtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rdma_cms' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved0' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rdma_pkey' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved2' type-id='d05e5752' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_registers' size-in-bits='320' is-struct='yes' visibility='default' id='d5e31df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cap' type-id='007005ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vs' type-id='900beaa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cc' type-id='f0fcbcb4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='csts' type-id='f62d2dc3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='aqa' type-id='d22b9869' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='asq' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acq' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_registrant' size-in-bits='320' is-struct='yes' visibility='default' id='5ce921dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='e7f43f9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hostid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rkey' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_request' size-in-bits='6080' is-struct='yes' visibility='default' id='5507fe79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qpair' type-id='fedf937b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='xfer' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='data_from_pool' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cmd' type-id='b520ce9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rsp' type-id='adfda87a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buf_link' type-id='e7f43f9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='stripped_data' type-id='edc76902' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='dif' type-id='1e55cf88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5248'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='cmd_cb_fn' type-id='e4580111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5632'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5696'>
        <var-decl name='req_to_abort' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5760'>
        <var-decl name='poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='zcopy_bdev_io' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='zcopy_phase' type-id='5dbcddfc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='link' type-id='e7f43f9d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_reservation_log' size-in-bits='704' is-struct='yes' visibility='default' id='2b05a643'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='log' type-id='db23eaba' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link' type-id='e7f43f9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ctrlr' type-id='ba88e9a1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_stripped_data' size-in-bits='4288' is-struct='yes' visibility='default' id='b954fee4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_subsystem' size-in-bits='4096' is-struct='yes' visibility='default' id='16ee3ce3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='state' type-id='f22d35ca' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='subtype' type-id='6b55363d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='next_cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='flags' type-id='e7f43f9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='changing_state' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='destroying' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='async_destroy' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='zone_append_supported' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_zone_append_size_kib' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='link' type-id='e7f43fa0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ns' type-id='3431b25b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='min_cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='688'>
        <var-decl name='max_cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctrlrs' type-id='e7f43fa1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='hosts' type-id='e7f43fa2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='listeners' type-id='e7f43fa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='used_listener_ids' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='entries' type-id='e7f43fa4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='async_destroy_cb' type-id='9f45345a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='async_destroy_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='sn' type-id='aa4d6a5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1896'>
        <var-decl name='mn' type-id='32c6a1ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2224'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='ana_group' type-id='90421557' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_subsystem_listener' size-in-bits='640' is-struct='yes' visibility='default' id='44c819c4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='subsystem' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='896f998c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='trid' type-id='6f56757a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transport' type-id='8003131d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ana_state' type-id='675901dd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ana_state_change_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='link' type-id='e7f43fa5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_subsystem_pg_ns_info' size-in-bits='2688' is-struct='yes' visibility='default' id='101150e6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='channel' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='crkey' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rtype' type-id='bf8dc671' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='holder_id' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reg_hostid' type-id='ebf20746' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='io_outstanding' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='state' type-id='f22d35ca' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_subsystem_poll_group' size-in-bits='448' is-struct='yes' visibility='default' id='e1824565'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_info' type-id='384af0dc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_ns' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='state' type-id='f22d35ca' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mgmt_io_outstanding' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_fn' type-id='9f7f0874' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='queued' type-id='e7f43f99' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_tgt' size-in-bits='3328' is-struct='yes' visibility='default' id='d37dc7a7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='discovery_genctr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='max_subsystems' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='discovery_filter' type-id='54074f88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='state' type-id='4e3c5b86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='subsystem_ids' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='subsystems' type-id='5bc38ed9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='transports' type-id='e7f43fa6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='poll_groups' type-id='e7f43fa7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='next_poll_group' type-id='58736969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='destroy_cb_fn' type-id='e7fd0cfe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='destroy_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='crdt' type-id='45439f56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3184'>
        <var-decl name='num_poll_groups' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='link' type-id='e7f43fa8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport' size-in-bits='1536' is-struct='yes' visibility='default' id='d59a222d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='2d76de85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts' type-id='72315d04' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='iobuf_name' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='listeners' type-id='e7f43fa9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='link' type-id='e7f43faa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_ops' size-in-bits='2176' is-struct='yes' visibility='default' id='c0085c66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='16dc656a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='type' type-id='8cd337c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='opts_init' type-id='f222e253' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='3dde76d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='create_async' type-id='12bf7de7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dump_opts' type-id='7922c62f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='destroy' type-id='ceef4cae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='listen' type-id='f01c8a66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='listen_dump_opts' type-id='8ccb9707' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='stop_listen' type-id='b8ede514' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='listen_associate' type-id='77cfe0ca' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='subsystem_add_ns' type-id='530e6910' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='subsystem_remove_ns' type-id='22c3e229' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cdata_init' type-id='fd2aed57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listener_discover' type-id='342be2de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='poll_group_create' type-id='d694a330' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_optimal_poll_group' type-id='5c292582' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='poll_group_destroy' type-id='001bdd7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='poll_group_add' type-id='dff5464f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='poll_group_remove' type-id='dff5464f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='poll_group_poll' type-id='37da45cd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='req_free' type-id='6e317635' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='req_complete' type-id='6e317635' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='qpair_fini' type-id='75e71b91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='qpair_get_peer_trid' type-id='0b42b28e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='qpair_get_local_trid' type-id='0b42b28e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='qpair_get_listen_trid' type-id='0b42b28e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='qpair_abort_request' type-id='954ab8fe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='poll_group_dump_stat' type-id='d83cf1e9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subsystem_add_host' type-id='74fade65' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='subsystem_remove_host' type-id='63e99c4a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_opts' size-in-bits='512' is-struct='yes' visibility='default' id='72315d04'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_queue_depth' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_qpairs_per_ctrlr' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='in_capsule_data_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_io_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='io_unit_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_aq_depth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_shared_buffers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dif_insert_or_strip' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='reserved29' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='abort_timeout_sec' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='association_timeout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='acceptor_poll_rate' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='reserved61' type-id='d3490169' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_poll_group' size-in-bits='1280' is-struct='yes' visibility='default' id='824683eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='transport' type-id='8003131d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_buf_queue' type-id='e7f43fab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache' type-id='e8e2ad7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='group' type-id='58736969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='link' type-id='e7f43fac' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab5a3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='subsystem_tree' size-in-bits='64' is-struct='yes' visibility='default' id='5bc38ed9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='777df243' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__93' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='136d6f32' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='e8bc3528' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='e8bc3528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='62477226' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ba88e9a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='3087a5d1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='ba88e9a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3087a5d1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f90c7bb8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a0a686d6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f90c7bb8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a0a686d6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='28c64746' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9c226f04' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='28c64746' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9c226f04' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='58736969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='80aeb479' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='58736969' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='80aeb479' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='fedf937b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8af4e883' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='fedf937b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='8af4e883' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='fff4627d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='44b6cef5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='fff4627d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='44b6cef5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__92' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5f953c61' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='c2edea11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__94' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2edea11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c2edea11' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='bee07f43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='e468924b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='777df243' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='777df243' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='84449b4b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='8cf29432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='f9df21c8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='8cf29432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='f9df21c8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='690b38cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='41aa907f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='8003131d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='bbd73f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='8003131d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='bbd73f95' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='264c437b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9b0df883' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='264c437b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9b0df883' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__90' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='authreq' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__112' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__91' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipo' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iattr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__105' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='asqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='acqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='async_event_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='async_event_info' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='log_page_identifier' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__106' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__72' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__80' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__84' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__85' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__82' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__87' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='low' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='high' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__68' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__123' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__83' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__75' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__69' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__71' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__70' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__81' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__79' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__67' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__78' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__66' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='allow_any_host' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='allow_any_listener' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__107' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__118' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__115' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__114' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__110' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__108' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__95' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__100' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__103' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__96' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__104' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__120' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__119' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__116' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__117' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__111' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__121' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secure_channel' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__86' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__99' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__98' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__101' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__102' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__113' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__97' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__122' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='nvmf_subsystem_destroy_cb' type-id='b7f9d8e6' id='9f45345a'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' id='065af103'/>
    <typedef-decl name='spdk_iobuf_buffer_stailq_t' type-id='79110b08' id='306e7691'/>
    <typedef-decl name='spdk_iobuf_entry_stailq_t' type-id='ce92b0c6' id='da6a25d9'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='fa35b1b9' id='8b006695'/>
    <typedef-decl name='spdk_nvmf_custom_cmd_hdlr' type-id='6e317635' id='04b256a8'/>
    <typedef-decl name='spdk_nvmf_nvme_passthru_cmd_cb' type-id='195c95d4' id='e4580111'/>
    <typedef-decl name='spdk_nvmf_poll_group_destroy_done_fn' type-id='1ed1e4cd' id='c58e4e5b'/>
    <typedef-decl name='spdk_nvmf_poll_group_mod_done' type-id='1ed1e4cd' id='9f7f0874'/>
    <typedef-decl name='spdk_nvmf_state_change_done' type-id='1ed1e4cd' id='bafe66ec'/>
    <typedef-decl name='spdk_nvmf_tgt_destroy_done_fn' type-id='2922fb19' id='50edf907'/>
    <typedef-decl name='spdk_nvmf_tgt_subsystem_listen_done_fn' type-id='1ed1e4cd' id='896f998c'/>
    <typedef-decl name='spdk_nvmf_transport_create_done_cb' type-id='b3aa21a2' id='f5dcf84c'/>
    <typedef-decl name='spdk_nvmf_transport_destroy_done_cb' type-id='b7f9d8e6' id='4d534154'/>
    <typedef-decl name='spdk_nvmf_transport_qpair_fini_cb' type-id='b7f9d8e6' id='f3756df1'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' id='45439f56'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='64' id='453ce391'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='32768' id='e7530dc2'>
      <subrange length='1024' type-id='f0981eeb' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' id='25518ee9'>
      <subrange length='1024' type-id='f0981eeb' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' id='b68a110f'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' id='1acf0601'>
      <subrange length='119' type-id='f0981eeb' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' id='ba8c55f2'>
      <subrange length='11' type-id='f0981eeb' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='96' id='fa8ef949'>
      <subrange length='12' type-id='f0981eeb' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1536' id='f3fa1b1a'>
      <subrange length='192' type-id='f0981eeb' id='3fea28a9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='152' id='ba78ce3a'>
      <subrange length='19' type-id='f0981eeb' id='448ee30f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' id='d8dd2858'>
      <subrange length='204' type-id='f0981eeb' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1728' id='af0d923d'>
      <subrange length='216' type-id='f0981eeb' id='83ad04be'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='176' id='3d43e61c'>
      <subrange length='22' type-id='f0981eeb' id='41cf2209'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' id='90687fee'>
      <subrange length='242' type-id='f0981eeb' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1968' id='d05e5752'>
      <subrange length='246' type-id='f0981eeb' id='ca576a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' id='014804d6'>
      <subrange length='24' type-id='f0981eeb' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='20128' id='7d6f480a'>
      <subrange length='2516' type-id='f0981eeb' id='2e214a33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2040' id='629227c2'>
      <subrange length='255' type-id='f0981eeb' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='280' id='d0ef8234'>
      <subrange length='35' type-id='f0981eeb' id='6e6845b5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' id='74b3417b'>
      <subrange length='3712' type-id='f0981eeb' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='384' id='17beb8d0'>
      <subrange length='48' type-id='f0981eeb' id='8f6d2a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='f0981eeb' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' id='be0fa24b'>
      <subrange length='768' type-id='f0981eeb' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' id='cf30f637'>
      <subrange length='9' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <union-decl name='nvmf_c2h_msg' size-in-bits='128' visibility='default' id='1727cb29'>
      <data-member access='public'>
        <var-decl name='nvme_cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_rsp' type-id='d0bd555e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_rsp' type-id='c9fa5b46' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='nvmf_h2c_msg' size-in-bits='512' visibility='default' id='b4148a2d'>
      <data-member access='public'>
        <var-decl name='nvmf_cmd' type-id='8c27fb80' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_cmd' type-id='a0e8c12d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_set_cmd' type-id='fd1dedf7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_cmd' type-id='7876bfd3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_cmd' type-id='8fb0506b' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_aqa_register' size-in-bits='32' visibility='default' id='d22b9869'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_async_event_completion' size-in-bits='32' visibility='default' id='b39d579c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' size-in-bits='64' visibility='default' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc7' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' size-in-bits='32' visibility='default' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb9' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fb4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fc4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fdc' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43fcb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fd4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fd5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fbf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fbe' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fdb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fdb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fc9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fd9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fda' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fd6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fc6' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fce' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fd0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fcf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43fb7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fcd' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43fb8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fc0' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' size-in-bits='32' visibility='default' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fc8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe4' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' size-in-bits='32' visibility='default' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd7' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fad' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdf' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' size-in-bits='32' visibility='default' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fba' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' size-in-bits='32' visibility='default' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbc' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' size-in-bits='32' visibility='default' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' size-in-bits='32' visibility='default' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbb' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fde' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fcc' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fca' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd8' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe0' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb6' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' size-in-bits='32' visibility='default' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvmf_transport_specific_address_subtype' size-in-bits='2048' visibility='default' id='e874a69d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rdma' type-id='210ab761' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tcp' type-id='6d63b4d7' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab5a2'>
      <data-member access='public'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_req' type-id='5f953c61' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__10' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='success' type-id='e7f43fae' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='invalid' type-id='e7f43faf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fe3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__14' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43fe6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fe8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43fc3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fe2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__12' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb0' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='status_raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='status' type-id='38ef35c9' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__13' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb5' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='u64' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='e7f43fc5' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__11' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe5' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__15' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe7' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab5a3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <qualified-type-def type-id='8712472c' const='yes' id='ee6bba01'/>
    <pointer-type-def type-id='ee6bba01' size-in-bits='64' id='7e9611b1'/>
    <qualified-type-def type-id='2b5c05b2' const='yes' id='04246875'/>
    <pointer-type-def type-id='04246875' size-in-bits='64' id='e4504d8d'/>
    <qualified-type-def type-id='d5e31df6' const='yes' id='eae0cbf5'/>
    <pointer-type-def type-id='eae0cbf5' size-in-bits='64' id='9ee0f00d'/>
    <qualified-type-def type-id='16ee3ce3' const='yes' id='ffac22f8'/>
    <pointer-type-def type-id='ffac22f8' size-in-bits='64' id='4dfad096'/>
    <qualified-type-def type-id='44c819c4' const='yes' id='639cbef1'/>
    <pointer-type-def type-id='639cbef1' size-in-bits='64' id='aac072c1'/>
    <qualified-type-def type-id='c0085c66' const='yes' id='3c200ead'/>
    <pointer-type-def type-id='3c200ead' size-in-bits='64' id='2d76de85'/>
    <pointer-type-def type-id='4489eba4' size-in-bits='64' id='0b42b28e'/>
    <pointer-type-def type-id='a42c4329' size-in-bits='64' id='6e317635'/>
    <pointer-type-def type-id='9987fa2c' size-in-bits='64' id='f01c8a66'/>
    <pointer-type-def type-id='a5fa6261' size-in-bits='64' id='74fade65'/>
    <pointer-type-def type-id='779235a8' size-in-bits='64' id='77cfe0ca'/>
    <pointer-type-def type-id='cc261e8e' size-in-bits='64' id='530e6910'/>
    <pointer-type-def type-id='cd1f57d4' size-in-bits='64' id='ceef4cae'/>
    <pointer-type-def type-id='b2f184bb' size-in-bits='64' id='12bf7de7'/>
    <pointer-type-def type-id='3af3b929' size-in-bits='64' id='37da45cd'/>
    <pointer-type-def type-id='f089fe53' size-in-bits='64' id='dff5464f'/>
    <pointer-type-def type-id='1727cb29' size-in-bits='64' id='adfda87a'/>
    <pointer-type-def type-id='b4148a2d' size-in-bits='64' id='b520ce9e'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7b7cfb3d' size-in-bits='64' id='7cbf4535'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='0094857f' size-in-bits='64' id='3ecde4cf'/>
    <pointer-type-def type-id='68ee9836' size-in-bits='64' id='378e9c1c'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='cfe40fb1' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='a7e01876' size-in-bits='64' id='a1c658d4'/>
    <pointer-type-def type-id='9321bf74' size-in-bits='64' id='136d6f32'/>
    <pointer-type-def type-id='136d6f32' size-in-bits='64' id='ad45e2c8'/>
    <pointer-type-def type-id='71e32ba2' size-in-bits='64' id='29210180'/>
    <pointer-type-def type-id='29210180' size-in-bits='64' id='68f59e9e'/>
    <pointer-type-def type-id='da6a25d9' size-in-bits='64' id='49599bfc'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='78649e32' size-in-bits='64' id='675901dd'/>
    <pointer-type-def type-id='a0e8c12d' size-in-bits='64' id='538b928d'/>
    <pointer-type-def type-id='72b49d60' size-in-bits='64' id='25e0c706'/>
    <pointer-type-def type-id='514f4721' size-in-bits='64' id='259d0299'/>
    <pointer-type-def type-id='4e56c4fd' size-in-bits='64' id='4b4afe0d'/>
    <pointer-type-def type-id='8712472c' size-in-bits='64' id='6f56757a'/>
    <pointer-type-def type-id='93077b9a' size-in-bits='64' id='e8bc3528'/>
    <pointer-type-def type-id='e8bc3528' size-in-bits='64' id='62477226'/>
    <pointer-type-def type-id='dde78329' size-in-bits='64' id='ba88e9a1'/>
    <pointer-type-def type-id='ba88e9a1' size-in-bits='64' id='3087a5d1'/>
    <pointer-type-def type-id='76e51992' size-in-bits='64' id='0e5061b0'/>
    <pointer-type-def type-id='2b5c05b2' size-in-bits='64' id='c80b4130'/>
    <pointer-type-def type-id='6b40ccf0' size-in-bits='64' id='11f30736'/>
    <pointer-type-def type-id='431afefa' size-in-bits='64' id='f90c7bb8'/>
    <pointer-type-def type-id='f90c7bb8' size-in-bits='64' id='a0a686d6'/>
    <pointer-type-def type-id='ac930882' size-in-bits='64' id='320252e0'/>
    <pointer-type-def type-id='d5c9cd10' size-in-bits='64' id='28c64746'/>
    <pointer-type-def type-id='28c64746' size-in-bits='64' id='9c226f04'/>
    <pointer-type-def type-id='9ebe04f3' size-in-bits='64' id='53eb2933'/>
    <pointer-type-def type-id='53eb2933' size-in-bits='64' id='3431b25b'/>
    <pointer-type-def type-id='5f432901' size-in-bits='64' id='58736969'/>
    <pointer-type-def type-id='58736969' size-in-bits='64' id='80aeb479'/>
    <pointer-type-def type-id='407d526b' size-in-bits='64' id='fedf937b'/>
    <pointer-type-def type-id='fedf937b' size-in-bits='64' id='8af4e883'/>
    <pointer-type-def type-id='5ce921dd' size-in-bits='64' id='fff4627d'/>
    <pointer-type-def type-id='fff4627d' size-in-bits='64' id='44b6cef5'/>
    <pointer-type-def type-id='5507fe79' size-in-bits='64' id='5f953c61'/>
    <pointer-type-def type-id='5f953c61' size-in-bits='64' id='c2edea11'/>
    <pointer-type-def type-id='2b05a643' size-in-bits='64' id='bee07f43'/>
    <pointer-type-def type-id='bee07f43' size-in-bits='64' id='e468924b'/>
    <pointer-type-def type-id='b954fee4' size-in-bits='64' id='edc76902'/>
    <pointer-type-def type-id='16ee3ce3' size-in-bits='64' id='777df243'/>
    <pointer-type-def type-id='777df243' size-in-bits='64' id='84449b4b'/>
    <pointer-type-def type-id='44c819c4' size-in-bits='64' id='8cf29432'/>
    <pointer-type-def type-id='8cf29432' size-in-bits='64' id='f9df21c8'/>
    <pointer-type-def type-id='101150e6' size-in-bits='64' id='384af0dc'/>
    <pointer-type-def type-id='e1824565' size-in-bits='64' id='ae6a5885'/>
    <pointer-type-def type-id='d37dc7a7' size-in-bits='64' id='690b38cf'/>
    <pointer-type-def type-id='690b38cf' size-in-bits='64' id='41aa907f'/>
    <pointer-type-def type-id='50edf907' size-in-bits='64' id='e7fd0cfe'/>
    <pointer-type-def type-id='d59a222d' size-in-bits='64' id='8003131d'/>
    <pointer-type-def type-id='97c33c25' size-in-bits='64' id='3dde76d9'/>
    <pointer-type-def type-id='8003131d' size-in-bits='64' id='bbd73f95'/>
    <pointer-type-def type-id='72315d04' size-in-bits='64' id='a30dfc92'/>
    <pointer-type-def type-id='824683eb' size-in-bits='64' id='264c437b'/>
    <pointer-type-def type-id='3c502a10' size-in-bits='64' id='5c292582'/>
    <pointer-type-def type-id='4c09e60e' size-in-bits='64' id='d694a330'/>
    <pointer-type-def type-id='264c437b' size-in-bits='64' id='9b0df883'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='84d13285' size-in-bits='64' id='fa35b1b9'/>
    <pointer-type-def type-id='b8ccea9c' size-in-bits='64' id='954ab8fe'/>
    <pointer-type-def type-id='fac56635' size-in-bits='64' id='75e71b91'/>
    <pointer-type-def type-id='77325d92' size-in-bits='64' id='195c95d4'/>
    <pointer-type-def type-id='43668d52' size-in-bits='64' id='b8ede514'/>
    <pointer-type-def type-id='d1f2ad9b' size-in-bits='64' id='8ccb9707'/>
    <pointer-type-def type-id='83beada0' size-in-bits='64' id='63e99c4a'/>
    <pointer-type-def type-id='8fc2c135' size-in-bits='64' id='22c3e229'/>
    <pointer-type-def type-id='f3304d63' size-in-bits='64' id='7922c62f'/>
    <pointer-type-def type-id='ff4798b4' size-in-bits='64' id='342be2de'/>
    <pointer-type-def type-id='7bc19663' size-in-bits='64' id='fd2aed57'/>
    <pointer-type-def type-id='5850dc77' size-in-bits='64' id='f222e253'/>
    <pointer-type-def type-id='daea9dd8' size-in-bits='64' id='001bdd7a'/>
    <pointer-type-def type-id='b937ef65' size-in-bits='64' id='d83cf1e9'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='10befee0' size-in-bits='64' id='b3aa21a2'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454627'/>
    <class-decl name='spdk_bdev_io' is-struct='yes' visibility='default' is-declaration-only='yes' id='68ee9836'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='cfe40fb1'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_nvmf_ctrlr_connect' mangled-name='spdk_nvmf_ctrlr_connect' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_connect'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_get_regs' mangled-name='spdk_nvmf_ctrlr_get_regs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_get_regs'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <return type-id='9ee0f00d'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_save_migr_data' mangled-name='spdk_nvmf_ctrlr_save_migr_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_save_migr_data'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='c80b4130' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_restore_migr_data' mangled-name='spdk_nvmf_ctrlr_restore_migr_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_restore_migr_data'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='e4504d8d' name='data'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_identify_ns' mangled-name='spdk_nvmf_ctrlr_identify_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_identify_ns'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='25e0c706' name='rsp'/>
      <parameter type-id='4b4afe0d' name='nsdata'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_identify_ctrlr' mangled-name='spdk_nvmf_ctrlr_identify_ctrlr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_identify_ctrlr'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='259d0299' name='cdata'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ns_identify_iocs_specific' mangled-name='spdk_nvmf_ns_identify_iocs_specific' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ns_identify_iocs_specific'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='25e0c706' name='rsp'/>
      <parameter type-id='eaa32e2f' name='nsdata'/>
      <parameter type-id='b59d7dce' name='nsdata_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_identify_iocs_specific' mangled-name='spdk_nvmf_ctrlr_identify_iocs_specific' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_identify_iocs_specific'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='25e0c706' name='rsp'/>
      <parameter type-id='eaa32e2f' name='cdata'/>
      <parameter type-id='b59d7dce' name='cdata_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_async_event_error_event' mangled-name='spdk_nvmf_ctrlr_async_event_error_event' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_async_event_error_event'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <parameter type-id='93b0ae67' name='info'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_abort_aer' mangled-name='spdk_nvmf_ctrlr_abort_aer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_abort_aer'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_zcopy_start' mangled-name='spdk_nvmf_request_zcopy_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_zcopy_start'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_zcopy_end' mangled-name='spdk_nvmf_request_zcopy_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_zcopy_end'>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='c894953d' name='commit'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_free' mangled-name='spdk_nvmf_request_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_free'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_complete' mangled-name='spdk_nvmf_request_complete' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_complete'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_exec_fabrics' mangled-name='spdk_nvmf_request_exec_fabrics' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_exec_fabrics'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_exec' mangled-name='spdk_nvmf_request_exec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_exec'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_dif_ctx' mangled-name='spdk_nvmf_request_get_dif_ctx' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_dif_ctx'>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='a3141401' name='dif_ctx'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvmf_set_custom_admin_cmd_hdlr' mangled-name='spdk_nvmf_set_custom_admin_cmd_hdlr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_set_custom_admin_cmd_hdlr'>
      <parameter type-id='b96825af' name='opc'/>
      <parameter type-id='04b256a8' name='hdlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_set_passthru_admin_cmd' mangled-name='spdk_nvmf_set_passthru_admin_cmd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_set_passthru_admin_cmd'>
      <parameter type-id='b96825af' name='opc'/>
      <parameter type-id='8f92235e' name='forward_nsid'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_bdev' mangled-name='spdk_nvmf_request_get_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_bdev'>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='7cbf4535' name='bdev'/>
      <parameter type-id='3ecde4cf' name='desc'/>
      <parameter type-id='a1c658d4' name='ch'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_ctrlr' mangled-name='spdk_nvmf_request_get_ctrlr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_ctrlr'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='ba88e9a1'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_cmd' mangled-name='spdk_nvmf_request_get_cmd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_cmd'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='538b928d'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_response' mangled-name='spdk_nvmf_request_get_response' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_response'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='25e0c706'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_subsystem' mangled-name='spdk_nvmf_request_get_subsystem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_subsystem'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='777df243'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_data' mangled-name='spdk_nvmf_request_get_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_data'>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='63e171df' name='data'/>
      <parameter type-id='90421557' name='length'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_copy_from_buf' mangled-name='spdk_nvmf_request_copy_from_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_copy_from_buf'>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_copy_to_buf' mangled-name='spdk_nvmf_request_copy_to_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_copy_to_buf'>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_get_subsystem' mangled-name='spdk_nvmf_ctrlr_get_subsystem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_get_subsystem'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <return type-id='777df243'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_get_id' mangled-name='spdk_nvmf_ctrlr_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_get_id'>
      <parameter type-id='ba88e9a1' name='ctrlr'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_nvmf_request_get_req_to_abort' mangled-name='spdk_nvmf_request_get_req_to_abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_request_get_req_to_abort'>
      <parameter type-id='5f953c61' name='req'/>
      <return type-id='5f953c61'/>
    </function-decl>
    <function-type size-in-bits='64' id='4489eba4'>
      <parameter type-id='fedf937b'/>
      <parameter type-id='6f56757a'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a42c4329'>
      <parameter type-id='5f953c61'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9987fa2c'>
      <parameter type-id='8003131d'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='320252e0'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a5fa6261'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4dfad096'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='3ee1fff1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='779235a8'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4dfad096'/>
      <parameter type-id='7e9611b1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='cc261e8e'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4dfad096'/>
      <parameter type-id='53eb2933'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='cd1f57d4'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4d534154'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='b2f184bb'>
      <parameter type-id='a30dfc92'/>
      <parameter type-id='f5dcf84c'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='3af3b929'>
      <parameter type-id='264c437b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='f089fe53'>
      <parameter type-id='264c437b'/>
      <parameter type-id='fedf937b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='97c33c25'>
      <parameter type-id='a30dfc92'/>
      <return type-id='8003131d'/>
    </function-type>
    <function-type size-in-bits='64' id='3c502a10'>
      <parameter type-id='fedf937b'/>
      <return type-id='264c437b'/>
    </function-type>
    <function-type size-in-bits='64' id='4c09e60e'>
      <parameter type-id='8003131d'/>
      <parameter type-id='58736969'/>
      <return type-id='264c437b'/>
    </function-type>
    <function-type size-in-bits='64' id='84d13285'>
      <parameter type-id='29210180'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='b8ccea9c'>
      <parameter type-id='fedf937b'/>
      <parameter type-id='5f953c61'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='fac56635'>
      <parameter type-id='fedf937b'/>
      <parameter type-id='f3756df1'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='77325d92'>
      <parameter type-id='5f953c61'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='43668d52'>
      <parameter type-id='8003131d'/>
      <parameter type-id='7e9611b1'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='d1f2ad9b'>
      <parameter type-id='8003131d'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='83beada0'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4dfad096'/>
      <parameter type-id='80f4b756'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='8fc2c135'>
      <parameter type-id='8003131d'/>
      <parameter type-id='4dfad096'/>
      <parameter type-id='8f92235e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f3304d63'>
      <parameter type-id='8003131d'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='ff4798b4'>
      <parameter type-id='8003131d'/>
      <parameter type-id='6f56757a'/>
      <parameter type-id='11f30736'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='7bc19663'>
      <parameter type-id='8003131d'/>
      <parameter type-id='777df243'/>
      <parameter type-id='0e5061b0'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='5850dc77'>
      <parameter type-id='a30dfc92'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='daea9dd8'>
      <parameter type-id='264c437b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='b937ef65'>
      <parameter type-id='264c437b'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='10befee0'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8003131d'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='ctrlr_bdev.c' language='LANG_C99'>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fde'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454628'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c1'/>
    <function-decl name='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin' mangled-name='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='e4580111' name='cb_fn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_bdev_ctrlr_abort_cmd' mangled-name='spdk_nvmf_bdev_ctrlr_abort_cmd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_bdev_ctrlr_abort_cmd'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='5f953c61' name='req'/>
      <parameter type-id='5f953c61' name='req_to_abort'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvmf.c' language='LANG_C99'>
    <class-decl name='spdk_nvmf_target_opts' size-in-bits='2176' is-struct='yes' visibility='default' id='73987b48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='d1617432' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='max_subsystems' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='crdt' type-id='45439f56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='discovery_filter' type-id='54074f88' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvmf_qpair_disconnect_cb' type-id='b7f9d8e6' id='2b8488a2'/>
    <typedef-decl name='spdk_nvmf_tgt_add_transport_done_fn' type-id='1ed1e4cd' id='96982900'/>
    <typedef-decl name='spdk_nvmf_tgt_pause_polling_cb_fn' type-id='1ed1e4cd' id='73fe11ac'/>
    <typedef-decl name='spdk_nvmf_tgt_resume_polling_cb_fn' type-id='1ed1e4cd' id='fc31803b'/>
    <pointer-type-def type-id='73987b48' size-in-bits='64' id='cb0b0f5e'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61989'/>
    <function-decl name='spdk_nvmf_tgt_create' mangled-name='spdk_nvmf_tgt_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_create'>
      <parameter type-id='cb0b0f5e' name='opts'/>
      <return type-id='690b38cf'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_destroy' mangled-name='spdk_nvmf_tgt_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_destroy'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='e7fd0cfe' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_get_name' mangled-name='spdk_nvmf_tgt_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_get_name'>
      <parameter type-id='690b38cf' name='tgt'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvmf_get_tgt' mangled-name='spdk_nvmf_get_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_get_tgt'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='690b38cf'/>
    </function-decl>
    <function-decl name='spdk_nvmf_get_first_tgt' mangled-name='spdk_nvmf_get_first_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_get_first_tgt'>
      <return type-id='690b38cf'/>
    </function-decl>
    <function-decl name='spdk_nvmf_get_next_tgt' mangled-name='spdk_nvmf_get_next_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_get_next_tgt'>
      <parameter type-id='690b38cf' name='prev'/>
      <return type-id='690b38cf'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_write_config_json' mangled-name='spdk_nvmf_tgt_write_config_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_write_config_json'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='690b38cf' name='tgt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_listen_opts_init' mangled-name='spdk_nvmf_listen_opts_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_listen_opts_init'>
      <parameter type-id='320252e0' name='opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_listen_ext' mangled-name='spdk_nvmf_tgt_listen_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_listen_ext'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='7e9611b1' name='trid'/>
      <parameter type-id='320252e0' name='opts'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_stop_listen' mangled-name='spdk_nvmf_tgt_stop_listen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_stop_listen'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='6f56757a' name='trid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_add_transport' mangled-name='spdk_nvmf_tgt_add_transport' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_add_transport'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='8003131d' name='transport'/>
      <parameter type-id='96982900' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_pause_polling' mangled-name='spdk_nvmf_tgt_pause_polling' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_pause_polling'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='73fe11ac' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_resume_polling' mangled-name='spdk_nvmf_tgt_resume_polling' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_resume_polling'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='fc31803b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_find_subsystem' mangled-name='spdk_nvmf_tgt_find_subsystem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_find_subsystem'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='80f4b756' name='subnqn'/>
      <return type-id='777df243'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_get_transport' mangled-name='spdk_nvmf_tgt_get_transport' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_get_transport'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='80f4b756' name='transport_name'/>
      <return type-id='8003131d'/>
    </function-decl>
    <function-decl name='spdk_nvmf_tgt_new_qpair' mangled-name='spdk_nvmf_tgt_new_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_tgt_new_qpair'>
      <parameter type-id='690b38cf' name='tgt'/>
      <parameter type-id='fedf937b' name='qpair'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_poll_group_create' mangled-name='spdk_nvmf_poll_group_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_poll_group_create'>
      <parameter type-id='690b38cf' name='tgt'/>
      <return type-id='58736969'/>
    </function-decl>
    <function-decl name='spdk_nvmf_poll_group_destroy' mangled-name='spdk_nvmf_poll_group_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_poll_group_destroy'>
      <parameter type-id='58736969' name='group'/>
      <parameter type-id='c58e4e5b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_poll_group_add' mangled-name='spdk_nvmf_poll_group_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_poll_group_add'>
      <parameter type-id='58736969' name='group'/>
      <parameter type-id='fedf937b' name='qpair'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_poll_group_remove' mangled-name='spdk_nvmf_poll_group_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_poll_group_remove'>
      <parameter type-id='fedf937b' name='qpair'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvmf_qpair_disconnect' mangled-name='spdk_nvmf_qpair_disconnect' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_qpair_disconnect'>
      <parameter type-id='fedf937b' name='qpair'/>
      <parameter type-id='2b8488a2' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_qpair_get_peer_trid' mangled-name='spdk_nvmf_qpair_get_peer_trid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_qpair_get_peer_trid'>
      <parameter type-id='fedf937b' name='qpair'/>
      <parameter type-id='6f56757a' name='trid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_qpair_get_local_trid' mangled-name='spdk_nvmf_qpair_get_local_trid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_qpair_get_local_trid'>
      <parameter type-id='fedf937b' name='qpair'/>
      <parameter type-id='6f56757a' name='trid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_qpair_get_listen_trid' mangled-name='spdk_nvmf_qpair_get_listen_trid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_qpair_get_listen_trid'>
      <parameter type-id='fedf937b' name='qpair'/>
      <parameter type-id='6f56757a' name='trid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_get_optimal_poll_group' mangled-name='spdk_nvmf_get_optimal_poll_group' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_get_optimal_poll_group'>
      <parameter type-id='fedf937b' name='qpair'/>
      <return type-id='58736969'/>
    </function-decl>
    <function-decl name='spdk_nvmf_poll_group_dump_stat' mangled-name='spdk_nvmf_poll_group_dump_stat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_poll_group_dump_stat'>
      <parameter type-id='58736969' name='group'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rdma.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='384' id='36d7f119'>
      <subrange length='48' type-id='f0981eeb' id='8f6d2a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <enum-decl name='ibv_atomic_cap' id='b830f00a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_ATOMIC_NONE' value='0'/>
      <enumerator name='IBV_ATOMIC_HCA' value='1'/>
      <enumerator name='IBV_ATOMIC_GLOB' value='2'/>
    </enum-decl>
    <enum-decl name='ibv_mw_type' id='1795416d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_MW_TYPE_1' value='1'/>
      <enumerator name='IBV_MW_TYPE_2' value='2'/>
    </enum-decl>
    <enum-decl name='ibv_node_type' id='0267f9f9'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_NODE_UNKNOWN' value='-1'/>
      <enumerator name='IBV_NODE_CA' value='1'/>
      <enumerator name='IBV_NODE_SWITCH' value='2'/>
      <enumerator name='IBV_NODE_ROUTER' value='3'/>
      <enumerator name='IBV_NODE_RNIC' value='4'/>
      <enumerator name='IBV_NODE_USNIC' value='5'/>
      <enumerator name='IBV_NODE_USNIC_UDP' value='6'/>
      <enumerator name='IBV_NODE_UNSPECIFIED' value='7'/>
    </enum-decl>
    <enum-decl name='ibv_qp_state' id='002258df'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_QPS_RESET' value='0'/>
      <enumerator name='IBV_QPS_INIT' value='1'/>
      <enumerator name='IBV_QPS_RTR' value='2'/>
      <enumerator name='IBV_QPS_RTS' value='3'/>
      <enumerator name='IBV_QPS_SQD' value='4'/>
      <enumerator name='IBV_QPS_SQE' value='5'/>
      <enumerator name='IBV_QPS_ERR' value='6'/>
      <enumerator name='IBV_QPS_UNKNOWN' value='7'/>
    </enum-decl>
    <enum-decl name='ibv_qp_type' id='d412ad8a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_QPT_RC' value='2'/>
      <enumerator name='IBV_QPT_UC' value='3'/>
      <enumerator name='IBV_QPT_UD' value='4'/>
      <enumerator name='IBV_QPT_RAW_PACKET' value='8'/>
      <enumerator name='IBV_QPT_XRC_SEND' value='9'/>
      <enumerator name='IBV_QPT_XRC_RECV' value='10'/>
      <enumerator name='IBV_QPT_DRIVER' value='255'/>
    </enum-decl>
    <enum-decl name='ibv_transport_type' id='b31d4ee6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_TRANSPORT_UNKNOWN' value='-1'/>
      <enumerator name='IBV_TRANSPORT_IB' value='0'/>
      <enumerator name='IBV_TRANSPORT_IWARP' value='1'/>
      <enumerator name='IBV_TRANSPORT_USNIC' value='2'/>
      <enumerator name='IBV_TRANSPORT_USNIC_UDP' value='3'/>
      <enumerator name='IBV_TRANSPORT_UNSPECIFIED' value='4'/>
    </enum-decl>
    <enum-decl name='ibv_wc_opcode' id='e20702a5'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WC_SEND' value='0'/>
      <enumerator name='IBV_WC_RDMA_WRITE' value='1'/>
      <enumerator name='IBV_WC_RDMA_READ' value='2'/>
      <enumerator name='IBV_WC_COMP_SWAP' value='3'/>
      <enumerator name='IBV_WC_FETCH_ADD' value='4'/>
      <enumerator name='IBV_WC_BIND_MW' value='5'/>
      <enumerator name='IBV_WC_LOCAL_INV' value='6'/>
      <enumerator name='IBV_WC_TSO' value='7'/>
      <enumerator name='IBV_WC_ATOMIC_WRITE' value='9'/>
      <enumerator name='IBV_WC_RECV' value='128'/>
      <enumerator name='IBV_WC_RECV_RDMA_WITH_IMM' value='129'/>
      <enumerator name='IBV_WC_TM_ADD' value='130'/>
      <enumerator name='IBV_WC_TM_DEL' value='131'/>
      <enumerator name='IBV_WC_TM_SYNC' value='132'/>
      <enumerator name='IBV_WC_TM_RECV' value='133'/>
      <enumerator name='IBV_WC_TM_NO_TAG' value='134'/>
      <enumerator name='IBV_WC_DRIVER1' value='135'/>
      <enumerator name='IBV_WC_DRIVER2' value='136'/>
      <enumerator name='IBV_WC_DRIVER3' value='137'/>
    </enum-decl>
    <enum-decl name='ibv_wc_status' id='f7f54079'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WC_SUCCESS' value='0'/>
      <enumerator name='IBV_WC_LOC_LEN_ERR' value='1'/>
      <enumerator name='IBV_WC_LOC_QP_OP_ERR' value='2'/>
      <enumerator name='IBV_WC_LOC_EEC_OP_ERR' value='3'/>
      <enumerator name='IBV_WC_LOC_PROT_ERR' value='4'/>
      <enumerator name='IBV_WC_WR_FLUSH_ERR' value='5'/>
      <enumerator name='IBV_WC_MW_BIND_ERR' value='6'/>
      <enumerator name='IBV_WC_BAD_RESP_ERR' value='7'/>
      <enumerator name='IBV_WC_LOC_ACCESS_ERR' value='8'/>
      <enumerator name='IBV_WC_REM_INV_REQ_ERR' value='9'/>
      <enumerator name='IBV_WC_REM_ACCESS_ERR' value='10'/>
      <enumerator name='IBV_WC_REM_OP_ERR' value='11'/>
      <enumerator name='IBV_WC_RETRY_EXC_ERR' value='12'/>
      <enumerator name='IBV_WC_RNR_RETRY_EXC_ERR' value='13'/>
      <enumerator name='IBV_WC_LOC_RDD_VIOL_ERR' value='14'/>
      <enumerator name='IBV_WC_REM_INV_RD_REQ_ERR' value='15'/>
      <enumerator name='IBV_WC_REM_ABORT_ERR' value='16'/>
      <enumerator name='IBV_WC_INV_EECN_ERR' value='17'/>
      <enumerator name='IBV_WC_INV_EEC_STATE_ERR' value='18'/>
      <enumerator name='IBV_WC_FATAL_ERR' value='19'/>
      <enumerator name='IBV_WC_RESP_TIMEOUT_ERR' value='20'/>
      <enumerator name='IBV_WC_GENERAL_ERR' value='21'/>
      <enumerator name='IBV_WC_TM_ERR' value='22'/>
      <enumerator name='IBV_WC_TM_RNDV_INCOMPLETE' value='23'/>
    </enum-decl>
    <enum-decl name='ibv_wr_opcode' id='e884e4f8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IBV_WR_RDMA_WRITE' value='0'/>
      <enumerator name='IBV_WR_RDMA_WRITE_WITH_IMM' value='1'/>
      <enumerator name='IBV_WR_SEND' value='2'/>
      <enumerator name='IBV_WR_SEND_WITH_IMM' value='3'/>
      <enumerator name='IBV_WR_RDMA_READ' value='4'/>
      <enumerator name='IBV_WR_ATOMIC_CMP_AND_SWP' value='5'/>
      <enumerator name='IBV_WR_ATOMIC_FETCH_AND_ADD' value='6'/>
      <enumerator name='IBV_WR_LOCAL_INV' value='7'/>
      <enumerator name='IBV_WR_BIND_MW' value='8'/>
      <enumerator name='IBV_WR_SEND_WITH_INV' value='9'/>
      <enumerator name='IBV_WR_TSO' value='10'/>
      <enumerator name='IBV_WR_DRIVER1' value='11'/>
      <enumerator name='IBV_WR_ATOMIC_WRITE' value='15'/>
    </enum-decl>
    <type-decl name='long long int' size-in-bits='64' id='95e97e61'/>
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' id='c987b47c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__wseq' type-id='f3b40860' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__g1_start' type-id='f3b40860' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__g_refs' type-id='0d532ec1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__g_size' type-id='0d532ec1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__g1_orig_size' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__wrefs' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__g_signals' type-id='0d532ec1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_ibv_device_ops' size-in-bits='128' is-struct='yes' visibility='default' id='f904f53f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_dummy1' type-id='d9aecf18' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_dummy2' type-id='5012362f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_ah' size-in-bits='192' is-struct='yes' visibility='default' id='37442b88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pd' type-id='18028d25' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='handle' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_comp_channel' size-in-bits='128' is-struct='yes' visibility='default' id='7ef9d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='context' type-id='1aaec10e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='refcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_context' size-in-bits='2624' is-struct='yes' visibility='default' id='47b432f8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='device' type-id='e658b277' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='f348463b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='cmd_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='async_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='num_comp_vectors' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='abi_compat' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ibv_context_ops' size-in-bits='2048' is-struct='yes' visibility='default' id='f348463b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_compat_query_device' type-id='019520e8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_compat_query_port' type-id='decd28c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_compat_alloc_pd' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_compat_dealloc_pd' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_compat_reg_mr' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_compat_rereg_mr' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_compat_dereg_mr' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='alloc_mw' type-id='36c08ce2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='bind_mw' type-id='68f1eb1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='dealloc_mw' type-id='65518f37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_compat_create_cq' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='poll_cq' type-id='665febdc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='req_notify_cq' type-id='ea9cdcc6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_compat_cq_event' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_compat_resize_cq' type-id='0cfacb48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_compat_destroy_cq' type-id='0cfacb48' visibility='default'/>
