<abi-corpus version='2.1' soname='libspdk_vfio_user.so.4.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vfio_user_dev_send_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfio_user_get_bar_addr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfio_user_pci_bar_access' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfio_user_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vfio_user_setup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='vfio_user_pci.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='f0981eeb' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <enum-decl name='vfio_user_command' id='86ce2b6c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VFIO_USER_VERSION' value='1'/>
      <enumerator name='VFIO_USER_DMA_MAP' value='2'/>
      <enumerator name='VFIO_USER_DMA_UNMAP' value='3'/>
      <enumerator name='VFIO_USER_DEVICE_GET_INFO' value='4'/>
      <enumerator name='VFIO_USER_DEVICE_GET_REGION_INFO' value='5'/>
      <enumerator name='VFIO_USER_DEVICE_GET_REGION_IO_FDS' value='6'/>
      <enumerator name='VFIO_USER_DEVICE_GET_IRQ_INFO' value='7'/>
      <enumerator name='VFIO_USER_DEVICE_SET_IRQS' value='8'/>
      <enumerator name='VFIO_USER_REGION_READ' value='9'/>
      <enumerator name='VFIO_USER_REGION_WRITE' value='10'/>
      <enumerator name='VFIO_USER_DMA_READ' value='11'/>
      <enumerator name='VFIO_USER_DMA_WRITE' value='12'/>
      <enumerator name='VFIO_USER_DEVICE_RESET' value='13'/>
      <enumerator name='VFIO_USER_DIRTY_PAGES' value='14'/>
      <enumerator name='VFIO_USER_MAX' value='15'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='vfio_device' size-in-bits='51776' is-struct='yes' visibility='default' id='5a7c091c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='path' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33344'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33472'>
        <var-decl name='pci_regions' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33536'>
        <var-decl name='regions' type-id='649e6a78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51456'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51520'>
        <var-decl name='map' type-id='73c19462' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51584'>
        <var-decl name='mrs_head' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51712'>
        <var-decl name='nr_mrs' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vfio_memory_region' size-in-bits='448' is-struct='yes' visibility='default' id='eef2886a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iova' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vaddr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vfio_pci_region' size-in-bits='1792' is-struct='yes' visibility='default' id='60ef8097'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nr_mmaps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmaps' type-id='4e3a4d99' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vfio_sparse_mmaps' size-in-bits='192' is-struct='yes' visibility='default' id='e0318a55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mem' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='30b05d2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a5a26700' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='9f9e2e68' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8802d1e6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='9f9e2e68' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='8802d1e6' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <array-type-def dimensions='1' type-id='60ef8097' size-in-bits='17920' id='649e6a78'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e0318a55' size-in-bits='1536' id='4e3a4d99'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='ba933a44' size-in-bits='64' id='73c19462'/>
    <pointer-type-def type-id='5a7c091c' size-in-bits='64' id='30b05d2a'/>
    <pointer-type-def type-id='30b05d2a' size-in-bits='64' id='a5a26700'/>
    <pointer-type-def type-id='eef2886a' size-in-bits='64' id='9f9e2e68'/>
    <pointer-type-def type-id='9f9e2e68' size-in-bits='64' id='8802d1e6'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_mem_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='ba933a44'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_vfio_user_pci_bar_access' mangled-name='spdk_vfio_user_pci_bar_access' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfio_user_pci_bar_access'>
      <parameter type-id='30b05d2a' name='dev'/>
      <parameter type-id='8f92235e' name='index'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='c894953d' name='is_write'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vfio_user_setup' mangled-name='spdk_vfio_user_setup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfio_user_setup'>
      <parameter type-id='80f4b756' name='path'/>
      <return type-id='30b05d2a'/>
    </function-decl>
    <function-decl name='spdk_vfio_user_release' mangled-name='spdk_vfio_user_release' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfio_user_release'>
      <parameter type-id='30b05d2a' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vfio_user_get_bar_addr' mangled-name='spdk_vfio_user_get_bar_addr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfio_user_get_bar_addr'>
      <parameter type-id='30b05d2a' name='dev'/>
      <parameter type-id='8f92235e' name='index'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='8f92235e' name='len'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_vfio_user_dev_send_request' mangled-name='spdk_vfio_user_dev_send_request' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vfio_user_dev_send_request'>
      <parameter type-id='30b05d2a' name='dev'/>
      <parameter type-id='86ce2b6c' name='command'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <parameter type-id='b59d7dce' name='arg_len'/>
      <parameter type-id='b59d7dce' name='buf_len'/>
      <parameter type-id='7292109c' name='fds'/>
      <parameter type-id='95e97e5e' name='max_fds'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
