<abi-corpus version='2.1' soname='libspdk_init.so.3.0'>
  <elf-needed>
    <dependency name='libspdk_jsonrpc.so.5.0'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libspdk_thread.so.8.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_add_subsystem' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_add_subsystem_depend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_rpc_initialize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_fini_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init_from_json_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_subsystem_init_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='json_config.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='spdk_subsystem_init_fn' type-id='f1eb0faf' filepath='init.h' line='37' column='1' id='522497da'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='7b5ced03' size-in-bits='64' id='f1eb0faf'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_subsystem_init_from_json_config' mangled-name='spdk_subsystem_init_from_json_config' filepath='json_config.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init_from_json_config'>
      <parameter type-id='80f4b756' name='json_config_file' filepath='json_config.c' line='561' column='1'/>
      <parameter type-id='80f4b756' name='rpc_addr' filepath='json_config.c' line='561' column='1'/>
      <parameter type-id='522497da' name='cb_fn' filepath='json_config.c' line='562' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='json_config.c' line='562' column='1'/>
      <parameter type-id='c894953d' name='stop_on_error' filepath='json_config.c' line='563' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='7b5ced03'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='rpc.c' language='LANG_C99'>
    <function-decl name='spdk_rpc_initialize' mangled-name='spdk_rpc_initialize' filepath='rpc.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_initialize'>
      <parameter type-id='80f4b756' name='listen_addr' filepath='rpc.c' line='26' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_rpc_finish' mangled-name='spdk_rpc_finish' filepath='rpc.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_rpc_finish'>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='subsystem.c' language='LANG_C99'>
    <class-decl name='spdk_subsystem' size-in-bits='384' is-struct='yes' visibility='default' filepath='init.h' line='13' column='1' id='9fe5652b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='953b12f8' visibility='default' filepath='init.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini' type-id='953b12f8' visibility='default' filepath='init.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_config_json' type-id='582528d7' visibility='default' filepath='init.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_subsystem_depend' size-in-bits='256' is-struct='yes' visibility='default' filepath='init.h' line='28' column='1' id='086abaea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='init.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='depends_on' type-id='80f4b756' visibility='default' filepath='init.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='init.h' line='25' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f7a7c12b' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='de14d493' visibility='default' filepath='init.h' line='25' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='init.h' line='31' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='51dccc68' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='20958be6' visibility='default' filepath='init.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_msg_fn' type-id='b7f9d8e6' filepath='thread.h' line='89' column='1' id='de128c99'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='9fe5652b' size-in-bits='64' id='f7a7c12b'/>
    <pointer-type-def type-id='f7a7c12b' size-in-bits='64' id='de14d493'/>
    <pointer-type-def type-id='086abaea' size-in-bits='64' id='51dccc68'/>
    <pointer-type-def type-id='51dccc68' size-in-bits='64' id='20958be6'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='9ed8cfeb' size-in-bits='64' id='582528d7'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_add_subsystem' mangled-name='spdk_add_subsystem' filepath='subsystem.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem'>
      <parameter type-id='f7a7c12b' name='subsystem' filepath='subsystem.c' line='35' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_add_subsystem_depend' mangled-name='spdk_add_subsystem_depend' filepath='subsystem.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_add_subsystem_depend'>
      <parameter type-id='51dccc68' name='depend' filepath='subsystem.c' line='41' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init_next' mangled-name='spdk_subsystem_init_next' filepath='subsystem.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init_next'>
      <parameter type-id='95e97e5e' name='rc' filepath='subsystem.c' line='138' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_init' mangled-name='spdk_subsystem_init' filepath='subsystem.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_init'>
      <parameter type-id='522497da' name='cb_fn' filepath='subsystem.c' line='173' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='subsystem.c' line='173' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_fini_next' mangled-name='spdk_subsystem_fini_next' filepath='subsystem.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_fini_next'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_subsystem_fini' mangled-name='spdk_subsystem_fini' filepath='subsystem.c' line='245' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_subsystem_fini'>
      <parameter type-id='de128c99' name='cb_fn' filepath='subsystem.c' line='245' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='subsystem.c' line='245' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='9ed8cfeb'>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
