<abi-corpus version='2.1' soname='libspdk_nvme.so.10.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_sock.so.8.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libspdk_trace.so.8.0'/>
    <dependency name='libspdk_vfio_user.so.4.0'/>
    <dependency name='libspdk_rdma.so.5.0'/>
    <dependency name='libspdk_dma.so.3.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvme_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_connect_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_type_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_ctrlr_alloc_io_qpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_ctrlr_alloc_qid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_nvme_transport_set_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_trid_populate_transport' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_close_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ctrlr_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ctrlr_get_max_zone_append_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ext_report_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_finish_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_max_active_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_max_open_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_num_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_zone_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_zone_size_sectors' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_offline_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_open_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_report_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_reset_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_set_zone_desc_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_append' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_append_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_appendv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_appendv_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_activate_locking_sp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_add_user_to_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_enable_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_erase_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_get_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_get_max_ranges' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_lock_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_revert_tper' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_secure_erase_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_set_new_passwd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_setup_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_take_ownership' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_free_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_get_d0_features_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_get_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='nvme.c' language='LANG_C99'>
    <class-decl name='spdk_nvme_host_id' size-in-bits='2320' is-struct='yes' visibility='default' filepath='nvme.h' line='492' column='1' id='81599aaf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostaddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='hostsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='507' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='95e97e5e' filepath='types.h' line='154' column='1' id='3629bad8'/>
    <typedef-decl name='pid_t' type-id='3629bad8' filepath='types.h' line='97' column='1' id='587f89d2'/>
    <typedef-decl name='spdk_nvme_attach_cb' type-id='dc8330a6' filepath='nvme.h' line='805' column='1' id='196479c9'/>
    <typedef-decl name='spdk_nvme_probe_cb' type-id='a531641a' filepath='nvme.h' line='791' column='1' id='abc0b7d8'/>
    <pointer-type-def type-id='242fa1d8' size-in-bits='64' id='a531641a'/>
    <pointer-type-def type-id='7528a00e' size-in-bits='64' id='ebba7414'/>
    <pointer-type-def type-id='0e876556' size-in-bits='64' id='57e3d1ac'/>
    <pointer-type-def type-id='57e3d1ac' size-in-bits='64' id='e1a2d5f2'/>
    <pointer-type-def type-id='81599aaf' size-in-bits='64' id='4b0091b7'/>
    <pointer-type-def type-id='a394da29' size-in-bits='64' id='75dd38a1'/>
    <pointer-type-def type-id='8cd337c8' size-in-bits='64' id='8035fbf9'/>
    <pointer-type-def type-id='72aef3b2' size-in-bits='64' id='a85c83ff'/>
    <pointer-type-def type-id='b2a984a4' size-in-bits='64' id='dc8330a6'/>
    <function-decl name='spdk_nvme_detach' mangled-name='spdk_nvme_detach' filepath='nvme.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='107' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_async' mangled-name='spdk_nvme_detach_async' filepath='nvme.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_async'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='134' column='1'/>
      <parameter type-id='e1a2d5f2' name='_detach_ctx' filepath='nvme.c' line='135' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll_async' mangled-name='spdk_nvme_detach_poll_async' filepath='nvme.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll_async'>
      <parameter type-id='57e3d1ac' name='detach_ctx' filepath='nvme.c' line='177' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll' mangled-name='spdk_nvme_detach_poll' filepath='nvme.c' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll'>
      <parameter type-id='57e3d1ac' name='detach_ctx' filepath='nvme.c' line='205' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe' mangled-name='spdk_nvme_probe' filepath='nvme.c' line='876' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='876' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='876' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='877' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='877' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='878' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect' mangled-name='spdk_nvme_connect' filepath='nvme.c' line='973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='973' column='1'/>
      <parameter type-id='69be0b8c' name='opts' filepath='nvme.c' line='974' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme.c' line='974' column='1'/>
      <return type-id='0d7532a2'/>
    </function-decl>
    <function-decl name='spdk_nvme_trid_populate_transport' mangled-name='spdk_nvme_trid_populate_transport' filepath='nvme.c' line='1009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_trid_populate_transport'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1009' column='1'/>
      <parameter type-id='8cd337c8' name='trtype' filepath='nvme.c' line='1010' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_populate_trstring' mangled-name='spdk_nvme_transport_id_populate_trstring' filepath='nvme.c' line='1043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_populate_trstring'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1043' column='1'/>
      <parameter type-id='80f4b756' name='trstring' filepath='nvme.c' line='1043' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_trtype' mangled-name='spdk_nvme_transport_id_parse_trtype' filepath='nvme.c' line='1066' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_trtype'>
      <parameter type-id='8035fbf9' name='trtype' filepath='nvme.c' line='1066' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1066' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_trtype_str' mangled-name='spdk_nvme_transport_id_trtype_str' filepath='nvme.c' line='1089' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_trtype_str'>
      <parameter type-id='8cd337c8' name='trtype' filepath='nvme.c' line='1089' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_adrfam' mangled-name='spdk_nvme_transport_id_parse_adrfam' filepath='nvme.c' line='1110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_adrfam'>
      <parameter type-id='a85c83ff' name='adrfam' filepath='nvme.c' line='1110' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1110' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_adrfam_str' mangled-name='spdk_nvme_transport_id_adrfam_str' filepath='nvme.c' line='1131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_adrfam_str'>
      <parameter type-id='72aef3b2' name='adrfam' filepath='nvme.c' line='1131' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse' mangled-name='spdk_nvme_transport_id_parse' filepath='nvme.c' line='1203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1203' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1203' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_host_id_parse' mangled-name='spdk_nvme_host_id_parse' filepath='nvme.c' line='1297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_host_id_parse'>
      <parameter type-id='4b0091b7' name='hostid' filepath='nvme.c' line='1297' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1297' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_compare' mangled-name='spdk_nvme_transport_id_compare' filepath='nvme.c' line='1364' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_compare'>
      <parameter type-id='7e9611b1' name='trid1' filepath='nvme.c' line='1364' column='1'/>
      <parameter type-id='7e9611b1' name='trid2' filepath='nvme.c' line='1365' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_parse' mangled-name='spdk_nvme_prchk_flags_parse' filepath='nvme.c' line='1417' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_parse'>
      <parameter type-id='90421557' name='prchk_flags' filepath='nvme.c' line='1417' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1417' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_str' mangled-name='spdk_nvme_prchk_flags_str' filepath='nvme.c' line='1452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_str'>
      <parameter type-id='8f92235e' name='prchk_flags' filepath='nvme.c' line='1452' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_async' mangled-name='spdk_nvme_probe_async' filepath='nvme.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_async'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1470' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='1471' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='1472' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='1473' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='1474' column='1'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_poll_async' mangled-name='spdk_nvme_probe_poll_async' filepath='nvme.c' line='1500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_poll_async'>
      <parameter type-id='75dd38a1' name='probe_ctx' filepath='nvme.c' line='1500' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect_async' mangled-name='spdk_nvme_connect_async' filepath='nvme.c' line='1525' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect_async'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1525' column='1'/>
      <parameter type-id='69be0b8c' name='opts' filepath='nvme.c' line='1526' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='1527' column='1'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <var-decl name='g_spdk_nvme_pid' type-id='587f89d2' visibility='default' filepath='nvme_internal.h' line='35' column='1'/>
    <class-decl name='spdk_nvme_probe_ctx' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='1018' column='1' is-declaration-only='yes' id='a394da29'/>
    <class-decl name='spdk_nvme_detach_ctx' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='1047' column='1' is-declaration-only='yes' id='0e876556'/>
    <class-decl name='nvme_driver' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='1051' column='1' is-declaration-only='yes' id='7528a00e'/>
    <var-decl name='g_spdk_nvme_driver' type-id='ebba7414' visibility='default' filepath='nvme_internal.h' line='1064' column='1'/>
    <function-type size-in-bits='64' id='242fa1d8'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='f5423aff'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='b2a984a4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='0d7532a2'/>
      <parameter type-id='69be0b8c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2131c8e5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a2'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='2048' id='93b898c4'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1600' id='ed3da487'>
      <subrange length='200' type-id='f0981eeb' id='53119c2f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' id='ca634421'>
      <subrange length='224' type-id='f0981eeb' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' id='12da2087'>
      <subrange length='33' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <enum-decl name='spdk_nvme_cc_ams' filepath='nvme_spec.h' line='673' column='1' id='468f6380'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_AMS_RR' value='0'/>
      <enumerator name='SPDK_NVME_CC_AMS_WRR' value='1'/>
      <enumerator name='SPDK_NVME_CC_AMS_VS' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_css' filepath='nvme_spec.h' line='114' column='1' id='1fb07fa0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_CSS_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CC_CSS_IOCS' value='6'/>
      <enumerator name='SPDK_NVME_CC_CSS_NOIO' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_fw_commit_action' filepath='nvme_spec.h' line='4001' column='1' id='0009b8fa'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_IMG' value='0'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_AND_ENABLE_IMG' value='1'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ENABLE_IMG' value='2'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_RUN_IMG' value='3'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_BOOT_PARTITION' value='6'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ACTIVATE_BOOT_PARTITION' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qp_failure_reason' filepath='nvme.h' line='359' column='1' id='738b4017'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_NONE' value='0'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_LOCAL' value='1'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_REMOTE' value='2'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_UNKNOWN' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qprio' filepath='nvme_spec.h' line='648' column='1' id='438eb703'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPRIO_URGENT' value='0'/>
      <enumerator name='SPDK_NVME_QPRIO_HIGH' value='1'/>
      <enumerator name='SPDK_NVME_QPRIO_MEDIUM' value='2'/>
      <enumerator name='SPDK_NVME_QPRIO_LOW' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' filepath='nvme.h' line='377' column='1' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' filepath='nvmf_spec.h' line='112' column='1' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' id='d0740e9b'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' id='3a071e7d'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' id='bf64ebc5'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' filepath='env.h' line='698' column='1' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_ctratt' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2175' column='1' id='b65f54af'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2133' column='1' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2135' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2038' column='1' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f74' visibility='default' filepath='nvme_spec.h' line='2053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f75' visibility='default' filepath='nvme_spec.h' line='2063' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default' filepath='nvme_spec.h' line='2065' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2096' column='1' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2130' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2138' column='1' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2172' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2083' column='1' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2085' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2086' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2087' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2093' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2069' column='1' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2070' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2072' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2074' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2077' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2078' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2079' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2232' column='1' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default' filepath='nvme_spec.h' line='2242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default' filepath='nvme_spec.h' line='2245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default' filepath='nvme_spec.h' line='2248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f76' visibility='default' filepath='nvme_spec.h' line='2263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default' filepath='nvme_spec.h' line='2272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default' filepath='nvme_spec.h' line='2281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='b65f54af' visibility='default' filepath='nvme_spec.h' line='2284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default' filepath='nvme_spec.h' line='2298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default' filepath='nvme_spec.h' line='2300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f77' visibility='default' filepath='nvme_spec.h' line='2311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f78' visibility='default' filepath='nvme_spec.h' line='2320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f79' visibility='default' filepath='nvme_spec.h' line='2331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvme_spec.h' line='2336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f7a' visibility='default' filepath='nvme_spec.h' line='2359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f7b' visibility='default' filepath='nvme_spec.h' line='2378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f7c' visibility='default' filepath='nvme_spec.h' line='2392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f7d' visibility='default' filepath='nvme_spec.h' line='2400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f7e' visibility='default' filepath='nvme_spec.h' line='2433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab595' visibility='default' filepath='nvme_spec.h' line='2447' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab596' visibility='default' filepath='nvme_spec.h' line='2473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab597' visibility='default' filepath='nvme_spec.h' line='2490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2502' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f7f' visibility='default' filepath='nvme_spec.h' line='2517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2522' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2528' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default' filepath='nvme_spec.h' line='2530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default' filepath='nvme_spec.h' line='2536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f80' visibility='default' filepath='nvme_spec.h' line='2544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f80' visibility='default' filepath='nvme_spec.h' line='2550' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvme_spec.h' line='2558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvme_spec.h' line='2561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f82' visibility='default' filepath='nvme_spec.h' line='2576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f83' visibility='default' filepath='nvme_spec.h' line='2597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvme_spec.h' line='2600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default' filepath='nvme_spec.h' line='2611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvme_spec.h' line='2613' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default' filepath='nvme_spec.h' line='2615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvme_spec.h' line='2617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default' filepath='nvme_spec.h' line='2620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default' filepath='nvme_spec.h' line='2623' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_list' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='3910' column='1' id='448e2afd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_count' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='3911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ctrlr_list' type-id='2ca8d8c8' visibility='default' filepath='nvme_spec.h' line='3912' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_opts' size-in-bits='6544' is-struct='yes' visibility='default' filepath='nvme.h' line='46' column='1' id='388558d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_io_queues' type-id='8f92235e' visibility='default' filepath='nvme.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_cmb_sqs' type-id='c894953d' visibility='default' filepath='nvme.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='no_shn_notification' type-id='c894953d' visibility='default' filepath='nvme.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='reserved6' type-id='0f4b9e74' visibility='default' filepath='nvme.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arb_mechanism' type-id='468f6380' visibility='default' filepath='nvme.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arbitration_burst' type-id='b96825af' visibility='default' filepath='nvme.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='low_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='medium_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='high_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_retry_count' type-id='b96825af' visibility='default' filepath='nvme.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='reserved21' type-id='d3490169' visibility='default' filepath='nvme.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='src_addr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='src_svcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4368'>
        <var-decl name='host_id' type-id='13339fda' visibility='default' filepath='nvme.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4432'>
        <var-decl name='extended_host_id' type-id='fa9986a5' visibility='default' filepath='nvme.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4560'>
        <var-decl name='reserved570' type-id='0f4b9e74' visibility='default' filepath='nvme.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='command_set' type-id='1fb07fa0' visibility='default' filepath='nvme.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='admin_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='header_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4648'>
        <var-decl name='data_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4656'>
        <var-decl name='disable_error_logging' type-id='c894953d' visibility='default' filepath='nvme.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4664'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default' filepath='nvme.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='admin_queue_size' type-id='149c6638' visibility='default' filepath='nvme.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4688'>
        <var-decl name='reserved586' type-id='0f562bd0' visibility='default' filepath='nvme.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='fabrics_connect_timeout_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='disable_read_ana_log_page' type-id='c894953d' visibility='default' filepath='nvme.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='reserved610' type-id='d3538ec5' visibility='default' filepath='nvme.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='disable_read_changed_ns_list_log_page' type-id='b96825af' visibility='default' filepath='nvme.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4936'>
        <var-decl name='psk' type-id='ed3da487' visibility='default' filepath='nvme.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default' filepath='nvme.h' line='285' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_format' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='3946' column='1' id='b9f3fc28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lbaf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3948' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pil' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3954' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='ses' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='lbafu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3959' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_io_qpair_opts' size-in-bits='576' is-struct='yes' visibility='default' filepath='nvme.h' line='1510' column='1' id='16b11ada'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qprio' type-id='438eb703' visibility='default' filepath='nvme.h' line='1515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='1520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='1533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved13' type-id='d3490169' visibility='default' filepath='nvme.h' line='1555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq' type-id='e7f43f84' visibility='default' filepath='nvme.h' line='1578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cq' type-id='e7f43f85' visibility='default' filepath='nvme.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='create_only' type-id='c894953d' visibility='default' filepath='nvme.h' line='1590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='async_mode' type-id='c894953d' visibility='default' filepath='nvme.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='reserved66' type-id='0f562bd0' visibility='default' filepath='nvme.h' line='1599' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2705' column='1' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2707' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f86' visibility='default' filepath='nvme_spec.h' line='2733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='2746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43f88' visibility='default' filepath='nvme_spec.h' line='2758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='2776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='2788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='2794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab599' visibility='default' filepath='nvme_spec.h' line='2824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='2829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59a' visibility='default' filepath='nvme_spec.h' line='2858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2861' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2906' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default' filepath='nvme_spec.h' line='2908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2913' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43f8d' visibility='default' filepath='nvme_spec.h' line='2920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default' filepath='nvme_spec.h' line='2946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default' filepath='nvme_spec.h' line='2948' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1902' column='1' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1903' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1905' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1907' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1908' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1909' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1911' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1912' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1918' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1920' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1921' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1923' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1926' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='1939' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' size-in-bits='4512' is-struct='yes' visibility='default' filepath='nvme.h' line='433' column='1' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='478' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='env.h' line='659' column='1' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='663' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' filepath='env.h' line='681' column='1' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default' filepath='env.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default' filepath='env.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default' filepath='env.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default' filepath='env.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='env.h' line='666' column='1' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='671' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme.h' line='1574' column='1' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='538b928d' visibility='default' filepath='nvme.h' line='1575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1577' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme.h' line='1579' column='1' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='25e0c706' visibility='default' filepath='nvme.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1582' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='env.h' line='710' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2594' column='1' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2596' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2059' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2061' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2062' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2469' column='1' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2471' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='427' column='1' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='brs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='abpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='445' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2484' column='1' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2488' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='126' column='1' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='63' column='1' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2935' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2945' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='162' column='1' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='178' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='293' column='1' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='bir' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pmrtu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='pmrwbm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pmrto' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='cmss' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='323' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='242' column='1' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='lists' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='szu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='sz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='207' column='1' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2508' column='1' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2513' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2516' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2791' column='1' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2793' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2049' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2051' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2052' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2749' column='1' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2751' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2757' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2739' column='1' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2741' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2745' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2564' column='1' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2568' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2541' column='1' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2542' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2543' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2257' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2362' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2374' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2377' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2424' column='1' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2425' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2303' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2441' column='1' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2445' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2826' column='1' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2827' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2798' column='1' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2821' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2761' column='1' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2775' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2779' column='1' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2787' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2572' column='1' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2575' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2834' column='1' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2844' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2854' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2856' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2345' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2358' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2323' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2387' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2391' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2395' column='1' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2399' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2716' column='1' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2732' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2314' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2319' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2916' column='1' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2918' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2919' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='types.h' line='41' column='1' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' filepath='types.h' line='37' column='1' id='2171a512'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='stdint-intn.h' line='26' column='1' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' filepath='stdint-intn.h' line='24' column='1' id='ee31ee44'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_nvme_aer_cb' type-id='978ac92c' filepath='nvme.h' line='1390' column='1' id='8565ca96'/>
    <typedef-decl name='spdk_nvme_qp_failure_reason' type-id='738b4017' filepath='nvme.h' line='366' column='1' id='346f4e4b'/>
    <typedef-decl name='spdk_nvme_remove_cb' type-id='12bea681' filepath='nvme.h' line='822' column='1' id='b978a222'/>
    <typedef-decl name='spdk_nvme_timeout_cb' type-id='9871eaf6' filepath='nvme.h' line='1444' column='1' id='818cfb43'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='32752' id='2ca8d8c8'>
      <subrange length='2047' type-id='f0981eeb' id='e51ae5ac'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' id='45439f56'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' id='25518ee9'>
      <subrange length='1024' type-id='f0981eeb' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' id='b68a110f'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' id='1acf0601'>
      <subrange length='119' type-id='f0981eeb' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' id='ba8c55f2'>
      <subrange length='11' type-id='f0981eeb' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' id='d8dd2858'>
      <subrange length='204' type-id='f0981eeb' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' id='90687fee'>
      <subrange length='242' type-id='f0981eeb' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' id='74b3417b'>
      <subrange length='3712' type-id='f0981eeb' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' id='0f562bd0'>
      <subrange length='6' type-id='f0981eeb' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' id='be0fa24b'>
      <subrange length='768' type-id='f0981eeb' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' id='cf30f637'>
      <subrange length='9' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <union-decl name='spdk_nvme_bpinfo_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='425' column='1' id='9e9f6fb8'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='426' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8f' visibility='default' filepath='nvme_spec.h' line='446' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' size-in-bits='64' visibility='default' filepath='nvme_spec.h' line='61' column='1' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='62' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f92' visibility='default' filepath='nvme_spec.h' line='102' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='124' column='1' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='125' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f91' visibility='default' filepath='nvme_spec.h' line='151' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmbsz_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='240' column='1' id='bde1820f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='241' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f95' visibility='default' filepath='nvme_spec.h' line='258' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='160' column='1' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='161' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f93' visibility='default' filepath='nvme_spec.h' line='179' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_pmrcap_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='291' column='1' id='e61e4ac5'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='292' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f94' visibility='default' filepath='nvme_spec.h' line='324' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='205' column='1' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f96' visibility='default' filepath='nvme_spec.h' line='214' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme.h' line='1549' column='1' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='delay_cmd_submit' type-id='c894953d' visibility='default' filepath='nvme.h' line='1550' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delay_pcie_doorbell' type-id='c894953d' visibility='default' filepath='nvme.h' line='1551' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2797' column='1' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43f98' visibility='default' filepath='nvme_spec.h' line='2822' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2823' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2467' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2468' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8e' visibility='default' filepath='nvme_spec.h' line='2472' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2482' column='1' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2483' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f90' visibility='default' filepath='nvme_spec.h' line='2489' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2439' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2440' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f97' visibility='default' filepath='nvme_spec.h' line='2446' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2832' column='1' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2833' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f99' visibility='default' filepath='nvme_spec.h' line='2857' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='30a17994' const='yes' id='daa760af'/>
    <pointer-type-def type-id='daa760af' size-in-bits='64' id='ba7cf15f'/>
    <qualified-type-def type-id='514f4721' const='yes' id='db3704b8'/>
    <pointer-type-def type-id='db3704b8' size-in-bits='64' id='a99c31d6'/>
    <qualified-type-def type-id='388558d7' const='yes' id='86722dee'/>
    <pointer-type-def type-id='86722dee' size-in-bits='64' id='69be0b8c'/>
    <qualified-type-def type-id='16b11ada' const='yes' id='50d38b19'/>
    <pointer-type-def type-id='50d38b19' size-in-bits='64' id='70042149'/>
    <qualified-type-def type-id='8712472c' const='yes' id='ee6bba01'/>
    <pointer-type-def type-id='ee6bba01' size-in-bits='64' id='7e9611b1'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='72b49d60' size-in-bits='64' id='25e0c706'/>
    <pointer-type-def type-id='448e2afd' size-in-bits='64' id='c829039d'/>
    <pointer-type-def type-id='388558d7' size-in-bits='64' id='f5423aff'/>
    <pointer-type-def type-id='b9f3fc28' size-in-bits='64' id='80e5734e'/>
    <pointer-type-def type-id='16b11ada' size-in-bits='64' id='44486348'/>
    <pointer-type-def type-id='2e8e7df0' size-in-bits='64' id='663c4b46'/>
    <pointer-type-def type-id='4e56c4fd' size-in-bits='64' id='4b4afe0d'/>
    <pointer-type-def type-id='38ef35c9' size-in-bits='64' id='d18635a1'/>
    <pointer-type-def type-id='8712472c' size-in-bits='64' id='6f56757a'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='2131c8e5' size-in-bits='64' id='12bea681'/>
    <pointer-type-def type-id='6f744fd4' size-in-bits='64' id='9871eaf6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <function-decl name='spdk_nvme_ctrlr_get_default_ctrlr_opts' mangled-name='spdk_nvme_ctrlr_get_default_ctrlr_opts' filepath='nvme_ctrlr.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_ctrlr_opts'>
      <parameter type-id='f5423aff' name='opts' filepath='nvme_ctrlr.c' line='169' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='169' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_opts' mangled-name='spdk_nvme_ctrlr_get_opts' filepath='nvme_ctrlr.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_opts'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='246' column='1'/>
      <return type-id='69be0b8c'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_default_io_qpair_opts' mangled-name='spdk_nvme_ctrlr_get_default_io_qpair_opts' filepath='nvme_ctrlr.c' line='296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_io_qpair_opts'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='296' column='1'/>
      <parameter type-id='44486348' name='opts' filepath='nvme_ctrlr.c' line='297' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='298' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_connect_io_qpair' mangled-name='spdk_nvme_ctrlr_connect_io_qpair' filepath='nvme_ctrlr.c' line='414' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_connect_io_qpair'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='414' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr.c' line='414' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_disconnect_io_qpair' filepath='nvme_ctrlr.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr.c' line='434' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_io_qpair' mangled-name='spdk_nvme_ctrlr_alloc_io_qpair' filepath='nvme_ctrlr.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_io_qpair'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='444' column='1'/>
      <parameter type-id='70042149' name='user_opts' filepath='nvme_ctrlr.c' line='445' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='446' column='1'/>
      <return type-id='5ca7f948'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_reconnect_io_qpair' filepath='nvme_ctrlr.c' line='509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr.c' line='509' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' mangled-name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' filepath='nvme_ctrlr.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_admin_qp_failure_reason'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='555' column='1'/>
      <return type-id='346f4e4b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_io_qpair' mangled-name='spdk_nvme_ctrlr_free_io_qpair' filepath='nvme_ctrlr.c' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr.c' line='578' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_failed' mangled-name='spdk_nvme_ctrlr_is_failed' filepath='nvme_ctrlr.c' line='996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_failed'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='996' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_fail' mangled-name='spdk_nvme_ctrlr_fail' filepath='nvme_ctrlr.c' line='1033' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_fail'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1033' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect' mangled-name='spdk_nvme_ctrlr_disconnect' filepath='nvme_ctrlr.c' line='1658' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1658' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_async' mangled-name='spdk_nvme_ctrlr_reconnect_async' filepath='nvme_ctrlr.c' line='1670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_async'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1670' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_poll_async' mangled-name='spdk_nvme_ctrlr_reconnect_poll_async' filepath='nvme_ctrlr.c' line='1689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_poll_async'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1689' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset' mangled-name='spdk_nvme_ctrlr_reset' filepath='nvme_ctrlr.c' line='1804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1804' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset_subsystem' mangled-name='spdk_nvme_ctrlr_reset_subsystem' filepath='nvme_ctrlr.c' line='1844' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset_subsystem'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1844' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_trid' mangled-name='spdk_nvme_ctrlr_set_trid' filepath='nvme_ctrlr.c' line='1870' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_trid'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1870' column='1'/>
      <parameter type-id='6f56757a' name='trid' filepath='nvme_ctrlr.c' line='1870' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_remove_cb' mangled-name='spdk_nvme_ctrlr_set_remove_cb' filepath='nvme_ctrlr.c' line='1899' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_remove_cb'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='1899' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme_ctrlr.c' line='1900' column='1'/>
      <parameter type-id='eaa32e2f' name='remove_ctx' filepath='nvme_ctrlr.c' line='1900' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_process_admin_completions' mangled-name='spdk_nvme_ctrlr_process_admin_completions' filepath='nvme_ctrlr.c' line='4290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_process_admin_completions'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4290' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_data' mangled-name='spdk_nvme_ctrlr_get_data' filepath='nvme_ctrlr.c' line='4337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_data'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4337' column='1'/>
      <return type-id='a99c31d6'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_csts' mangled-name='spdk_nvme_ctrlr_get_regs_csts' filepath='nvme_ctrlr.c' line='4342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_csts'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4342' column='1'/>
      <return type-id='f62d2dc3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cc' mangled-name='spdk_nvme_ctrlr_get_regs_cc' filepath='nvme_ctrlr.c' line='4352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cc'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4352' column='1'/>
      <return type-id='f0fcbcb4'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cap' mangled-name='spdk_nvme_ctrlr_get_regs_cap' filepath='nvme_ctrlr.c' line='4362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cap'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4362' column='1'/>
      <return type-id='007005ee'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_vs' mangled-name='spdk_nvme_ctrlr_get_regs_vs' filepath='nvme_ctrlr.c' line='4367' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_vs'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4367' column='1'/>
      <return type-id='900beaa3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cmbsz' mangled-name='spdk_nvme_ctrlr_get_regs_cmbsz' filepath='nvme_ctrlr.c' line='4372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cmbsz'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4372' column='1'/>
      <return type-id='bde1820f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_pmrcap' mangled-name='spdk_nvme_ctrlr_get_regs_pmrcap' filepath='nvme_ctrlr.c' line='4383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_pmrcap'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4383' column='1'/>
      <return type-id='e61e4ac5'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_bpinfo' mangled-name='spdk_nvme_ctrlr_get_regs_bpinfo' filepath='nvme_ctrlr.c' line='4394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_bpinfo'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4394' column='1'/>
      <return type-id='9e9f6fb8'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pmrsz' mangled-name='spdk_nvme_ctrlr_get_pmrsz' filepath='nvme_ctrlr.c' line='4406' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pmrsz'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4406' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_num_ns' mangled-name='spdk_nvme_ctrlr_get_num_ns' filepath='nvme_ctrlr.c' line='4412' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_num_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4412' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_active_ns' mangled-name='spdk_nvme_ctrlr_is_active_ns' filepath='nvme_ctrlr.c' line='4418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4418' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4418' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_first_active_ns' mangled-name='spdk_nvme_ctrlr_get_first_active_ns' filepath='nvme_ctrlr.c' line='4433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_first_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4433' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_next_active_ns' mangled-name='spdk_nvme_ctrlr_get_next_active_ns' filepath='nvme_ctrlr.c' line='4454' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_next_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4454' column='1'/>
      <parameter type-id='8f92235e' name='prev_nsid' filepath='nvme_ctrlr.c' line='4454' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_ns' mangled-name='spdk_nvme_ctrlr_get_ns' filepath='nvme_ctrlr.c' line='4477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4477' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4477' column='1'/>
      <return type-id='663c4b46'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pci_device' mangled-name='spdk_nvme_ctrlr_get_pci_device' filepath='nvme_ctrlr.c' line='4509' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pci_device'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4509' column='1'/>
      <return type-id='efc5406b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_max_xfer_size' mangled-name='spdk_nvme_ctrlr_get_max_xfer_size' filepath='nvme_ctrlr.c' line='4523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_max_xfer_size'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='4523' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_aer_callback' mangled-name='spdk_nvme_ctrlr_register_aer_callback' filepath='nvme_ctrlr.c' line='4529' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_aer_callback'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4529' column='1'/>
      <parameter type-id='8565ca96' name='aer_cb_fn' filepath='nvme_ctrlr.c' line='4530' column='1'/>
      <parameter type-id='eaa32e2f' name='aer_cb_arg' filepath='nvme_ctrlr.c' line='4531' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' mangled-name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' filepath='nvme_ctrlr.c' line='4547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4547' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_timeout_callback' mangled-name='spdk_nvme_ctrlr_register_timeout_callback' filepath='nvme_ctrlr.c' line='4553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_timeout_callback'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4553' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_io_us' filepath='nvme_ctrlr.c' line='4554' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_admin_us' filepath='nvme_ctrlr.c' line='4554' column='1'/>
      <parameter type-id='818cfb43' name='cb_fn' filepath='nvme_ctrlr.c' line='4555' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr.c' line='4555' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_log_page_supported' mangled-name='spdk_nvme_ctrlr_is_log_page_supported' filepath='nvme_ctrlr.c' line='4575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_log_page_supported'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4575' column='1'/>
      <parameter type-id='b96825af' name='log_page' filepath='nvme_ctrlr.c' line='4575' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_feature_supported' mangled-name='spdk_nvme_ctrlr_is_feature_supported' filepath='nvme_ctrlr.c' line='4583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_feature_supported'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4583' column='1'/>
      <parameter type-id='b96825af' name='feature_code' filepath='nvme_ctrlr.c' line='4583' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_attach_ns' mangled-name='spdk_nvme_ctrlr_attach_ns' filepath='nvme_ctrlr.c' line='4591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_attach_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4591' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4591' column='1'/>
      <parameter type-id='c829039d' name='payload' filepath='nvme_ctrlr.c' line='4592' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_detach_ns' mangled-name='spdk_nvme_ctrlr_detach_ns' filepath='nvme_ctrlr.c' line='4638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_detach_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4638' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4638' column='1'/>
      <parameter type-id='c829039d' name='payload' filepath='nvme_ctrlr.c' line='4639' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_create_ns' mangled-name='spdk_nvme_ctrlr_create_ns' filepath='nvme_ctrlr.c' line='4673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_create_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4673' column='1'/>
      <parameter type-id='4b4afe0d' name='payload' filepath='nvme_ctrlr.c' line='4673' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_delete_ns' mangled-name='spdk_nvme_ctrlr_delete_ns' filepath='nvme_ctrlr.c' line='4708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_delete_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4708' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4708' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_format' mangled-name='spdk_nvme_ctrlr_format' filepath='nvme_ctrlr.c' line='4741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_format'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4741' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4741' column='1'/>
      <parameter type-id='80e5734e' name='format' filepath='nvme_ctrlr.c' line='4742' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_update_firmware' mangled-name='spdk_nvme_ctrlr_update_firmware' filepath='nvme_ctrlr.c' line='4772' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_update_firmware'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4772' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='4772' column='1'/>
      <parameter type-id='8f92235e' name='size' filepath='nvme_ctrlr.c' line='4772' column='1'/>
      <parameter type-id='95e97e5e' name='slot' filepath='nvme_ctrlr.c' line='4773' column='1'/>
      <parameter type-id='0009b8fa' name='commit_action' filepath='nvme_ctrlr.c' line='4773' column='1'/>
      <parameter type-id='d18635a1' name='completion_status' filepath='nvme_ctrlr.c' line='4773' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reserve_cmb' mangled-name='spdk_nvme_ctrlr_reserve_cmb' filepath='nvme_ctrlr.c' line='4875' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reserve_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4875' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_cmb' mangled-name='spdk_nvme_ctrlr_map_cmb' filepath='nvme_ctrlr.c' line='4900' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4900' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_ctrlr.c' line='4900' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_cmb' mangled-name='spdk_nvme_ctrlr_unmap_cmb' filepath='nvme_ctrlr.c' line='4912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4912' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_enable_pmr' mangled-name='spdk_nvme_ctrlr_enable_pmr' filepath='nvme_ctrlr.c' line='4920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_enable_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4920' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_pmr' mangled-name='spdk_nvme_ctrlr_disable_pmr' filepath='nvme_ctrlr.c' line='4932' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4932' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_pmr' mangled-name='spdk_nvme_ctrlr_map_pmr' filepath='nvme_ctrlr.c' line='4944' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4944' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_ctrlr.c' line='4944' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_pmr' mangled-name='spdk_nvme_ctrlr_unmap_pmr' filepath='nvme_ctrlr.c' line='4956' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4956' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_start' mangled-name='spdk_nvme_ctrlr_read_boot_partition_start' filepath='nvme_ctrlr.c' line='4968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_start'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='4968' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='4968' column='1'/>
      <parameter type-id='8f92235e' name='bprsz' filepath='nvme_ctrlr.c' line='4969' column='1'/>
      <parameter type-id='8f92235e' name='bprof' filepath='nvme_ctrlr.c' line='4969' column='1'/>
      <parameter type-id='8f92235e' name='bpid' filepath='nvme_ctrlr.c' line='4969' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_poll' mangled-name='spdk_nvme_ctrlr_read_boot_partition_poll' filepath='nvme_ctrlr.c' line='5026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_poll'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5026' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_write_boot_partition' mangled-name='spdk_nvme_ctrlr_write_boot_partition' filepath='nvme_ctrlr.c' line='5133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_write_boot_partition'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5133' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5134' column='1'/>
      <parameter type-id='8f92235e' name='size' filepath='nvme_ctrlr.c' line='5134' column='1'/>
      <parameter type-id='8f92235e' name='bpid' filepath='nvme_ctrlr.c' line='5134' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr.c' line='5135' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr.c' line='5135' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_discovery' mangled-name='spdk_nvme_ctrlr_is_discovery' filepath='nvme_ctrlr.c' line='5159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_discovery'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5159' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_fabrics' mangled-name='spdk_nvme_ctrlr_is_fabrics' filepath='nvme_ctrlr.c' line='5168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_fabrics'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5168' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_receive' mangled-name='spdk_nvme_ctrlr_security_receive' filepath='nvme_ctrlr.c' line='5176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_receive'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5176' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr.c' line='5176' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr.c' line='5177' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr.c' line='5177' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5177' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='nvme_ctrlr.c' line='5177' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_send' mangled-name='spdk_nvme_ctrlr_security_send' filepath='nvme_ctrlr.c' line='5207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_send'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5207' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr.c' line='5207' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr.c' line='5208' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr.c' line='5208' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5208' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='nvme_ctrlr.c' line='5208' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_flags' mangled-name='spdk_nvme_ctrlr_get_flags' filepath='nvme_ctrlr.c' line='5240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_flags'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5240' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_transport_id' mangled-name='spdk_nvme_ctrlr_get_transport_id' filepath='nvme_ctrlr.c' line='5246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_transport_id'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5246' column='1'/>
      <return type-id='7e9611b1'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_qid' mangled-name='spdk_nvme_ctrlr_alloc_qid' filepath='nvme_ctrlr.c' line='5252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_qid'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5252' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_qid' mangled-name='spdk_nvme_ctrlr_free_qid' filepath='nvme_ctrlr.c' line='5271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_qid'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr.c' line='5271' column='1'/>
      <parameter type-id='149c6638' name='qid' filepath='nvme_ctrlr.c' line='5271' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_memory_domains' mangled-name='spdk_nvme_ctrlr_get_memory_domains' filepath='nvme_ctrlr.c' line='5285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_memory_domains'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='5285' column='1'/>
      <parameter type-id='1fc0b044' name='domains' filepath='nvme_ctrlr.c' line='5286' column='1'/>
      <parameter type-id='95e97e5e' name='array_size' filepath='nvme_ctrlr.c' line='5286' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_nvme_ns' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='501' column='1' is-declaration-only='yes' id='2e8e7df0'/>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='6f744fd4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a2'/>
      <parameter type-id='5ca7f948'/>
      <parameter type-id='149c6638'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='4d39c5a2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='51104a73'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr_cmd.c' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1325' column='1' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab59b' visibility='default' filepath='nvme_spec.h' line='1351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab59e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1371' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1388' column='1' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab59f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='610' column='1' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1375' column='1' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1381' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='879' column='1' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='881' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='884' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='694' column='1' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='704' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='707' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1087' column='1' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1089' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1092' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='851' column='1' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='853' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1244' column='1' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1260' column='1' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1263' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1033' column='1' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1035' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1036' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='987' column='1' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1046' column='1' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1051' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1052' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1077' column='1' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1079' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1080' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1145' column='1' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1150' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1137' column='1' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1142' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1284' column='1' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='833' column='1' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='835' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='838' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='930' column='1' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='932' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='619' column='1' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='623' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1095' column='1' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1103' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1203' column='1' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1208' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1299' column='1' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1317' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1165' column='1' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='801' column='1' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='806' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1113' column='1' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='736' column='1' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1253' column='1' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1216' column='1' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1221' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1234' column='1' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1224' column='1' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1062' column='1' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1064' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1067' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='719' column='1' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1020' column='1' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1022' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1023' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1124' column='1' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1131' column='1' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1192' column='1' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1001' column='1' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1004' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1006' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1171' column='1' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1181' column='1' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1189' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1153' column='1' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1106' column='1' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1110' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='816' column='1' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='818' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='770' column='1' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='772' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='775' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='750' column='1' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='755' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='787' column='1' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='626' column='1' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='630' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1345' column='1' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='863' column='1' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='867' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='868' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='613' column='1' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='616' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eec' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='spdk_nvme_cmd_cb' type-id='978ac92c' filepath='nvme.h' line='1380' column='1' id='766930c6'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1085' column='1' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f9c' visibility='default' filepath='nvme_spec.h' line='1093' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fbf' visibility='default' filepath='nvme_spec.h' line='1111' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43faf' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fb8' visibility='default' filepath='nvme_spec.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fb9' visibility='default' filepath='nvme_spec.h' line='1135' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1143' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='1151' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fbe' visibility='default' filepath='nvme_spec.h' line='1157' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fbe' visibility='default' filepath='nvme_spec.h' line='1163' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fad' visibility='default' filepath='nvme_spec.h' line='1169' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fbc' visibility='default' filepath='nvme_spec.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fbd' visibility='default' filepath='nvme_spec.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fba' visibility='default' filepath='nvme_spec.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fab' visibility='default' filepath='nvme_spec.h' line='1209' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1213' column='1' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fb2' visibility='default' filepath='nvme_spec.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fb4' visibility='default' filepath='nvme_spec.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fb3' visibility='default' filepath='nvme_spec.h' line='1242' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43f9e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43f9f' visibility='default' filepath='nvme_spec.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1266' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1270' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='1292' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1296' column='1' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fac' visibility='default' filepath='nvme_spec.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default' filepath='nvme_spec.h' line='1320' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default' filepath='nvme_spec.h' line='1321' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' filepath='nvme_spec.h' line='860' column='1' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc6' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='692' column='1' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='693' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9b' visibility='default' filepath='nvme_spec.h' line='708' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='877' column='1' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='878' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9a' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='768' column='1' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='769' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc1' visibility='default' filepath='nvme_spec.h' line='778' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1031' column='1' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1032' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa0' visibility='default' filepath='nvme_spec.h' line='1037' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1044' column='1' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='1053' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1060' column='1' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1061' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb5' visibility='default' filepath='nvme_spec.h' line='1068' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1075' column='1' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='1081' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='985' column='1' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='986' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='992' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='814' column='1' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='815' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc0' visibility='default' filepath='nvme_spec.h' line='824' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='831' column='1' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='832' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='841' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='928' column='1' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='929' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='933' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='734' column='1' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='735' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb0' visibility='default' filepath='nvme_spec.h' line='741' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='799' column='1' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='800' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fae' visibility='default' filepath='nvme_spec.h' line='807' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='717' column='1' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='718' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb6' visibility='default' filepath='nvme_spec.h' line='727' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='999' column='1' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbb' visibility='default' filepath='nvme_spec.h' line='1010' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1018' column='1' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1019' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb7' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='748' column='1' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='749' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc2' visibility='default' filepath='nvme_spec.h' line='761' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='785' column='1' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='786' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc3' visibility='default' filepath='nvme_spec.h' line='792' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='849' column='1' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='850' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='856' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1344' column='1' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fc5' visibility='default' filepath='nvme_spec.h' line='1348' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1350' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='612' column='1' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fc7' visibility='default' filepath='nvme_spec.h' line='617' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fc4' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1401' column='1' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='status_raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1402' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvme_spec.h' line='1403' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1354' column='1' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1355' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default' filepath='nvme_spec.h' line='1356' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1359' column='1' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default' filepath='nvme_spec.h' line='1361' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1364' column='1' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1365' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default' filepath='nvme_spec.h' line='1366' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <qualified-type-def type-id='72b49d60' const='yes' id='95b79f8b'/>
    <pointer-type-def type-id='95b79f8b' size-in-bits='64' id='51104a73'/>
    <pointer-type-def type-id='a0e8c12d' size-in-bits='64' id='538b928d'/>
    <pointer-type-def type-id='30a17994' size-in-bits='64' id='0d7532a2'/>
    <pointer-type-def type-id='7718a4aa' size-in-bits='64' id='5ca7f948'/>
    <pointer-type-def type-id='4d39c5a2' size-in-bits='64' id='978ac92c'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build' mangled-name='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build' filepath='nvme_ctrlr_cmd.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='10' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr_cmd.c' line='11' column='1'/>
      <parameter type-id='538b928d' name='cmd' filepath='nvme_ctrlr_cmd.c' line='12' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='13' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='13' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_io_raw' mangled-name='spdk_nvme_ctrlr_cmd_io_raw' filepath='nvme_ctrlr_cmd.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_io_raw'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='35' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr_cmd.c' line='36' column='1'/>
      <parameter type-id='538b928d' name='cmd' filepath='nvme_ctrlr_cmd.c' line='37' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='nvme_ctrlr_cmd.c' line='38' column='1'/>
      <parameter type-id='8f92235e' name='len' filepath='nvme_ctrlr_cmd.c' line='38' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='39' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='39' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_io_raw_with_md' mangled-name='spdk_nvme_ctrlr_cmd_io_raw_with_md' filepath='nvme_ctrlr_cmd.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_io_raw_with_md'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='55' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr_cmd.c' line='56' column='1'/>
      <parameter type-id='538b928d' name='cmd' filepath='nvme_ctrlr_cmd.c' line='57' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='nvme_ctrlr_cmd.c' line='58' column='1'/>
      <parameter type-id='8f92235e' name='len' filepath='nvme_ctrlr_cmd.c' line='58' column='1'/>
      <parameter type-id='eaa32e2f' name='md_buf' filepath='nvme_ctrlr_cmd.c' line='58' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='59' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='59' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_admin_raw' mangled-name='spdk_nvme_ctrlr_cmd_admin_raw' filepath='nvme_ctrlr_cmd.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_admin_raw'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='87' column='1'/>
      <parameter type-id='538b928d' name='cmd' filepath='nvme_ctrlr_cmd.c' line='88' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='nvme_ctrlr_cmd.c' line='89' column='1'/>
      <parameter type-id='8f92235e' name='len' filepath='nvme_ctrlr_cmd.c' line='89' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='90' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='90' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_set_feature' mangled-name='spdk_nvme_ctrlr_cmd_set_feature' filepath='nvme_ctrlr_cmd.c' line='297' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_set_feature'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='297' column='1'/>
      <parameter type-id='b96825af' name='feature' filepath='nvme_ctrlr_cmd.c' line='297' column='1'/>
      <parameter type-id='8f92235e' name='cdw11' filepath='nvme_ctrlr_cmd.c' line='298' column='1'/>
      <parameter type-id='8f92235e' name='cdw12' filepath='nvme_ctrlr_cmd.c' line='298' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='298' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='298' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='299' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='299' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_feature' mangled-name='spdk_nvme_ctrlr_cmd_get_feature' filepath='nvme_ctrlr_cmd.c' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_feature'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='326' column='1'/>
      <parameter type-id='b96825af' name='feature' filepath='nvme_ctrlr_cmd.c' line='326' column='1'/>
      <parameter type-id='8f92235e' name='cdw11' filepath='nvme_ctrlr_cmd.c' line='327' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='327' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='327' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='328' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='328' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_feature_ns' mangled-name='spdk_nvme_ctrlr_cmd_get_feature_ns' filepath='nvme_ctrlr_cmd.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_feature_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='354' column='1'/>
      <parameter type-id='b96825af' name='feature' filepath='nvme_ctrlr_cmd.c' line='354' column='1'/>
      <parameter type-id='8f92235e' name='cdw11' filepath='nvme_ctrlr_cmd.c' line='355' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='355' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='356' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='356' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='357' column='1'/>
      <parameter type-id='8f92235e' name='ns_id' filepath='nvme_ctrlr_cmd.c' line='357' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_set_feature_ns' mangled-name='spdk_nvme_ctrlr_cmd_set_feature_ns' filepath='nvme_ctrlr_cmd.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_set_feature_ns'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='384' column='1'/>
      <parameter type-id='b96825af' name='feature' filepath='nvme_ctrlr_cmd.c' line='384' column='1'/>
      <parameter type-id='8f92235e' name='cdw11' filepath='nvme_ctrlr_cmd.c' line='385' column='1'/>
      <parameter type-id='8f92235e' name='cdw12' filepath='nvme_ctrlr_cmd.c' line='385' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='385' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='386' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='386' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='387' column='1'/>
      <parameter type-id='8f92235e' name='ns_id' filepath='nvme_ctrlr_cmd.c' line='387' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_log_page_ext' mangled-name='spdk_nvme_ctrlr_cmd_get_log_page_ext' filepath='nvme_ctrlr_cmd.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_log_page_ext'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='474' column='1'/>
      <parameter type-id='b96825af' name='log_page' filepath='nvme_ctrlr_cmd.c' line='474' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr_cmd.c' line='475' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='475' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='475' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='nvme_ctrlr_cmd.c' line='476' column='1'/>
      <parameter type-id='8f92235e' name='cdw10' filepath='nvme_ctrlr_cmd.c' line='476' column='1'/>
      <parameter type-id='8f92235e' name='cdw11' filepath='nvme_ctrlr_cmd.c' line='477' column='1'/>
      <parameter type-id='8f92235e' name='cdw14' filepath='nvme_ctrlr_cmd.c' line='477' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='478' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='478' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_log_page' mangled-name='spdk_nvme_ctrlr_cmd_get_log_page' filepath='nvme_ctrlr_cmd.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='535' column='1'/>
      <parameter type-id='b96825af' name='log_page' filepath='nvme_ctrlr_cmd.c' line='535' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr_cmd.c' line='536' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='536' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='536' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='nvme_ctrlr_cmd.c' line='537' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='537' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='537' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_abort' mangled-name='spdk_nvme_ctrlr_cmd_abort' filepath='nvme_ctrlr_cmd.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_abort'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='608' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr_cmd.c' line='608' column='1'/>
      <parameter type-id='149c6638' name='cid' filepath='nvme_ctrlr_cmd.c' line='609' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='609' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='609' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_abort_ext' mangled-name='spdk_nvme_ctrlr_cmd_abort_ext' filepath='nvme_ctrlr_cmd.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_abort_ext'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='702' column='1'/>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_ctrlr_cmd.c' line='702' column='1'/>
      <parameter type-id='eaa32e2f' name='cmd_cb_arg' filepath='nvme_ctrlr_cmd.c' line='703' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='704' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='704' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_security_receive' mangled-name='spdk_nvme_ctrlr_cmd_security_receive' filepath='nvme_ctrlr_cmd.c' line='863' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_security_receive'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='863' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr_cmd.c' line='863' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr_cmd.c' line='864' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr_cmd.c' line='864' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='864' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='865' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='865' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='865' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_security_send' mangled-name='spdk_nvme_ctrlr_cmd_security_send' filepath='nvme_ctrlr_cmd.c' line='894' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_security_send'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='894' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr_cmd.c' line='894' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr_cmd.c' line='895' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr_cmd.c' line='895' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='895' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='896' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='896' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='896' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_directive_send' mangled-name='spdk_nvme_ctrlr_cmd_directive_send' filepath='nvme_ctrlr_cmd.c' line='989' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_directive_send'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='989' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr_cmd.c' line='989' column='1'/>
      <parameter type-id='8f92235e' name='doper' filepath='nvme_ctrlr_cmd.c' line='990' column='1'/>
      <parameter type-id='8f92235e' name='dtype' filepath='nvme_ctrlr_cmd.c' line='990' column='1'/>
      <parameter type-id='8f92235e' name='dspec' filepath='nvme_ctrlr_cmd.c' line='990' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='991' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='991' column='1'/>
      <parameter type-id='8f92235e' name='cdw12' filepath='nvme_ctrlr_cmd.c' line='991' column='1'/>
      <parameter type-id='8f92235e' name='cdw13' filepath='nvme_ctrlr_cmd.c' line='992' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='992' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='992' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_directive_receive' mangled-name='spdk_nvme_ctrlr_cmd_directive_receive' filepath='nvme_ctrlr_cmd.c' line='1000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_directive_receive'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_cmd.c' line='1000' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr_cmd.c' line='1000' column='1'/>
      <parameter type-id='8f92235e' name='doper' filepath='nvme_ctrlr_cmd.c' line='1001' column='1'/>
      <parameter type-id='8f92235e' name='dtype' filepath='nvme_ctrlr_cmd.c' line='1001' column='1'/>
      <parameter type-id='8f92235e' name='dspec' filepath='nvme_ctrlr_cmd.c' line='1001' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_cmd.c' line='1002' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_cmd.c' line='1002' column='1'/>
      <parameter type-id='8f92235e' name='cdw12' filepath='nvme_ctrlr_cmd.c' line='1002' column='1'/>
      <parameter type-id='8f92235e' name='cdw13' filepath='nvme_ctrlr_cmd.c' line='1003' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_cmd.c' line='1003' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_cmd.c' line='1003' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_nvme_qpair' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='410' column='1' is-declaration-only='yes' id='7718a4aa'/>
    <class-decl name='spdk_nvme_ctrlr' is-struct='yes' visibility='default' filepath='nvme_internal.h' line='867' column='1' is-declaration-only='yes' id='30a17994'/>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr_ocssd_cmd.c' language='LANG_C99'>
    <function-decl name='spdk_nvme_ctrlr_is_ocssd_supported' mangled-name='spdk_nvme_ctrlr_is_ocssd_supported' filepath='nvme_ctrlr_ocssd_cmd.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_ocssd_supported'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_ocssd_cmd.c' line='10' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ocssd_ctrlr_cmd_geometry' mangled-name='spdk_nvme_ocssd_ctrlr_cmd_geometry' filepath='nvme_ctrlr_ocssd_cmd.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ocssd_ctrlr_cmd_geometry'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_ctrlr_ocssd_cmd.c' line='41' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr_ocssd_cmd.c' line='41' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr_ocssd_cmd.c' line='42' column='1'/>
      <parameter type-id='8f92235e' name='payload_size' filepath='nvme_ctrlr_ocssd_cmd.c' line='42' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr_ocssd_cmd.c' line='43' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr_ocssd_cmd.c' line='43' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_cuse.c' language='LANG_C99'>
    <function-decl name='spdk_nvme_cuse_register' mangled-name='spdk_nvme_cuse_register' filepath='nvme_cuse.c' line='1248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_register'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_cuse.c' line='1248' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_unregister' mangled-name='spdk_nvme_cuse_unregister' filepath='nvme_cuse.c' line='1270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_unregister'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_cuse.c' line='1270' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_update_namespaces' mangled-name='spdk_nvme_cuse_update_namespaces' filepath='nvme_cuse.c' line='1293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_update_namespaces'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_cuse.c' line='1293' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_get_ctrlr_name' mangled-name='spdk_nvme_cuse_get_ctrlr_name' filepath='nvme_cuse.c' line='1299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_get_ctrlr_name'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_cuse.c' line='1299' column='1'/>
      <parameter type-id='26a90f95' name='name' filepath='nvme_cuse.c' line='1299' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_cuse.c' line='1299' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_get_ns_name' mangled-name='spdk_nvme_cuse_get_ns_name' filepath='nvme_cuse.c' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_get_ns_name'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_cuse.c' line='1326' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_cuse.c' line='1326' column='1'/>
      <parameter type-id='26a90f95' name='name' filepath='nvme_cuse.c' line='1326' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_cuse.c' line='1326' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_discovery.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='6b40ccf0' size-in-bits='infinite' id='a8bdf52c'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <class-decl name='spdk_nvme_tcp_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='344' column='1' id='6d63b4d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sectype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='629227c2' visibility='default' filepath='nvmf_spec.h' line='348' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page' size-in-bits='8192' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='416' column='1' id='fd3ac1ab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='genctr' type-id='9c313c2d' visibility='default' filepath='nvmf_spec.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numrec' type-id='9c313c2d' visibility='default' filepath='nvmf_spec.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='recfmt' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved0' type-id='8afe3065' visibility='default' filepath='nvmf_spec.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='entries' type-id='a8bdf52c' visibility='default' filepath='nvmf_spec.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page_entry' size-in-bits='8192' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='371' column='1' id='6b40ccf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='adrfam' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='treq' type-id='e7f43fc8' visibility='default' filepath='nvmf_spec.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='portid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='asqsz' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='3d43e61c' visibility='default' filepath='nvmf_spec.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trsvcid' type-id='d0f1c0cb' visibility='default' filepath='nvmf_spec.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reserved1' type-id='f3fa1b1a' visibility='default' filepath='nvmf_spec.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='traddr' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='tsas' type-id='e874a69d' visibility='default' filepath='nvmf_spec.h' line='412' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_rdma_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='311' column='1' id='210ab761'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdma_qptype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rdma_prtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rdma_cms' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved0' type-id='0f4ddd0b' visibility='default' filepath='nvmf_spec.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rdma_pkey' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved2' type-id='d05e5752' visibility='default' filepath='nvmf_spec.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='382' column='1' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secure_channel' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='386' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_nvme_discovery_cb' type-id='ac8c05a3' filepath='nvme.h' line='1478' column='1' id='3f2e0350'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8048' id='8afe3065'>
      <subrange length='1006' type-id='f0981eeb' id='a0761f50'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1536' id='f3fa1b1a'>
      <subrange length='192' type-id='f0981eeb' id='3fea28a9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='176' id='3d43e61c'>
      <subrange length='22' type-id='f0981eeb' id='41cf2209'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1968' id='d05e5752'>
      <subrange length='246' type-id='f0981eeb' id='ca576a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2040' id='629227c2'>
      <subrange length='255' type-id='f0981eeb' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='f0981eeb' id='53010e10'/>
    </array-type-def>
    <union-decl name='spdk_nvmf_transport_specific_address_subtype' size-in-bits='2048' visibility='default' filepath='nvmf_spec.h' line='354' column='1' id='e874a69d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='355' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rdma' type-id='210ab761' visibility='default' filepath='nvmf_spec.h' line='358' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tcp' type-id='6d63b4d7' visibility='default' filepath='nvmf_spec.h' line='361' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='fd3ac1ab' size-in-bits='64' id='e9dc7ceb'/>
    <pointer-type-def type-id='51ff5e2f' size-in-bits='64' id='ac8c05a3'/>
    <function-decl name='spdk_nvme_ctrlr_get_discovery_log_page' mangled-name='spdk_nvme_ctrlr_get_discovery_log_page' filepath='nvme_discovery.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_discovery_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme_discovery.c' line='137' column='1'/>
      <parameter type-id='3f2e0350' name='cb_fn' filepath='nvme_discovery.c' line='138' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_discovery.c' line='138' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='51ff5e2f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='51104a73'/>
      <parameter type-id='e9dc7ceb'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ns.c' language='LANG_C99'>
    <enum-decl name='spdk_nvme_ana_state' filepath='nvme_spec.h' line='3606' column='1' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_csi' filepath='nvme_spec.h' line='3916' column='1' id='fac3fed3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CSI_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CSI_KV' value='1'/>
      <enumerator name='SPDK_NVME_CSI_ZNS' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_dealloc_logical_block_read_value' filepath='nvme_spec.h' line='3016' column='1' id='d59d4727'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_DEALLOC_NOT_REPORTED' value='0'/>
      <enumerator name='SPDK_NVME_DEALLOC_READ_00' value='1'/>
      <enumerator name='SPDK_NVME_DEALLOC_READ_FF' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_pi_type' filepath='nvme_spec.h' line='3933' column='1' id='b5f5d02e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_DISABLE' value='0'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE1' value='1'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE2' value='2'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='uuid.h' line='21' column='1' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab5a1' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_nvme_dealloc_logical_block_read_value_t' type-id='d59d4727' filepath='nvme_ns.c' line='341' column='1' id='80b8ce90'/>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='uuid.h' line='22' column='1' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='2e8e7df0' const='yes' id='61222049'/>
    <pointer-type-def type-id='61222049' size-in-bits='64' id='4bb8fbd9'/>
    <qualified-type-def type-id='4e56c4fd' const='yes' id='1fb4ca72'/>
    <pointer-type-def type-id='1fb4ca72' size-in-bits='64' id='419a8888'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='64' id='9f7200cf'/>
    <function-decl name='spdk_nvme_ns_get_id' mangled-name='spdk_nvme_ns_get_id' filepath='nvme_ns.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_id'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='231' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_is_active' mangled-name='spdk_nvme_ns_is_active' filepath='nvme_ns.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_is_active'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='237' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ctrlr' mangled-name='spdk_nvme_ns_get_ctrlr' filepath='nvme_ns.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ctrlr'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='259' column='1'/>
      <return type-id='0d7532a2'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_max_io_xfer_size' mangled-name='spdk_nvme_ns_get_max_io_xfer_size' filepath='nvme_ns.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_max_io_xfer_size'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='265' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_sector_size' mangled-name='spdk_nvme_ns_get_sector_size' filepath='nvme_ns.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_sector_size'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='271' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_extended_sector_size' mangled-name='spdk_nvme_ns_get_extended_sector_size' filepath='nvme_ns.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_extended_sector_size'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='277' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_num_sectors' mangled-name='spdk_nvme_ns_get_num_sectors' filepath='nvme_ns.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_num_sectors'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='283' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_size' mangled-name='spdk_nvme_ns_get_size' filepath='nvme_ns.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_size'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='289' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_flags' mangled-name='spdk_nvme_ns_get_flags' filepath='nvme_ns.c' line='295' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_flags'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='295' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_pi_type' mangled-name='spdk_nvme_ns_get_pi_type' filepath='nvme_ns.c' line='301' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_pi_type'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='301' column='1'/>
      <return type-id='b5f5d02e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_supports_extended_lba' mangled-name='spdk_nvme_ns_supports_extended_lba' filepath='nvme_ns.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_supports_extended_lba'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='306' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_supports_compare' mangled-name='spdk_nvme_ns_supports_compare' filepath='nvme_ns.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_supports_compare'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='312' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_md_size' mangled-name='spdk_nvme_ns_get_md_size' filepath='nvme_ns.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_md_size'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='318' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_format_index' mangled-name='spdk_nvme_ns_get_format_index' filepath='nvme_ns.c' line='324' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_format_index'>
      <parameter type-id='419a8888' name='nsdata' filepath='nvme_ns.c' line='324' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_data' mangled-name='spdk_nvme_ns_get_data' filepath='nvme_ns.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_data'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='334' column='1'/>
      <return type-id='419a8888'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_dealloc_logical_block_read_value' mangled-name='spdk_nvme_ns_get_dealloc_logical_block_read_value' filepath='nvme_ns.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_dealloc_logical_block_read_value'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='345' column='1'/>
      <return type-id='80b8ce90'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_optimal_io_boundary' mangled-name='spdk_nvme_ns_get_optimal_io_boundary' filepath='nvme_ns.c' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_optimal_io_boundary'>
      <parameter type-id='663c4b46' name='ns' filepath='nvme_ns.c' line='358' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_nguid' mangled-name='spdk_nvme_ns_get_nguid' filepath='nvme_ns.c' line='399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_nguid'>
      <parameter type-id='4bb8fbd9' name='ns' filepath='nvme_ns.c' line='399' column='1'/>
      <return type-id='9f7200cf'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_uuid' mangled-name='spdk_nvme_ns_get_uuid' filepath='nvme_ns.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_uuid'>
      <parameter type-id='4bb8fbd9' name='ns' filepath='nvme_ns.c' line='415' column='1'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_csi' mangled-name='spdk_nvme_ns_get_csi' filepath='nvme_ns.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_csi'>
      <parameter type-id='4bb8fbd9' name='ns' filepath='nvme_ns.c' line='460' column='1'/>
      <return type-id='fac3fed3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ana_group_id' mangled-name='spdk_nvme_ns_get_ana_group_id' filepath='nvme_ns.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ana_group_id'>
      <parameter type-id='4bb8fbd9' name='ns' filepath='nvme_ns.c' line='502' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ana_state' mangled-name='spdk_nvme_ns_get_ana_state' filepath='nvme_ns.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ana_state'>
      <parameter type-id='4bb8fbd9' name='ns' filepath='nvme_ns.c' line='508' column='1'/>
      <return type-id='78649e32'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ns_cmd.c' language='LANG_C99'>
    <enum-decl name='spdk_nvme_reservation_acquire_action' filepath='nvme_spec.h' line='3065' column='1' id='a2f65d1a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_ACQUIRE' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_PREEMPT' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_PREEMPT_ABORT' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_register_action' filepath='nvme_spec.h' line='3138' column='1' id='c065b103'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_REGISTER_KEY' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_UNREGISTER_KEY' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_REPLACE_KEY' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_register_cptpl' filepath='nvme_spec.h' line='3129' column='1' id='2835de9e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_NO_CHANGES' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_CLEAR_POWER_ON' value='2'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_PERSIST_POWER_LOSS' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_release_action' filepath='nvme_spec.h' line='3161' column='1' id='51443505'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_RELEASE' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_CLEAR' value='1'/>
    </enum-decl>
