<abi-corpus version='2.1' soname='libspdk_conf.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_conf_allocate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_disable_sections_merge' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_find_section' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_first_section' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_next_section' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_boolval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_intval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_nmval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_num' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_nval' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_get_val' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_section_match_prefix' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_conf_set_as_default' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='conf.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='spdk_conf' size-in-bits='256' is-struct='yes' visibility='default' id='fb82eca6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_section' type-id='4582c934' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='section' type-id='4582c934' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='merge_sections' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_conf_item' size-in-bits='192' is-struct='yes' visibility='default' id='91c6855c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='fbd97e6a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='val' type-id='74ff11fe' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_conf_section' size-in-bits='256' is-struct='yes' visibility='default' id='4611d1ce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='4582c934' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='num' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='item' type-id='fbd97e6a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_conf_value' size-in-bits='128' is-struct='yes' visibility='default' id='4b90bad8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='74ff11fe' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='value' type-id='26a90f95' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='4611d1ce' const='yes' id='568e44c1'/>
    <pointer-type-def type-id='568e44c1' size-in-bits='64' id='2cf67df1'/>
    <pointer-type-def type-id='fb82eca6' size-in-bits='64' id='e310b6cc'/>
    <pointer-type-def type-id='91c6855c' size-in-bits='64' id='fbd97e6a'/>
    <pointer-type-def type-id='4611d1ce' size-in-bits='64' id='4582c934'/>
    <pointer-type-def type-id='4b90bad8' size-in-bits='64' id='74ff11fe'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_conf_allocate' mangled-name='spdk_conf_allocate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_allocate'>
      <return type-id='e310b6cc'/>
    </function-decl>
    <function-decl name='spdk_conf_free' mangled-name='spdk_conf_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_free'>
      <parameter type-id='e310b6cc' name='cp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_conf_find_section' mangled-name='spdk_conf_find_section' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_find_section'>
      <parameter type-id='e310b6cc' name='cp'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='4582c934'/>
    </function-decl>
    <function-decl name='spdk_conf_first_section' mangled-name='spdk_conf_first_section' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_first_section'>
      <parameter type-id='e310b6cc' name='cp'/>
      <return type-id='4582c934'/>
    </function-decl>
    <function-decl name='spdk_conf_next_section' mangled-name='spdk_conf_next_section' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_next_section'>
      <parameter type-id='4582c934' name='sp'/>
      <return type-id='4582c934'/>
    </function-decl>
    <function-decl name='spdk_conf_section_match_prefix' mangled-name='spdk_conf_section_match_prefix' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_match_prefix'>
      <parameter type-id='2cf67df1' name='sp'/>
      <parameter type-id='80f4b756' name='name_prefix'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_name' mangled-name='spdk_conf_section_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_name'>
      <parameter type-id='2cf67df1' name='sp'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_num' mangled-name='spdk_conf_section_get_num' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_num'>
      <parameter type-id='2cf67df1' name='sp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_nmval' mangled-name='spdk_conf_section_get_nmval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_nmval'>
      <parameter type-id='4582c934' name='sp'/>
      <parameter type-id='80f4b756' name='key'/>
      <parameter type-id='95e97e5e' name='idx1'/>
      <parameter type-id='95e97e5e' name='idx2'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_nval' mangled-name='spdk_conf_section_get_nval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_nval'>
      <parameter type-id='4582c934' name='sp'/>
      <parameter type-id='80f4b756' name='key'/>
      <parameter type-id='95e97e5e' name='idx'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_val' mangled-name='spdk_conf_section_get_val' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_val'>
      <parameter type-id='4582c934' name='sp'/>
      <parameter type-id='80f4b756' name='key'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_intval' mangled-name='spdk_conf_section_get_intval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_intval'>
      <parameter type-id='4582c934' name='sp'/>
      <parameter type-id='80f4b756' name='key'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_conf_section_get_boolval' mangled-name='spdk_conf_section_get_boolval' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_section_get_boolval'>
      <parameter type-id='4582c934' name='sp'/>
      <parameter type-id='80f4b756' name='key'/>
      <parameter type-id='c894953d' name='default_val'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_conf_read' mangled-name='spdk_conf_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_read'>
      <parameter type-id='e310b6cc' name='cp'/>
      <parameter type-id='80f4b756' name='file'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_conf_set_as_default' mangled-name='spdk_conf_set_as_default' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_set_as_default'>
      <parameter type-id='e310b6cc' name='cp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_conf_disable_sections_merge' mangled-name='spdk_conf_disable_sections_merge' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_conf_disable_sections_merge'>
      <parameter type-id='e310b6cc' name='cp'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
