<abi-corpus version='2.1' soname='libspdk_log.so.6.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_deprecation_get_description' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_hits' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_remove_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_tag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_clear_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_deprecated' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_deprecation_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_enable_timestamps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_for_each_deprecation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_first_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_next_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_print_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_print_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_to_syslog_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_usage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vlog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='log.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' filepath='log.h' line='52' column='1' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='logfunc' type-id='bba1f737' filepath='log.h' line='32' column='1' id='049770e8'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <pointer-type-def type-id='049770e8' size-in-bits='64' id='c7712a73'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_log_set_level' mangled-name='spdk_log_set_level' filepath='log.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_level'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='29' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_level' mangled-name='spdk_log_get_level' filepath='log.c' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_level'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_set_print_level' mangled-name='spdk_log_set_print_level' filepath='log.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_print_level'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='42' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_print_level' mangled-name='spdk_log_get_print_level' filepath='log.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_print_level'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_open' mangled-name='spdk_log_open' filepath='log.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_open'>
      <parameter type-id='c7712a73' name='logf' filepath='log.c' line='55' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_close' mangled-name='spdk_log_close' filepath='log.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_close'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_enable_timestamps' mangled-name='spdk_log_enable_timestamps' filepath='log.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_enable_timestamps'>
      <parameter type-id='c894953d' name='value' filepath='log.c' line='73' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log' mangled-name='spdk_log' filepath='log.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='104' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='104' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='104' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='104' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='105' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_to_syslog_level' mangled-name='spdk_log_to_syslog_level' filepath='log.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_to_syslog_level'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='115' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vlog' mangled-name='spdk_vlog' filepath='log.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vlog'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='137' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='137' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='137' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='137' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='138' column='1'/>
      <parameter type-id='b7f2d5e6' name='ap' filepath='log.c' line='138' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_dump' mangled-name='spdk_log_dump' filepath='log.c' line='224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_dump'>
      <parameter type-id='822cd80b' name='fp' filepath='log.c' line='224' column='1'/>
      <parameter type-id='80f4b756' name='label' filepath='log.c' line='224' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='log.c' line='224' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='log.c' line='224' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='bba1f737'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2448a865'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='log_deprecated.c' language='LANG_C99'>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='spdk_log_for_each_deprecation_fn' type-id='f3b880d6' filepath='log.h' line='306' column='1' id='2a1ead45'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <qualified-type-def type-id='9eea344e' const='yes' id='43598b17'/>
    <pointer-type-def type-id='43598b17' size-in-bits='64' id='42f63107'/>
    <pointer-type-def type-id='ddc88dac' size-in-bits='64' id='f3b880d6'/>
    <pointer-type-def type-id='9eea344e' size-in-bits='64' id='e1c4d514'/>
    <pointer-type-def type-id='e1c4d514' size-in-bits='64' id='a6dbb09a'/>
    <class-decl name='spdk_deprecation' is-struct='yes' visibility='default' filepath='log_deprecated.c' line='11' column='1' is-declaration-only='yes' id='9eea344e'/>
    <function-decl name='spdk_log_deprecation_register' mangled-name='spdk_log_deprecation_register' filepath='log_deprecated.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_deprecation_register'>
      <parameter type-id='80f4b756' name='tag' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='80f4b756' name='description' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='80f4b756' name='remove_release' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='8f92235e' name='rate_limit_seconds' filepath='log_deprecated.c' line='47' column='1'/>
      <parameter type-id='a6dbb09a' name='depp' filepath='log_deprecated.c' line='47' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_deprecated' mangled-name='spdk_log_deprecated' filepath='log_deprecated.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_deprecated'>
      <parameter type-id='e1c4d514' name='dep' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='8f92235e' name='line' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log_deprecated.c' line='77' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_for_each_deprecation' mangled-name='spdk_log_for_each_deprecation' filepath='log_deprecated.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_for_each_deprecation'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='log_deprecated.c' line='107' column='1'/>
      <parameter type-id='2a1ead45' name='fn' filepath='log_deprecated.c' line='107' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_tag' mangled-name='spdk_deprecation_get_tag' filepath='log_deprecated.c' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_tag'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='123' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_description' mangled-name='spdk_deprecation_get_description' filepath='log_deprecated.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_description'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='129' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_remove_release' mangled-name='spdk_deprecation_get_remove_release' filepath='log_deprecated.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_remove_release'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='135' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_hits' mangled-name='spdk_deprecation_get_hits' filepath='log_deprecated.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_hits'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='141' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-type size-in-bits='64' id='ddc88dac'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='e1c4d514'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='log_flags.c' language='LANG_C99'>
    <class-decl name='spdk_log_flag' size-in-bits='256' is-struct='yes' visibility='default' filepath='log.h' line='183' column='1' id='c29bb739'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='log.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='log.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enabled' type-id='c894953d' visibility='default' filepath='log.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='log.h' line='184' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ce203111' visibility='default' filepath='log.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b7ad7fe1' visibility='default' filepath='log.h' line='184' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c29bb739' size-in-bits='64' id='ce203111'/>
    <pointer-type-def type-id='ce203111' size-in-bits='64' id='b7ad7fe1'/>
    <function-decl name='spdk_log_register_flag' mangled-name='spdk_log_register_flag' filepath='log_flags.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_register_flag'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='27' column='1'/>
      <parameter type-id='ce203111' name='flag' filepath='log_flags.c' line='27' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_flag' mangled-name='spdk_log_get_flag' filepath='log_flags.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_flag'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='54' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_log_set_flag' mangled-name='spdk_log_set_flag' filepath='log_flags.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_flag'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='88' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_clear_flag' mangled-name='spdk_log_clear_flag' filepath='log_flags.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_clear_flag'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='94' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_get_first_flag' mangled-name='spdk_log_get_first_flag' filepath='log_flags.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_first_flag'>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_get_next_flag' mangled-name='spdk_log_get_next_flag' filepath='log_flags.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_next_flag'>
      <parameter type-id='ce203111' name='flag' filepath='log_flags.c' line='106' column='1'/>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_usage' mangled-name='spdk_log_usage' filepath='log_flags.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_usage'>
      <parameter type-id='822cd80b' name='f' filepath='log_flags.c' line='112' column='1'/>
      <parameter type-id='80f4b756' name='log_arg' filepath='log_flags.c' line='112' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
