<abi-corpus version='2.1' soname='libspdk_idxd.so.10.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_idxd_detach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_probe' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_process_events' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_put_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_set_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_copy_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_dualcast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_raw_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='idxd.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' filepath='env.h' line='698' column='1' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='700' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='702' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='idxd_hw_desc' size-in-bits='512' is-struct='yes' visibility='default' filepath='idxd_spec.h' line='194' column='1' id='7f046df4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pasid' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='priv' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='opcode' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='completion_addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='int_handle' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' filepath='env.h' line='659' column='1' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='660' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='661' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='663' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' filepath='env.h' line='681' column='1' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='686' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default' filepath='env.h' line='689' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default' filepath='env.h' line='691' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default' filepath='env.h' line='693' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default' filepath='env.h' line='695' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='711' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' filepath='env.h' line='666' column='1' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='671' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='env.h' line='710' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='710' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='240' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='234' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='226' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src2_addr' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_dst_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src2_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filter_flags' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_inputs' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='231' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='254' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flag' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='b6925fd4' visibility='default' filepath='idxd_spec.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='261' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='263' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd' type-id='0f4ddd0b' visibility='default' filepath='idxd_spec.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src_app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='src_app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dest_ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dest_app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='dest_app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='273' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='245' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='0f4ddd0b' visibility='default' filepath='idxd_spec.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default' filepath='idxd_spec.h' line='252' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eed' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_idxd_attach_cb' type-id='dd80c2c9' filepath='idxd.h' line='72' column='1' id='6bdef912'/>
    <typedef-decl name='spdk_idxd_probe_cb' type-id='d6185de6' filepath='idxd.h' line='81' column='1' id='ba2310ed'/>
    <typedef-decl name='spdk_idxd_req_cb' type-id='1ed1e4cd' filepath='idxd.h' line='63' column='1' id='576652af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='104' id='b6925fd4'>
      <subrange length='13' type-id='f0981eed' id='487fded1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' id='014804d6'>
      <subrange length='24' type-id='f0981eed' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='f0981eed' id='53010e10'/>
    </array-type-def>
    <union-decl name='__anonymous_union__4' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='idxd_spec.h' line='225' column='1' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='iaa' type-id='e7f43f75' visibility='default' filepath='idxd_spec.h' line='232' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='expected_res' type-id='b96825af' visibility='default' filepath='idxd_spec.h' line='233' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delta' type-id='e7f43f74' visibility='default' filepath='idxd_spec.h' line='237' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delta_rec_size' type-id='8f92235e' visibility='default' filepath='idxd_spec.h' line='238' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dest2' type-id='9c313c2d' visibility='default' filepath='idxd_spec.h' line='239' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='crc32c' type-id='e7f43f73' visibility='default' filepath='idxd_spec.h' line='244' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_chk' type-id='e7f43f78' visibility='default' filepath='idxd_spec.h' line='253' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_ins' type-id='e7f43f76' visibility='default' filepath='idxd_spec.h' line='262' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_upd' type-id='e7f43f77' visibility='default' filepath='idxd_spec.h' line='274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='op_specific' type-id='014804d6' visibility='default' filepath='idxd_spec.h' line='275' column='1'/>
