<abi-corpus version='2.1' soname='libspdk_env_dpdk.so.12.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_call_unaffinitized' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_delay_us' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_malloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_dma_zmalloc_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_pci_device_get_socket_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_subdevice_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_subvendor_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_get_vendor_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_is_removed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_unclaim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_driver_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_enumerate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_event_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_for_each_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_get_event' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_hook_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_idxd_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_ioat_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_nvme_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_register_device_provider' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_register_error_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_unhook_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_unregister_error_handler' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_virtio_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_pci_vmd_get_driver' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_process_is_primary' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_dequeue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_enqueue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ring_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_unaffinitize_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vtophys' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zmalloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='env.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_ring_type' id='3bd6ac02'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_RING_TYPE_SP_SC' value='0'/>
      <enumerator name='SPDK_RING_TYPE_MP_SC' value='1'/>
      <enumerator name='SPDK_RING_TYPE_MP_MC' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' id='79989e9c'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_mempool_mem_cb_t' type-id='c2cb8a3a' id='e8857a9b'/>
    <typedef-decl name='spdk_mempool_obj_cb_t' type-id='84941752' id='69ad4ac3'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='ae574a67' const='yes' id='a94dd646'/>
    <pointer-type-def type-id='a94dd646' size-in-bits='64' id='f1888c04'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='ae574a67' size-in-bits='64' id='564ba9df'/>
    <pointer-type-def type-id='e8857a9b' size-in-bits='64' id='7436b056'/>
    <pointer-type-def type-id='69ad4ac3' size-in-bits='64' id='e7553942'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' id='5ad9edb6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_mempool' is-struct='yes' visibility='default' is-declaration-only='yes' id='ae574a67'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_malloc' mangled-name='spdk_malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_malloc'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_zmalloc' mangled-name='spdk_zmalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zmalloc'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_realloc' mangled-name='spdk_realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_realloc'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_free' mangled-name='spdk_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_free'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc_socket' mangled-name='spdk_dma_malloc_socket' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc_socket'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc_socket' mangled-name='spdk_dma_zmalloc_socket' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc_socket'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_malloc' mangled-name='spdk_dma_malloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_malloc'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_zmalloc' mangled-name='spdk_dma_zmalloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_zmalloc'>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_realloc' mangled-name='spdk_dma_realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_realloc'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='b59d7dce' name='align'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_dma_free' mangled-name='spdk_dma_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dma_free'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve_aligned' mangled-name='spdk_memzone_reserve_aligned' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve_aligned'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <parameter type-id='f0981eed' name='flags'/>
      <parameter type-id='f0981eed' name='align'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_reserve' mangled-name='spdk_memzone_reserve' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_reserve'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <parameter type-id='f0981eed' name='flags'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_lookup' mangled-name='spdk_memzone_lookup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_lookup'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_memzone_free' mangled-name='spdk_memzone_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_free'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memzone_dump' mangled-name='spdk_memzone_dump' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memzone_dump'>
      <parameter type-id='822cd80b' name='f'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_create_ctor' mangled-name='spdk_mempool_create_ctor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create_ctor'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b59d7dce' name='count'/>
      <parameter type-id='b59d7dce' name='ele_size'/>
      <parameter type-id='b59d7dce' name='cache_size'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <parameter type-id='e7553942' name='obj_init'/>
      <parameter type-id='eaa32e2f' name='obj_init_arg'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_create' mangled-name='spdk_mempool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_create'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='b59d7dce' name='count'/>
      <parameter type-id='b59d7dce' name='ele_size'/>
      <parameter type-id='b59d7dce' name='cache_size'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_name' mangled-name='spdk_mempool_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_name'>
      <parameter type-id='564ba9df' name='mp'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_mempool_free' mangled-name='spdk_mempool_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_free'>
      <parameter type-id='564ba9df' name='mp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get' mangled-name='spdk_mempool_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get'>
      <parameter type-id='564ba9df' name='mp'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_mempool_get_bulk' mangled-name='spdk_mempool_get_bulk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_get_bulk'>
      <parameter type-id='564ba9df' name='mp'/>
      <parameter type-id='63e171df' name='ele_arr'/>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mempool_put' mangled-name='spdk_mempool_put' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put'>
      <parameter type-id='564ba9df' name='mp'/>
      <parameter type-id='eaa32e2f' name='ele'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_put_bulk' mangled-name='spdk_mempool_put_bulk' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_put_bulk'>
      <parameter type-id='564ba9df' name='mp'/>
      <parameter type-id='63e171df' name='ele_arr'/>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mempool_count' mangled-name='spdk_mempool_count' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_count'>
      <parameter type-id='f1888c04' name='pool'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_mempool_obj_iter' mangled-name='spdk_mempool_obj_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_obj_iter'>
      <parameter type-id='564ba9df' name='mp'/>
      <parameter type-id='e7553942' name='obj_cb'/>
      <parameter type-id='eaa32e2f' name='obj_cb_arg'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_mem_iter' mangled-name='spdk_mempool_mem_iter' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_mem_iter'>
      <parameter type-id='564ba9df' name='mp'/>
      <parameter type-id='7436b056' name='mem_cb'/>
      <parameter type-id='eaa32e2f' name='mem_cb_arg'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_mempool_lookup' mangled-name='spdk_mempool_lookup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mempool_lookup'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='564ba9df'/>
    </function-decl>
    <function-decl name='spdk_process_is_primary' mangled-name='spdk_process_is_primary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_process_is_primary'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks' mangled-name='spdk_get_ticks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_get_ticks_hz' mangled-name='spdk_get_ticks_hz' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_get_ticks_hz'>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_delay_us' mangled-name='spdk_delay_us' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_delay_us'>
      <parameter type-id='f0981eed' name='us'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pause' mangled-name='spdk_pause' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pause'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_unaffinitize_thread' mangled-name='spdk_unaffinitize_thread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unaffinitize_thread'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_call_unaffinitized' mangled-name='spdk_call_unaffinitized' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_call_unaffinitized'>
      <parameter type-id='5ad9edb6' name='cb'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_ring_create' mangled-name='spdk_ring_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_create'>
      <parameter type-id='3bd6ac02' name='type'/>
      <parameter type-id='b59d7dce' name='count'/>
      <parameter type-id='95e97e5e' name='socket_id'/>
      <return type-id='b2192338'/>
    </function-decl>
    <function-decl name='spdk_ring_free' mangled-name='spdk_ring_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_free'>
      <parameter type-id='b2192338' name='ring'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ring_count' mangled-name='spdk_ring_count' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_count'>
      <parameter type-id='b2192338' name='ring'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_enqueue' mangled-name='spdk_ring_enqueue' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_enqueue'>
      <parameter type-id='b2192338' name='ring'/>
      <parameter type-id='63e171df' name='objs'/>
      <parameter type-id='b59d7dce' name='count'/>
      <parameter type-id='78c01427' name='free_space'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ring_dequeue' mangled-name='spdk_ring_dequeue' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ring_dequeue'>
      <parameter type-id='b2192338' name='ring'/>
      <parameter type-id='63e171df' name='objs'/>
      <parameter type-id='b59d7dce' name='count'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_dump_mem_stats' mangled-name='spdk_env_dpdk_dump_mem_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_dump_mem_stats'>
      <parameter type-id='822cd80b' name='file'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='84941752'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c2cb8a3a'>
      <parameter type-id='564ba9df'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='f0981eed'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='init.c' language='LANG_C99'>
    <class-decl name='spdk_env_opts' size-in-bits='896' is-struct='yes' visibility='default' id='ca9dface'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='core_mask' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lcore_map' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='shm_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='mem_channel' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='main_core' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mem_size' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='no_pci' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='hugepage_single_segments' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='unlink_hugepage' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='num_pci_addr' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='hugedir' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='pci_blocked' type-id='a714fad8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pci_allowed' type-id='a714fad8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='iova_mode' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='base_virtaddr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='env_context' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vf_token' type-id='80f4b756' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='ca9dface' const='yes' id='d4ecc0a1'/>
    <pointer-type-def type-id='d4ecc0a1' size-in-bits='64' id='bbb31ad1'/>
    <pointer-type-def type-id='ca9dface' size-in-bits='64' id='52dba564'/>
    <function-decl name='spdk_env_opts_init' mangled-name='spdk_env_opts_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_opts_init'>
      <parameter type-id='52dba564' name='opts'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_init' mangled-name='spdk_env_dpdk_post_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_init'>
      <parameter type-id='c894953d' name='legacy_mem'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_post_fini' mangled-name='spdk_env_dpdk_post_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_post_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_init' mangled-name='spdk_env_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_init'>
      <parameter type-id='bbb31ad1' name='opts'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_fini' mangled-name='spdk_env_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_dpdk_external_init' mangled-name='spdk_env_dpdk_external_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_dpdk_external_init'>
      <return type-id='c894953d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='memory.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_mem_map_notify_action' id='4c36f7b6'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_REGISTER' value='0'/>
      <enumerator name='SPDK_MEM_MAP_NOTIFY_UNREGISTER' value='1'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='5f40038e' size-in-bits='16777216' id='61210451'>
      <subrange length='262144' type-id='f0981eeb' id='67de4cb2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='3711b4af' size-in-bits='32768' id='502803d3'>
      <subrange length='512' type-id='f0981eeb' id='c11630dd'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='map_1gb' size-in-bits='32768' is-struct='yes' visibility='default' id='831232c8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='map' type-id='502803d3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='map_256tb' size-in-bits='16777216' is-struct='yes' visibility='default' id='fa55d80d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='map' type-id='61210451' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='map_2mb' size-in-bits='64' is-struct='yes' visibility='default' id='3711b4af'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='translation_2mb' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_mem_map' size-in-bits='16777920' is-struct='yes' visibility='default' id='ba933a44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='map_256tb' type-id='fa55d80d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16777216'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16777536'>
        <var-decl name='default_translation' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16777600'>
        <var-decl name='ops' type-id='23691567' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16777728'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16777792'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_mem_map_ops' size-in-bits='128' is-struct='yes' visibility='default' id='23691567'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='notify_cb' type-id='3d8a3989' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='are_contiguous' type-id='8cf6f4bf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='73c19462' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='81bc6d58' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='spdk_mem_map_contiguous_translations' type-id='0f094131' id='8cf6f4bf'/>
    <typedef-decl name='spdk_mem_map_notify_cb' type-id='bc7911b1' id='3d8a3989'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <qualified-type-def type-id='ba933a44' const='yes' id='36a99011'/>
    <pointer-type-def type-id='36a99011' size-in-bits='64' id='47ee0ce1'/>
    <qualified-type-def type-id='23691567' const='yes' id='a2fd39ea'/>
    <pointer-type-def type-id='a2fd39ea' size-in-bits='64' id='54a1e940'/>
    <pointer-type-def type-id='888809fd' size-in-bits='64' id='0f094131'/>
    <pointer-type-def type-id='9c62c91d' size-in-bits='64' id='bc7911b1'/>
    <pointer-type-def type-id='831232c8' size-in-bits='64' id='5f40038e'/>
    <pointer-type-def type-id='ba933a44' size-in-bits='64' id='73c19462'/>
    <pointer-type-def type-id='73c19462' size-in-bits='64' id='81bc6d58'/>
    <function-decl name='spdk_mem_map_alloc' mangled-name='spdk_mem_map_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_alloc'>
      <parameter type-id='9c313c2d' name='default_translation'/>
      <parameter type-id='54a1e940' name='ops'/>
      <parameter type-id='eaa32e2f' name='cb_ctx'/>
      <return type-id='73c19462'/>
    </function-decl>
    <function-decl name='spdk_mem_map_free' mangled-name='spdk_mem_map_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_free'>
      <parameter type-id='81bc6d58' name='pmap'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_mem_register' mangled-name='spdk_mem_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_register'>
      <parameter type-id='eaa32e2f' name='vaddr'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_unregister' mangled-name='spdk_mem_unregister' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_unregister'>
      <parameter type-id='eaa32e2f' name='vaddr'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_set_translation' mangled-name='spdk_mem_map_set_translation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_set_translation'>
      <parameter type-id='73c19462' name='map'/>
      <parameter type-id='9c313c2d' name='vaddr'/>
      <parameter type-id='9c313c2d' name='size'/>
      <parameter type-id='9c313c2d' name='translation'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_clear_translation' mangled-name='spdk_mem_map_clear_translation' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_clear_translation'>
      <parameter type-id='73c19462' name='map'/>
      <parameter type-id='9c313c2d' name='vaddr'/>
      <parameter type-id='9c313c2d' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_map_translate' mangled-name='spdk_mem_map_translate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_map_translate'>
      <parameter type-id='47ee0ce1' name='map'/>
      <parameter type-id='9c313c2d' name='vaddr'/>
      <parameter type-id='5d6479ae' name='size'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_iommu_is_enabled' mangled-name='spdk_iommu_is_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iommu_is_enabled'>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_vtophys' mangled-name='spdk_vtophys' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vtophys'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='5d6479ae' name='size'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_mem_get_fd_and_offset' mangled-name='spdk_mem_get_fd_and_offset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_get_fd_and_offset'>
      <parameter type-id='eaa32e2f' name='vaddr'/>
      <parameter type-id='5d6479ae' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='888809fd'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9c62c91d'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='73c19462'/>
      <parameter type-id='4c36f7b6'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci.c' language='LANG_C99'>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device_provider' size-in-bits='320' is-struct='yes' visibility='default' id='dec91549'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attach_cb' type-id='e3c341c5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='detach_cb' type-id='ce0b566a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_driver' size-in-bits='2560' is-struct='yes' visibility='default' id='469e1bd7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver_buf' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='driver' type-id='f627881a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='id_table' type-id='0691a753' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='drv_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='cb_fn' type-id='963d1819' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='35ee3f91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a10e5361' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='a10bedff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='5ac7664f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eec' id='253c2d2a'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='spdk_pci_enum_cb' type-id='5761ccbf' id='963d1819'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <qualified-type-def type-id='ec72f59a' const='yes' id='e81a0cd5'/>
    <pointer-type-def type-id='e81a0cd5' size-in-bits='64' id='6002756d'/>
    <qualified-type-def type-id='86ef9a2b' const='yes' id='a69f6a68'/>
    <pointer-type-def type-id='a69f6a68' size-in-bits='64' id='8ef445e6'/>
    <qualified-type-def type-id='a41463d8' const='yes' id='d0365b6b'/>
    <pointer-type-def type-id='d0365b6b' size-in-bits='64' id='0691a753'/>
    <pointer-type-def type-id='630f2781' size-in-bits='64' id='e3c341c5'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='7c9d37e3' size-in-bits='64' id='5761ccbf'/>
    <pointer-type-def type-id='14fd6a7c' size-in-bits='64' id='f627881a'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' id='a714fad8'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='dec91549' size-in-bits='64' id='35ee3f91'/>
    <pointer-type-def type-id='35ee3f91' size-in-bits='64' id='a10e5361'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='a10bedff' size-in-bits='64' id='5ac7664f'/>
    <pointer-type-def type-id='a41463d8' size-in-bits='64' id='1f08f56e'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='8382c070' size-in-bits='64' id='ce0b566a'/>
    <pointer-type-def type-id='28bf3cba' size-in-bits='64' id='6c70ec84'/>
    <class-decl name='rte_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='14fd6a7c'/>
    <function-decl name='spdk_pci_driver_register' mangled-name='spdk_pci_driver_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_driver_register'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='1f08f56e' name='id_table'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_nvme_get_driver' mangled-name='spdk_pci_nvme_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_nvme_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_get_driver' mangled-name='spdk_pci_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_driver'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='a10bedff'/>
    </function-decl>
    <function-decl name='spdk_pci_device_detach' mangled-name='spdk_pci_device_detach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_detach'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_attach' mangled-name='spdk_pci_device_attach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_attach'>
      <parameter type-id='a10bedff' name='driver'/>
      <parameter type-id='963d1819' name='enum_cb'/>
      <parameter type-id='eaa32e2f' name='enum_ctx'/>
      <parameter type-id='a714fad8' name='pci_address'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_enumerate' mangled-name='spdk_pci_enumerate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_enumerate'>
      <parameter type-id='a10bedff' name='driver'/>
      <parameter type-id='963d1819' name='enum_cb'/>
      <parameter type-id='eaa32e2f' name='enum_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_for_each_device' mangled-name='spdk_pci_for_each_device' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_for_each_device'>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <parameter type-id='6c70ec84' name='fn'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_map_bar' mangled-name='spdk_pci_device_map_bar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_map_bar'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='8f92235e' name='bar'/>
      <parameter type-id='63e171df' name='mapped_addr'/>
      <parameter type-id='5d6479ae' name='phys_addr'/>
      <parameter type-id='5d6479ae' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unmap_bar' mangled-name='spdk_pci_device_unmap_bar' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unmap_bar'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='8f92235e' name='bar'/>
      <parameter type-id='eaa32e2f' name='addr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_enable_interrupt' mangled-name='spdk_pci_device_enable_interrupt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_enable_interrupt'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_disable_interrupt' mangled-name='spdk_pci_device_disable_interrupt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_disable_interrupt'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_interrupt_efd' mangled-name='spdk_pci_device_get_interrupt_efd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_interrupt_efd'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_domain' mangled-name='spdk_pci_device_get_domain' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_domain'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_bus' mangled-name='spdk_pci_device_get_bus' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_bus'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_dev' mangled-name='spdk_pci_device_get_dev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_dev'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_func' mangled-name='spdk_pci_device_get_func' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_func'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_vendor_id' mangled-name='spdk_pci_device_get_vendor_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_vendor_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_device_id' mangled-name='spdk_pci_device_get_device_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_device_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subvendor_id' mangled-name='spdk_pci_device_get_subvendor_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subvendor_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_subdevice_id' mangled-name='spdk_pci_device_get_subdevice_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_subdevice_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_id' mangled-name='spdk_pci_device_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='a41463d8'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_socket_id' mangled-name='spdk_pci_device_get_socket_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_socket_id'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read' mangled-name='spdk_pci_device_cfg_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='eaa32e2f' name='value'/>
      <parameter type-id='8f92235e' name='len'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write' mangled-name='spdk_pci_device_cfg_write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='eaa32e2f' name='value'/>
      <parameter type-id='8f92235e' name='len'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read8' mangled-name='spdk_pci_device_cfg_read8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read8'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='ae3e8ca6' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write8' mangled-name='spdk_pci_device_cfg_write8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write8'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='b96825af' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read16' mangled-name='spdk_pci_device_cfg_read16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read16'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='8a121f49' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write16' mangled-name='spdk_pci_device_cfg_write16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write16'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='149c6638' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_read32' mangled-name='spdk_pci_device_cfg_read32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_read32'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='90421557' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_cfg_write32' mangled-name='spdk_pci_device_cfg_write32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_cfg_write32'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='8f92235e' name='value'/>
      <parameter type-id='8f92235e' name='offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_serial_number' mangled-name='spdk_pci_device_get_serial_number' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_serial_number'>
      <parameter type-id='efc5406b' name='dev'/>
      <parameter type-id='26a90f95' name='sn'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_addr' mangled-name='spdk_pci_device_get_addr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_addr'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='ec72f59a'/>
    </function-decl>
    <function-decl name='spdk_pci_device_is_removed' mangled-name='spdk_pci_device_is_removed' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_is_removed'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_compare' mangled-name='spdk_pci_addr_compare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_compare'>
      <parameter type-id='6002756d' name='a1'/>
      <parameter type-id='6002756d' name='a2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_claim' mangled-name='spdk_pci_device_claim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_claim'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_device_unclaim' mangled-name='spdk_pci_device_unclaim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_unclaim'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_parse' mangled-name='spdk_pci_addr_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_parse'>
      <parameter type-id='a714fad8' name='addr'/>
      <parameter type-id='80f4b756' name='bdf'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_addr_fmt' mangled-name='spdk_pci_addr_fmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_addr_fmt'>
      <parameter type-id='26a90f95' name='bdf'/>
      <parameter type-id='b59d7dce' name='sz'/>
      <parameter type-id='6002756d' name='addr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_hook_device' mangled-name='spdk_pci_hook_device' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_hook_device'>
      <parameter type-id='a10bedff' name='drv'/>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_unhook_device' mangled-name='spdk_pci_unhook_device' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_unhook_device'>
      <parameter type-id='efc5406b' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_register_device_provider' mangled-name='spdk_pci_register_device_provider' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_device_provider'>
      <parameter type-id='35ee3f91' name='provider'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pci_device_get_type' mangled-name='spdk_pci_device_get_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_get_type'>
      <parameter type-id='8ef445e6' name='dev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_pci_device_allow' mangled-name='spdk_pci_device_allow' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_device_allow'>
      <parameter type-id='a714fad8' name='pci_addr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='630f2781'>
      <parameter type-id='6002756d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='7c9d37e3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8382c070'>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='28bf3cba'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='efc5406b'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='pci_event.c' language='LANG_C99'>
    <enum-decl name='spdk_pci_event_type' id='09d5c853'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_UEVENT_ADD' value='0'/>
      <enumerator name='SPDK_UEVENT_REMOVE' value='1'/>
    </enum-decl>
    <class-decl name='spdk_pci_event' size-in-bits='96' is-struct='yes' visibility='default' id='c488f7e7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action' type-id='09d5c853' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='traddr' type-id='ec72f59a' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c488f7e7' size-in-bits='64' id='f0aa383f'/>
    <function-decl name='spdk_pci_event_listen' mangled-name='spdk_pci_event_listen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_event_listen'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_get_event' mangled-name='spdk_pci_get_event' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_get_event'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='f0aa383f' name='event'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_idxd.c' language='LANG_C99'>
    <function-decl name='spdk_pci_idxd_get_driver' mangled-name='spdk_pci_idxd_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_idxd_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_ioat.c' language='LANG_C99'>
    <function-decl name='spdk_pci_ioat_get_driver' mangled-name='spdk_pci_ioat_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_ioat_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_virtio.c' language='LANG_C99'>
    <function-decl name='spdk_pci_virtio_get_driver' mangled-name='spdk_pci_virtio_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_virtio_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pci_vmd.c' language='LANG_C99'>
    <function-decl name='spdk_pci_vmd_get_driver' mangled-name='spdk_pci_vmd_get_driver' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_vmd_get_driver'>
      <return type-id='a10bedff'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sigbus_handler.c' language='LANG_C99'>
    <typedef-decl name='spdk_pci_error_handler' type-id='debb4ee8' id='bb61f2cb'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <function-decl name='spdk_pci_register_error_handler' mangled-name='spdk_pci_register_error_handler' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_register_error_handler'>
      <parameter type-id='bb61f2cb' name='sighandler'/>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pci_unregister_error_handler' mangled-name='spdk_pci_unregister_error_handler' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pci_unregister_error_handler'>
      <parameter type-id='bb61f2cb' name='sighandler'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='c039af2e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='threads.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='thread_start_fn' type-id='b9b212f5' id='25440708'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' id='d5319498'/>
    <function-decl name='spdk_env_get_core_count' mangled-name='spdk_env_get_core_count' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_core_count'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_current_core' mangled-name='spdk_env_get_current_core' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_current_core'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_main_core' mangled-name='spdk_env_get_main_core' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_main_core'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_first_core' mangled-name='spdk_env_get_first_core' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_first_core'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_last_core' mangled-name='spdk_env_get_last_core' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_last_core'>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_next_core' mangled-name='spdk_env_get_next_core' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_next_core'>
      <parameter type-id='8f92235e' name='prev_core'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_socket_id' mangled-name='spdk_env_get_socket_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_socket_id'>
      <parameter type-id='8f92235e' name='core'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_env_get_cpuset' mangled-name='spdk_env_get_cpuset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_get_cpuset'>
      <parameter type-id='d5319498' name='cpuset'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_env_thread_launch_pinned' mangled-name='spdk_env_thread_launch_pinned' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_thread_launch_pinned'>
      <parameter type-id='8f92235e' name='core'/>
      <parameter type-id='25440708' name='fn'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_env_thread_wait_all' mangled-name='spdk_env_thread_wait_all' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_env_thread_wait_all'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
</abi-corpus>
