<abi-corpus version='2.1' soname='libspdk_vmd.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vmd_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_get_led_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_hotplug_monitor' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_pci_device_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_remove_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_rescan' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_set_led_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='led.c' language='LANG_C99'>
    <enum-decl name='spdk_vmd_led_state' id='bf22a0ae'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_VMD_LED_STATE_OFF' value='0'/>
      <enumerator name='SPDK_VMD_LED_STATE_IDENTIFY' value='1'/>
      <enumerator name='SPDK_VMD_LED_STATE_FAULT' value='2'/>
      <enumerator name='SPDK_VMD_LED_STATE_REBUILD' value='3'/>
      <enumerator name='SPDK_VMD_LED_STATE_UNKNOWN' value='4'/>
    </enum-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <pointer-type-def type-id='bf22a0ae' size-in-bits='64' id='ca881af7'/>
    <function-decl name='spdk_vmd_set_led_state' mangled-name='spdk_vmd_set_led_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_set_led_state'>
      <parameter type-id='efc5406b' name='pci_device'/>
      <parameter type-id='bf22a0ae' name='state'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_get_led_state' mangled-name='spdk_vmd_get_led_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_get_led_state'>
      <parameter type-id='efc5406b' name='pci_device'/>
      <parameter type-id='ca881af7' name='state'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vmd.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='ec72f59a' const='yes' id='e81a0cd5'/>
    <pointer-type-def type-id='e81a0cd5' size-in-bits='64' id='6002756d'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_vmd_pci_device_list' mangled-name='spdk_vmd_pci_device_list' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_pci_device_list'>
      <parameter type-id='ec72f59a' name='vmd_addr'/>
      <parameter type-id='efc5406b' name='nvme_list'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_hotplug_monitor' mangled-name='spdk_vmd_hotplug_monitor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_hotplug_monitor'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_remove_device' mangled-name='spdk_vmd_remove_device' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_remove_device'>
      <parameter type-id='6002756d' name='addr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_rescan' mangled-name='spdk_vmd_rescan' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_rescan'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_init' mangled-name='spdk_vmd_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_init'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_fini' mangled-name='spdk_vmd_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
</abi-corpus>
