<abi-corpus version='2.1' soname='libspdk_ftl.so.7.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libspdk_thread.so.8.0'/>
    <dependency name='libspdk_bdev.so.12.0'/>
    <dependency name='libspdk_trace.so.8.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_ftl_conf_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_conf_deinit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_get_attrs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_get_conf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_set_fast_shutdown' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_get_default_conf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_get_stats' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_io_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_readv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_unmap' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='ftl_core.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <array-type-def dimensions='1' type-id='096b0b42' size-in-bits='3840' id='e60e29c6'>
      <subrange length='6' type-id='f0981eeb' id='52fa524b'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='ftl_stats' size-in-bits='4160' is-struct='yes' visibility='default' id='36f74cd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='limits' type-id='85c64d26' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_activity_total' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='entries' type-id='e60e29c6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_entry' size-in-bits='640' is-struct='yes' visibility='default' id='096b0b42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read' type-id='2ce53abd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write' type-id='2ce53abd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_error' size-in-bits='192' is-struct='yes' visibility='default' id='652a872c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='media' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='crc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='other' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_group' size-in-bits='320' is-struct='yes' visibility='default' id='2ce53abd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ios' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='errors' type-id='652a872c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_ftl_attrs' size-in-bits='192' is-struct='yes' visibility='default' id='aa6cb391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='optimum_io_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_ftl_fn' type-id='1ed1e4cd' id='19dafce4'/>
    <typedef-decl name='spdk_ftl_stats_fn' type-id='a43892b2' id='cb4ea0c8'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='256' id='85c64d26'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <qualified-type-def type-id='2379e16e' const='yes' id='28b05667'/>
    <pointer-type-def type-id='28b05667' size-in-bits='64' id='5a97db37'/>
    <pointer-type-def type-id='7bf9465a' size-in-bits='64' id='36f8a0e8'/>
    <pointer-type-def type-id='36f74cd1' size-in-bits='64' id='463fc3a9'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='aa6cb391' size-in-bits='64' id='cdbd9bf9'/>
    <pointer-type-def type-id='2379e16e' size-in-bits='64' id='5c15bda4'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='c6068e88' size-in-bits='64' id='a43892b2'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_ftl_io_size' mangled-name='spdk_ftl_io_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_io_size'>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_get_attrs' mangled-name='spdk_ftl_dev_get_attrs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_get_attrs'>
      <parameter type-id='5a97db37' name='dev'/>
      <parameter type-id='cdbd9bf9' name='attrs'/>
      <parameter type-id='b59d7dce' name='attrs_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_writev' mangled-name='spdk_ftl_writev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_writev'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='36f8a0e8' name='io'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='lba'/>
      <parameter type-id='9c313c2d' name='lba_cnt'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='b59d7dce' name='iov_cnt'/>
      <parameter type-id='19dafce4' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_readv' mangled-name='spdk_ftl_readv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_readv'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='36f8a0e8' name='io'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='lba'/>
      <parameter type-id='9c313c2d' name='lba_cnt'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='b59d7dce' name='iov_cnt'/>
      <parameter type-id='19dafce4' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_unmap' mangled-name='spdk_ftl_unmap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_unmap'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='36f8a0e8' name='io'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='lba'/>
      <parameter type-id='9c313c2d' name='lba_cnt'/>
      <parameter type-id='19dafce4' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_init' mangled-name='spdk_ftl_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_init'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_fini' mangled-name='spdk_ftl_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_fini'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_set_fast_shutdown' mangled-name='spdk_ftl_dev_set_fast_shutdown' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_set_fast_shutdown'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='c894953d' name='fast_shutdown'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_get_io_channel' mangled-name='spdk_ftl_get_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_io_channel'>
      <parameter type-id='5c15bda4' name='dev'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_ftl_get_stats' mangled-name='spdk_ftl_get_stats' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_stats'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='463fc3a9' name='stats'/>
      <parameter type-id='cb4ea0c8' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='g_ftl_write_buf' type-id='eaa32e2f' visibility='default'/>
    <var-decl name='g_ftl_read_buf' type-id='eaa32e2f' visibility='default'/>
    <class-decl name='spdk_ftl_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='2379e16e'/>
    <class-decl name='ftl_io' is-struct='yes' visibility='default' is-declaration-only='yes' id='7bf9465a'/>
    <function-type size-in-bits='64' id='c6068e88'>
      <parameter type-id='463fc3a9'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_init.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='b59d7dce' size-in-bits='256' id='314f9837'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <class-decl name='spdk_ftl_conf' size-in-bits='1088' is-struct='yes' visibility='default' id='71e1eb61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='overprovisioning' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='l2p_dram_limit' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='core_mask' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='user_io_pool_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='limits' type-id='314f9837' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='nv_cache' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reserved' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='base_bdev' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cache_bdev' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='fast_shutdown' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='968'>
        <var-decl name='reserved2' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='conf_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='chunk_compaction_threshold' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='chunk_free_target' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='spdk_ftl_init_fn' type-id='0d15a3a8' id='f94ea377'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='71e1eb61' const='yes' id='8ca3f2c6'/>
    <pointer-type-def type-id='8ca3f2c6' size-in-bits='64' id='52176984'/>
    <pointer-type-def type-id='901f6dfe' size-in-bits='64' id='0d15a3a8'/>
    <function-decl name='spdk_ftl_dev_init' mangled-name='spdk_ftl_dev_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_init'>
      <parameter type-id='52176984' name='conf'/>
      <parameter type-id='f94ea377' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_free' mangled-name='spdk_ftl_dev_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_free'>
      <parameter type-id='5c15bda4' name='dev'/>
      <parameter type-id='19dafce4' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='901f6dfe'>
      <parameter type-id='5c15bda4'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='utils/ftl_bitmap.c' language='LANG_C99'>
    <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
    <var-decl name='ftl_bitmap_buffer_alignment' type-id='d0fa5dde' visibility='default'/>
  </abi-instr>
  <abi-instr address-size='64' path='utils/ftl_conf.c' language='LANG_C99'>
    <pointer-type-def type-id='71e1eb61' size-in-bits='64' id='b95a3239'/>
    <function-decl name='spdk_ftl_get_default_conf' mangled-name='spdk_ftl_get_default_conf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_default_conf'>
      <parameter type-id='b95a3239' name='conf'/>
      <parameter type-id='b59d7dce' name='conf_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_get_conf' mangled-name='spdk_ftl_dev_get_conf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_get_conf'>
      <parameter type-id='5a97db37' name='dev'/>
      <parameter type-id='b95a3239' name='conf'/>
      <parameter type-id='b59d7dce' name='conf_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_conf_copy' mangled-name='spdk_ftl_conf_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_conf_copy'>
      <parameter type-id='b95a3239' name='dst'/>
      <parameter type-id='52176984' name='src'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_conf_deinit' mangled-name='spdk_ftl_conf_deinit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_conf_deinit'>
      <parameter type-id='b95a3239' name='conf'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
