<abi-corpus version='2.1' soname='libspdk_nvme.so.10.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_sock.so.8.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libspdk_trace.so.8.0'/>
    <dependency name='libspdk_vfio_user.so.4.0'/>
    <dependency name='libspdk_rdma.so.5.0'/>
    <dependency name='libspdk_dma.so.3.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvme_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_connect_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_type_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_ctrlr_alloc_io_qpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_ctrlr_alloc_qid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_nvme_zns_close_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ctrlr_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ctrlr_get_max_zone_append_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ext_report_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_finish_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_max_active_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_max_open_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_num_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_zone_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_ns_get_zone_size_sectors' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_offline_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_open_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_report_zones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_reset_zone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_set_zone_desc_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_append' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_append_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_appendv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_zns_zone_appendv_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_activate_locking_sp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_add_user_to_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_enable_user' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_erase_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_get_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_get_max_ranges' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_lock_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_revert_tper' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_secure_erase_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_set_new_passwd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_setup_locking_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_cmd_take_ownership' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_free_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_get_d0_features_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_opal_get_locking_range_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='nvme.c' language='LANG_C99'>
    <enum-decl name='nvme_ctrlr_detach_state' id='f98a399c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='NVME_CTRLR_DETACH_SET_CC' value='0'/>
      <enumerator name='NVME_CTRLR_DETACH_CHECK_CSTS' value='1'/>
      <enumerator name='NVME_CTRLR_DETACH_GET_CSTS' value='2'/>
      <enumerator name='NVME_CTRLR_DETACH_GET_CSTS_DONE' value='3'/>
    </enum-decl>
    <class-decl name='nvme_ctrlr_detach_ctx' size-in-bits='448' is-struct='yes' visibility='default' id='e157c12b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='c9e3cc7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='shutdown_start_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='shutdown_timeout_ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='shutdown_complete' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='state' type-id='f98a399c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='csts' type-id='f62d2dc3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_driver' size-in-bits='640' is-struct='yes' visibility='default' id='7528a00e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lock' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='shared_attached_ctrlrs' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='initialized' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='default_extended_host_id' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='hotplug_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_detach_ctx' size-in-bits='128' is-struct='yes' visibility='default' id='0e876556'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_host_id' size-in-bits='2320' is-struct='yes' visibility='default' id='81599aaf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostaddr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='hostsvcid' type-id='12da2087' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_probe_ctx' size-in-bits='4928' is-struct='yes' visibility='default' id='a394da29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trid' type-id='8712472c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='probe_cb' type-id='abc0b7d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='attach_cb' type-id='196479c9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='remove_cb' type-id='b978a222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='init_ctrlrs' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='35a1681b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9e170523' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='35a1681b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9e170523' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='b77e8c18' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nvme_ctrlr_detach_cb' type-id='0d4757cf' id='c9e3cc7a'/>
    <typedef-decl name='spdk_nvme_attach_cb' type-id='dc8330a6' id='196479c9'/>
    <typedef-decl name='spdk_nvme_probe_cb' type-id='a531641a' id='abc0b7d8'/>
    <pointer-type-def type-id='242fa1d8' size-in-bits='64' id='a531641a'/>
    <pointer-type-def type-id='e157c12b' size-in-bits='64' id='35a1681b'/>
    <pointer-type-def type-id='35a1681b' size-in-bits='64' id='9e170523'/>
    <pointer-type-def type-id='7528a00e' size-in-bits='64' id='ebba7414'/>
    <pointer-type-def type-id='0e876556' size-in-bits='64' id='57e3d1ac'/>
    <pointer-type-def type-id='57e3d1ac' size-in-bits='64' id='e1a2d5f2'/>
    <pointer-type-def type-id='81599aaf' size-in-bits='64' id='4b0091b7'/>
    <pointer-type-def type-id='a394da29' size-in-bits='64' id='75dd38a1'/>
    <pointer-type-def type-id='8cd337c8' size-in-bits='64' id='8035fbf9'/>
    <pointer-type-def type-id='72aef3b2' size-in-bits='64' id='a85c83ff'/>
    <pointer-type-def type-id='b2a984a4' size-in-bits='64' id='dc8330a6'/>
    <function-decl name='spdk_nvme_detach' mangled-name='spdk_nvme_detach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_async' mangled-name='spdk_nvme_detach_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_async'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='e1a2d5f2' name='_detach_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll_async' mangled-name='spdk_nvme_detach_poll_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll_async'>
      <parameter type-id='57e3d1ac' name='detach_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll' mangled-name='spdk_nvme_detach_poll' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll'>
      <parameter type-id='57e3d1ac' name='detach_ctx'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe' mangled-name='spdk_nvme_probe' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe'>
      <parameter type-id='7e9611b1' name='trid'/>
      <parameter type-id='eaa32e2f' name='cb_ctx'/>
      <parameter type-id='abc0b7d8' name='probe_cb'/>
      <parameter type-id='196479c9' name='attach_cb'/>
      <parameter type-id='b978a222' name='remove_cb'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect' mangled-name='spdk_nvme_connect' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect'>
      <parameter type-id='7e9611b1' name='trid'/>
      <parameter type-id='69be0b8c' name='opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='0d7532a2'/>
    </function-decl>
    <function-decl name='spdk_nvme_trid_populate_transport' mangled-name='spdk_nvme_trid_populate_transport' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_trid_populate_transport'>
      <parameter type-id='6f56757a' name='trid'/>
      <parameter type-id='8cd337c8' name='trtype'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_populate_trstring' mangled-name='spdk_nvme_transport_id_populate_trstring' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_populate_trstring'>
      <parameter type-id='6f56757a' name='trid'/>
      <parameter type-id='80f4b756' name='trstring'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_trtype' mangled-name='spdk_nvme_transport_id_parse_trtype' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_trtype'>
      <parameter type-id='8035fbf9' name='trtype'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_trtype_str' mangled-name='spdk_nvme_transport_id_trtype_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_trtype_str'>
      <parameter type-id='8cd337c8' name='trtype'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_adrfam' mangled-name='spdk_nvme_transport_id_parse_adrfam' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_adrfam'>
      <parameter type-id='a85c83ff' name='adrfam'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_adrfam_str' mangled-name='spdk_nvme_transport_id_adrfam_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_adrfam_str'>
      <parameter type-id='72aef3b2' name='adrfam'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse' mangled-name='spdk_nvme_transport_id_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse'>
      <parameter type-id='6f56757a' name='trid'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_host_id_parse' mangled-name='spdk_nvme_host_id_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_host_id_parse'>
      <parameter type-id='4b0091b7' name='hostid'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_compare' mangled-name='spdk_nvme_transport_id_compare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_compare'>
      <parameter type-id='7e9611b1' name='trid1'/>
      <parameter type-id='7e9611b1' name='trid2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_parse' mangled-name='spdk_nvme_prchk_flags_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_parse'>
      <parameter type-id='90421557' name='prchk_flags'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_str' mangled-name='spdk_nvme_prchk_flags_str' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_str'>
      <parameter type-id='8f92235e' name='prchk_flags'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_async' mangled-name='spdk_nvme_probe_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_async'>
      <parameter type-id='7e9611b1' name='trid'/>
      <parameter type-id='eaa32e2f' name='cb_ctx'/>
      <parameter type-id='abc0b7d8' name='probe_cb'/>
      <parameter type-id='196479c9' name='attach_cb'/>
      <parameter type-id='b978a222' name='remove_cb'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_poll_async' mangled-name='spdk_nvme_probe_poll_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_poll_async'>
      <parameter type-id='75dd38a1' name='probe_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect_async' mangled-name='spdk_nvme_connect_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect_async'>
      <parameter type-id='7e9611b1' name='trid'/>
      <parameter type-id='69be0b8c' name='opts'/>
      <parameter type-id='196479c9' name='attach_cb'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <var-decl name='g_spdk_nvme_pid' type-id='587f89d2' visibility='default'/>
    <var-decl name='g_spdk_nvme_driver' type-id='ebba7414' visibility='default'/>
    <function-type size-in-bits='64' id='242fa1d8'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='f5423aff'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='b2a984a4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='0d7532a2'/>
      <parameter type-id='69be0b8c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f279e60b'>
      <parameter type-id='0d7532a2'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2131c8e5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a2'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr.c' language='LANG_C99'>
    <enum-decl name='spdk_nvme_fw_commit_action' id='0009b8fa'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_IMG' value='0'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_AND_ENABLE_IMG' value='1'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ENABLE_IMG' value='2'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_RUN_IMG' value='3'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_BOOT_PARTITION' value='6'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ACTIVATE_BOOT_PARTITION' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qp_failure_reason' id='738b4017'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_NONE' value='0'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_LOCAL' value='1'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_REMOTE' value='2'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_UNKNOWN' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qprio' id='438eb703'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPRIO_URGENT' value='0'/>
      <enumerator name='SPDK_NVME_QPRIO_HIGH' value='1'/>
      <enumerator name='SPDK_NVME_QPRIO_MEDIUM' value='2'/>
      <enumerator name='SPDK_NVME_QPRIO_LOW' value='3'/>
    </enum-decl>
    <class-decl name='nvme_io_msg_producer' size-in-bits='256' is-struct='yes' visibility='default' id='5bdb26bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='update' type-id='0d4757cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stop' type-id='0d4757cf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_list' size-in-bits='32768' is-struct='yes' visibility='default' id='448e2afd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_count' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ctrlr_list' type-id='2ca8d8c8' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_format' size-in-bits='32' is-struct='yes' visibility='default' id='b9f3fc28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lbaf' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pi' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pil' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='ses' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='lbafu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_io_qpair_opts' size-in-bits='576' is-struct='yes' visibility='default' id='16b11ada'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qprio' type-id='438eb703' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved13' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cq' type-id='e7f43f77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='create_only' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='async_mode' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='reserved66' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='9c23d1fd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='538b928d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='25e0c706' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='brs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='abpid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='bir' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pmrtu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='pmrwbm' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pmrto' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='cmss' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='lists' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='szu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='sz' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='spdk_nvme_qp_failure_reason' type-id='738b4017' id='346f4e4b'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='32752' id='2ca8d8c8'>
      <subrange length='2047' type-id='f0981eeb' id='e51ae5ac'/>
    </array-type-def>
    <union-decl name='spdk_nvme_bpinfo_register' size-in-bits='32' visibility='default' id='9e9f6fb8'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f78' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmbsz_register' size-in-bits='32' visibility='default' id='bde1820f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f7b' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' size-in-bits='32' visibility='default' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f79' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_pmrcap_register' size-in-bits='32' visibility='default' id='e61e4ac5'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f7a' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='delay_cmd_submit' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delay_pcie_doorbell' type-id='c894953d' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='30a17994' const='yes' id='daa760af'/>
    <pointer-type-def type-id='daa760af' size-in-bits='64' id='ba7cf15f'/>
    <qualified-type-def type-id='514f4721' const='yes' id='db3704b8'/>
    <pointer-type-def type-id='db3704b8' size-in-bits='64' id='a99c31d6'/>
    <qualified-type-def type-id='388558d7' const='yes' id='86722dee'/>
    <pointer-type-def type-id='86722dee' size-in-bits='64' id='69be0b8c'/>
    <qualified-type-def type-id='16b11ada' const='yes' id='50d38b19'/>
    <pointer-type-def type-id='50d38b19' size-in-bits='64' id='70042149'/>
    <qualified-type-def type-id='8712472c' const='yes' id='ee6bba01'/>
    <pointer-type-def type-id='ee6bba01' size-in-bits='64' id='7e9611b1'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='72b49d60' size-in-bits='64' id='25e0c706'/>
    <pointer-type-def type-id='448e2afd' size-in-bits='64' id='c829039d'/>
    <pointer-type-def type-id='388558d7' size-in-bits='64' id='f5423aff'/>
    <pointer-type-def type-id='b9f3fc28' size-in-bits='64' id='80e5734e'/>
    <pointer-type-def type-id='16b11ada' size-in-bits='64' id='44486348'/>
    <pointer-type-def type-id='4e56c4fd' size-in-bits='64' id='4b4afe0d'/>
    <pointer-type-def type-id='38ef35c9' size-in-bits='64' id='d18635a1'/>
    <pointer-type-def type-id='8712472c' size-in-bits='64' id='6f56757a'/>
    <pointer-type-def type-id='f279e60b' size-in-bits='64' id='0d4757cf'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='cfe40fb1'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <function-decl name='spdk_nvme_ctrlr_get_default_ctrlr_opts' mangled-name='spdk_nvme_ctrlr_get_default_ctrlr_opts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_ctrlr_opts'>
      <parameter type-id='f5423aff' name='opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_opts' mangled-name='spdk_nvme_ctrlr_get_opts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_opts'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='69be0b8c'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_default_io_qpair_opts' mangled-name='spdk_nvme_ctrlr_get_default_io_qpair_opts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_io_qpair_opts'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='44486348' name='opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_connect_io_qpair' mangled-name='spdk_nvme_ctrlr_connect_io_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_connect_io_qpair'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_disconnect_io_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_io_qpair' mangled-name='spdk_nvme_ctrlr_alloc_io_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_io_qpair'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='70042149' name='user_opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='5ca7f948'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_reconnect_io_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' mangled-name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_admin_qp_failure_reason'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='346f4e4b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_io_qpair' mangled-name='spdk_nvme_ctrlr_free_io_qpair' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_io_qpair'>
      <parameter type-id='5ca7f948' name='qpair'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_failed' mangled-name='spdk_nvme_ctrlr_is_failed' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_failed'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_fail' mangled-name='spdk_nvme_ctrlr_fail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_fail'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect' mangled-name='spdk_nvme_ctrlr_disconnect' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_async' mangled-name='spdk_nvme_ctrlr_reconnect_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_async'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_poll_async' mangled-name='spdk_nvme_ctrlr_reconnect_poll_async' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_poll_async'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset' mangled-name='spdk_nvme_ctrlr_reset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset_subsystem' mangled-name='spdk_nvme_ctrlr_reset_subsystem' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset_subsystem'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_trid' mangled-name='spdk_nvme_ctrlr_set_trid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_trid'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='6f56757a' name='trid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_remove_cb' mangled-name='spdk_nvme_ctrlr_set_remove_cb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_remove_cb'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b978a222' name='remove_cb'/>
      <parameter type-id='eaa32e2f' name='remove_ctx'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_process_admin_completions' mangled-name='spdk_nvme_ctrlr_process_admin_completions' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_process_admin_completions'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_data' mangled-name='spdk_nvme_ctrlr_get_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_data'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='a99c31d6'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_csts' mangled-name='spdk_nvme_ctrlr_get_regs_csts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_csts'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='f62d2dc3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cc' mangled-name='spdk_nvme_ctrlr_get_regs_cc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cc'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='f0fcbcb4'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cap' mangled-name='spdk_nvme_ctrlr_get_regs_cap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cap'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='007005ee'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_vs' mangled-name='spdk_nvme_ctrlr_get_regs_vs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_vs'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='900beaa3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cmbsz' mangled-name='spdk_nvme_ctrlr_get_regs_cmbsz' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cmbsz'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='bde1820f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_pmrcap' mangled-name='spdk_nvme_ctrlr_get_regs_pmrcap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_pmrcap'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='e61e4ac5'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_bpinfo' mangled-name='spdk_nvme_ctrlr_get_regs_bpinfo' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_bpinfo'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='9e9f6fb8'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pmrsz' mangled-name='spdk_nvme_ctrlr_get_pmrsz' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pmrsz'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_num_ns' mangled-name='spdk_nvme_ctrlr_get_num_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_num_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_active_ns' mangled-name='spdk_nvme_ctrlr_is_active_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_first_active_ns' mangled-name='spdk_nvme_ctrlr_get_first_active_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_first_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_next_active_ns' mangled-name='spdk_nvme_ctrlr_get_next_active_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_next_active_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='prev_nsid'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_ns' mangled-name='spdk_nvme_ctrlr_get_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <return type-id='663c4b46'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pci_device' mangled-name='spdk_nvme_ctrlr_get_pci_device' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pci_device'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='efc5406b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_max_xfer_size' mangled-name='spdk_nvme_ctrlr_get_max_xfer_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_max_xfer_size'>
      <parameter type-id='ba7cf15f' name='ctrlr'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_aer_callback' mangled-name='spdk_nvme_ctrlr_register_aer_callback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_aer_callback'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8565ca96' name='aer_cb_fn'/>
      <parameter type-id='eaa32e2f' name='aer_cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' mangled-name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_timeout_callback' mangled-name='spdk_nvme_ctrlr_register_timeout_callback' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_timeout_callback'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='9c313c2d' name='timeout_io_us'/>
      <parameter type-id='9c313c2d' name='timeout_admin_us'/>
      <parameter type-id='818cfb43' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_log_page_supported' mangled-name='spdk_nvme_ctrlr_is_log_page_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_log_page_supported'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='log_page'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_feature_supported' mangled-name='spdk_nvme_ctrlr_is_feature_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_feature_supported'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='feature_code'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_attach_ns' mangled-name='spdk_nvme_ctrlr_attach_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_attach_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='c829039d' name='payload'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_detach_ns' mangled-name='spdk_nvme_ctrlr_detach_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_detach_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='c829039d' name='payload'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_create_ns' mangled-name='spdk_nvme_ctrlr_create_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_create_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='4b4afe0d' name='payload'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_delete_ns' mangled-name='spdk_nvme_ctrlr_delete_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_delete_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_format' mangled-name='spdk_nvme_ctrlr_format' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_format'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='80e5734e' name='format'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_update_firmware' mangled-name='spdk_nvme_ctrlr_update_firmware' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_update_firmware'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='size'/>
      <parameter type-id='95e97e5e' name='slot'/>
      <parameter type-id='0009b8fa' name='commit_action'/>
      <parameter type-id='d18635a1' name='completion_status'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reserve_cmb' mangled-name='spdk_nvme_ctrlr_reserve_cmb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reserve_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_cmb' mangled-name='spdk_nvme_ctrlr_map_cmb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='78c01427' name='size'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_cmb' mangled-name='spdk_nvme_ctrlr_unmap_cmb' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_cmb'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_enable_pmr' mangled-name='spdk_nvme_ctrlr_enable_pmr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_enable_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_pmr' mangled-name='spdk_nvme_ctrlr_disable_pmr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_pmr' mangled-name='spdk_nvme_ctrlr_map_pmr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='78c01427' name='size'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_pmr' mangled-name='spdk_nvme_ctrlr_unmap_pmr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_pmr'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_start' mangled-name='spdk_nvme_ctrlr_read_boot_partition_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_start'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='bprsz'/>
      <parameter type-id='8f92235e' name='bprof'/>
      <parameter type-id='8f92235e' name='bpid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_poll' mangled-name='spdk_nvme_ctrlr_read_boot_partition_poll' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_poll'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_write_boot_partition' mangled-name='spdk_nvme_ctrlr_write_boot_partition' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_write_boot_partition'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='size'/>
      <parameter type-id='8f92235e' name='bpid'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_discovery' mangled-name='spdk_nvme_ctrlr_is_discovery' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_discovery'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_fabrics' mangled-name='spdk_nvme_ctrlr_is_fabrics' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_fabrics'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_receive' mangled-name='spdk_nvme_ctrlr_security_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_receive'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='secp'/>
      <parameter type-id='149c6638' name='spsp'/>
      <parameter type-id='b96825af' name='nssf'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_send' mangled-name='spdk_nvme_ctrlr_security_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_send'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='secp'/>
      <parameter type-id='149c6638' name='spsp'/>
      <parameter type-id='b96825af' name='nssf'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_flags' mangled-name='spdk_nvme_ctrlr_get_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_flags'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_transport_id' mangled-name='spdk_nvme_ctrlr_get_transport_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_transport_id'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='7e9611b1'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_qid' mangled-name='spdk_nvme_ctrlr_alloc_qid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_qid'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_qid' mangled-name='spdk_nvme_ctrlr_free_qid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_qid'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='149c6638' name='qid'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_memory_domains' mangled-name='spdk_nvme_ctrlr_get_memory_domains' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_memory_domains'>
      <parameter type-id='ba7cf15f' name='ctrlr'/>
      <parameter type-id='1fc0b044' name='domains'/>
      <parameter type-id='95e97e5e' name='array_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='4d39c5a2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='51104a73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6f744fd4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a2'/>
      <parameter type-id='5ca7f948'/>
      <parameter type-id='149c6638'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr_cmd.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='e7f43f7c' size-in-bits='2048' id='93b898c4'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e7f43f7d' size-in-bits='8192' id='93b898c5'>
      <subrange length='64' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <array-type-def dimensions='1' type-id='c894953d' size-in-bits='2048' id='ee1064d2'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1600' id='ed3da487'>
      <subrange length='200' type-id='f0981eeb' id='53119c2f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' id='ca634421'>
      <subrange length='224' type-id='f0981eeb' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' id='12da2087'>
      <subrange length='33' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='nvme_bp_write_state' id='4d11b517'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_BP_WS_DOWNLOADING' value='0'/>
      <enumerator name='SPDK_NVME_BP_WS_DOWNLOADED' value='1'/>
      <enumerator name='SPDK_NVME_BP_WS_REPLACE' value='2'/>
      <enumerator name='SPDK_NVME_BP_WS_ACTIVATE' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_ana_state' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_ams' id='468f6380'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_AMS_RR' value='0'/>
      <enumerator name='SPDK_NVME_CC_AMS_WRR' value='1'/>
      <enumerator name='SPDK_NVME_CC_AMS_VS' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_css' id='1fb07fa0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_CSS_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CC_CSS_IOCS' value='6'/>
      <enumerator name='SPDK_NVME_CC_CSS_NOIO' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_csi' id='fac3fed3'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CSI_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CSI_KV' value='1'/>
      <enumerator name='SPDK_NVME_CSI_ZNS' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' id='d0740e9b'>
      <subrange length='20' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' id='3a071e7d'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <array-type-def dimensions='1' type-id='e07a3145' size-in-bits='2048' id='03299d39'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' id='bf64ebc5'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f7e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_async_event_request' size-in-bits='256' is-struct='yes' visibility='default' id='e07a3145'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='req' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_completion_poll_status' size-in-bits='320' is-struct='yes' visibility='default' id='b117a781'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dma_data' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='done' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='timed_out' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_error_cmd' size-in-bits='320' is-struct='yes' visibility='default' id='615209f1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='do_not_submit' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='err_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='opc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='status' type-id='38ef35c9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f7f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_ns_tree' size-in-bits='64' is-struct='yes' visibility='default' id='bc9516ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='663c4b46' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_payload' size-in-bits='320' is-struct='yes' visibility='default' id='3022643e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reset_sgl_fn' type-id='48c98c81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next_sge_fn' type-id='218012e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts' type-id='d5db24a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='contig_or_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='md' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_register_completion' size-in-bits='448' is-struct='yes' visibility='default' id='f979a968'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_fn' type-id='e6ead4a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='stailq' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pid' type-id='587f89d2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_request' size-in-bits='2176' is-struct='yes' visibility='default' id='dc04c171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd' type-id='a0e8c12d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='retries' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='timed_out' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='521'>
        <var-decl name='queued' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='522'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='num_children' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='payload_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='md_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='payload_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='payload' type-id='3022643e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cb_fn' type-id='766930c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='stailq' type-id='e7f43f81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='qpair' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='submit_tick' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='pid' type-id='587f89d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1376'>
        <var-decl name='cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1504'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='children' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='child_tailq' type-id='e7f43f83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='parent' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='parent_status' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='user_cb_fn' type-id='766930c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='user_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='user_buffer' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_accel_fn_table' size-in-bits='128' is-struct='yes' visibility='default' id='408e2745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='table_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_accel_crc32c' type-id='51b945aa' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ana_group_descriptor' size-in-bits='256' is-struct='yes' visibility='default' id='6571814d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_group_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_of_nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='change_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ana_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='reserved1' type-id='fa97480e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nsid' type-id='1e7b9b2b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ana_page' size-in-bits='128' is-struct='yes' visibility='default' id='04a82693'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='change_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_ana_group_desc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_ctratt' size-in-bits='32' is-struct='yes' visibility='default' id='b65f54af'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' size-in-bits='16' is-struct='yes' visibility='default' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' size-in-bits='2048' is-struct='yes' visibility='default' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f84' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' size-in-bits='16' is-struct='yes' visibility='default' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' size-in-bits='32' is-struct='yes' visibility='default' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' size-in-bits='16' is-struct='yes' visibility='default' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' size-in-bits='32' is-struct='yes' visibility='default' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' size-in-bits='128' is-struct='yes' visibility='default' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr' size-in-bits='53824' is-struct='yes' visibility='default' id='30a17994'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns' type-id='bc9516ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_ns_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='is_removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='is_resetting' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='is_failed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='is_destructed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timeout_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='prepare_for_reset' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='is_disconnecting' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='max_sges' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ioccsz_bytes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='trid' type-id='8712472c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='cap' type-id='007005ee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='vs' type-id='900beaa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4960'>
        <var-decl name='state' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='state_timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='next_keep_alive_tick' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='keep_alive_interval_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='tailq' type-id='e7f43f86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='log_page_supported' type-id='ee1064d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7360'>
        <var-decl name='feature_supported' type-id='ee1064d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='max_xfer_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9440'>
        <var-decl name='min_page_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='page_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9504'>
        <var-decl name='num_aers' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='aer' type-id='03299d39' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='ctrlr_lock' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11904'>
        <var-decl name='adminq' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11968'>
        <var-decl name='shadow_doorbell' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12032'>
        <var-decl name='eventidx' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12096'>
        <var-decl name='cdata' type-id='514f4721' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44864'>
        <var-decl name='cdata_zns' type-id='e44cedcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44928'>
        <var-decl name='free_io_qids' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='44992'>
        <var-decl name='active_io_qpairs' type-id='e7f43f87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45120'>
        <var-decl name='opts' type-id='388558d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51712'>
        <var-decl name='quirks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51776'>
        <var-decl name='sleep_timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51840'>
        <var-decl name='active_procs' type-id='e7f43f88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='51968'>
        <var-decl name='queued_aborts' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52096'>
        <var-decl name='outstanding_aborts' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52160'>
        <var-decl name='remove_cb' type-id='b978a222' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52224'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52288'>
        <var-decl name='external_io_msgs_qpair' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52352'>
        <var-decl name='external_io_msgs_lock' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52672'>
        <var-decl name='external_io_msgs' type-id='b2192338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52736'>
        <var-decl name='io_producers' type-id='e7f43f8a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52864'>
        <var-decl name='ana_log_page' type-id='67bf10c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52928'>
        <var-decl name='copied_ana_desc' type-id='ae42794d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52992'>
        <var-decl name='ana_log_page_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53056'>
        <var-decl name='tmp_ptr' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53120'>
        <var-decl name='max_zone_append_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53184'>
        <var-decl name='pmr_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53248'>
        <var-decl name='bp_ws' type-id='4d11b517' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53280'>
        <var-decl name='bpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53312'>
        <var-decl name='bp_write_cb_fn' type-id='766930c6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53376'>
        <var-decl name='bp_write_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53440'>
        <var-decl name='fw_payload' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53504'>
        <var-decl name='fw_size_remaining' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53536'>
        <var-decl name='fw_offset' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53568'>
        <var-decl name='fw_transfer_size' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53632'>
        <var-decl name='register_operations' type-id='e7f43f8b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='53760'>
        <var-decl name='process_init_cc' type-id='f0fcbcb4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_aer_completion_list' size-in-bits='192' is-struct='yes' visibility='default' id='5c4cef53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cpl' type-id='72b49d60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='e7f43f8c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' size-in-bits='32768' is-struct='yes' visibility='default' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f8d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='b65f54af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f8e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f8f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f90' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f91' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f92' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f93' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f94' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f98' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f9a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_opts' size-in-bits='6544' is-struct='yes' visibility='default' id='388558d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_io_queues' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_cmb_sqs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='no_shn_notification' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='reserved6' type-id='0f4b9e74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arb_mechanism' type-id='468f6380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arbitration_burst' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='low_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='medium_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='high_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_retry_count' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='reserved21' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='src_addr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='src_svcid' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4368'>
        <var-decl name='host_id' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4432'>
        <var-decl name='extended_host_id' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4560'>
        <var-decl name='reserved570' type-id='0f4b9e74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='command_set' type-id='1fb07fa0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='admin_timeout_ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='header_digest' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4648'>
        <var-decl name='data_digest' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4656'>
        <var-decl name='disable_error_logging' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4664'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='admin_queue_size' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4688'>
        <var-decl name='reserved586' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='fabrics_connect_timeout_us' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='disable_read_ana_log_page' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='reserved610' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='disable_read_changed_ns_list_log_page' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4936'>
        <var-decl name='psk' type-id='ed3da487' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_process' size-in-bits='1088' is-struct='yes' visibility='default' id='487b2f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='is_primary' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='pid' type-id='587f89d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_reqs' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f9b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='devhandle' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='allocated_io_qpairs' type-id='e7f43f87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='aer_cb_fn' type-id='8565ca96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='aer_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='timeout_cb_fn' type-id='818cfb43' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='timeout_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='timeout_io_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='timeout_admin_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='async_events' type-id='e7f43f9c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns' size-in-bits='66240' is-struct='yes' visibility='default' id='2e8e7df0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sector_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='extended_lba_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pi_type' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sectors_per_max_io' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='sectors_per_max_io_no_md' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sectors_per_stripe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='flags' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='active' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='csi' type-id='fac3fed3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='id_desc_list' type-id='2b55acb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33152'>
        <var-decl name='ana_group_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33184'>
        <var-decl name='ana_state' type-id='78649e32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33216'>
        <var-decl name='nsdata' type-id='4e56c4fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='65984'>
        <var-decl name='nsdata_zns' type-id='dcc8163b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='66048'>
        <var-decl name='node' type-id='e7f43f9d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_cmd_ext_io_opts' size-in-bits='384' is-struct='yes' visibility='default' id='7548cfcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='reserved28' type-id='d351502e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='metadata' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='apptag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' size-in-bits='32768' is-struct='yes' visibility='default' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f9e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43fa0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43fa1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43fa2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43fa3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab59e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43fa4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43fa5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_poll_group' size-in-bits='320' is-struct='yes' visibility='default' id='19c10ed2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='accel_fn_table' type-id='408e2745' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tgroups' type-id='e7f43fa6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' size-in-bits='256' is-struct='yes' visibility='default' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_qpair' size-in-bits='1600' is-struct='yes' visibility='default' id='7718a4aa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='qprio' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='91'>
        <var-decl name='async' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='92'>
        <var-decl name='is_new_qpair' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='93'>
        <var-decl name='in_completion_context' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='94'>
        <var-decl name='delete_after_completion_context' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='95'>
        <var-decl name='no_deletion_notification_needed' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='last_fuse' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='98'>
        <var-decl name='transport_failure_reason' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='100'>
        <var-decl name='last_transport_failure_reason' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='102'>
        <var-decl name='abort_dnr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_outstanding_reqs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='reserved_req' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='free_req' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='queued_req' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='poll_group_stailq' type-id='e7f43fa7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='err_cmd_head' type-id='e7f43fa8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='err_req_head' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='active_proc' type-id='dc2642c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='poll_group' type-id='16f1a48e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='poll_group_tailq_head' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='transport' type-id='c3280e23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='poll_status' type-id='a42628d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tailq' type-id='e7f43fa9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='per_process_tailq' type-id='e7f43fa9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='aborting_queued_req' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='req_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' size-in-bits='16' is-struct='yes' visibility='default' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' size-in-bits='4512' is-struct='yes' visibility='default' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_poll_group' size-in-bits='448' is-struct='yes' visibility='default' id='411b4ac8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='group' type-id='43edf320' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport' type-id='c3280e23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='connected_qpairs' type-id='e7f43faa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='disconnected_qpairs' type-id='e7f43faa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='link' type-id='e7f43fab' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_zns_ctrlr_data' size-in-bits='32768' is-struct='yes' visibility='default' id='dd417b27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zasl' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='2b536e1a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_zns_ns_data' size-in-bits='32768' is-struct='yes' visibility='default' id='c884ff2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zoc' type-id='e7f43fac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ozcs' type-id='e7f43fad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='mar' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='frl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rrl1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rrl2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='rrl3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='frl1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='frl2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='frl3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='reserved44' type-id='69638cee' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22528'>
        <var-decl name='lbafe' type-id='93b898c5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30720'>
        <var-decl name='vendor_specific' type-id='62946659' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0f552895' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='f6f849ad' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='d0a508c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__70' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='d395c899' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c7caf1c9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__69' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='d395c899' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c7caf1c9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__110' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='9c23d1fd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='a3635575' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__112' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='728565ce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__111' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='728565ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='2bff65ec' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='84aefac9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__66' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='c274f359' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__86' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c274f359' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__85' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='84aefac9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c274f359' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b77e8c18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5f38ac73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='5f38ac73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='3f37501b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='dc2642c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7e3b5caa' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__108' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='dc2642c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='7e3b5caa' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='663c4b46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='663c4b46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='663c4b46' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__68' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5ca7f948' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__79' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='3e6d9546' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__82' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='3e6d9546' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__75' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='5ca7f948' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3e6d9546' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__81' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='16f1a48e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__78' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='16f1a48e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='c2662e2c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__104' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__106' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_across_zone_boundaries' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved0' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__97' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='variable_zone_capacity' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='zone_active_excursions' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved0' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__98' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__113' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zsze' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='zdes' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='reserved15' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__99' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fdf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__105' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__102' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__100' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__87' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__92' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__95' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__88' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__96' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__103' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__91' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__90' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__93' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__94' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__89' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__pid_t' type-id='95e97e5e' id='3629bad8'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='pid_t' type-id='3629bad8' id='587f89d2'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_nvme_accel_completion_cb' type-id='1ed1e4cd' id='70af6b93'/>
    <typedef-decl name='spdk_nvme_aer_cb' type-id='978ac92c' id='8565ca96'/>
    <typedef-decl name='spdk_nvme_cmd_cb' type-id='978ac92c' id='766930c6'/>
    <typedef-decl name='spdk_nvme_reg_cb' type-id='70f6a38a' id='e6ead4a4'/>
    <typedef-decl name='spdk_nvme_remove_cb' type-id='12bea681' id='b978a222'/>
    <typedef-decl name='spdk_nvme_req_next_sge_cb' type-id='292537ff' id='218012e4'/>
    <typedef-decl name='spdk_nvme_req_reset_sgl_cb' type-id='76794904' id='48c98c81'/>
    <typedef-decl name='spdk_nvme_timeout_cb' type-id='9871eaf6' id='818cfb43'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' id='45439f56'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='infinite' id='1e7b9b2b'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' id='25518ee9'>
      <subrange length='1024' type-id='f0981eeb' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' id='b68a110f'>
      <subrange length='10' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' id='1acf0601'>
      <subrange length='119' type-id='f0981eeb' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' id='ba8c55f2'>
      <subrange length='11' type-id='f0981eeb' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='120' id='fa97480e'>
      <subrange length='15' type-id='f0981eeb' id='8484ba73'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' id='d8dd2858'>
      <subrange length='204' type-id='f0981eeb' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' id='90687fee'>
      <subrange length='242' type-id='f0981eeb' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='22176' id='69638cee'>
      <subrange length='2772' type-id='f0981eeb' id='02edfe4b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' id='74b3417b'>
      <subrange length='3712' type-id='f0981eeb' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32760' id='2b536e1a'>
      <subrange length='4095' type-id='f0981eeb' id='bc14a217'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32768' id='2b55acb1'>
      <subrange length='4096' type-id='f0981eeb' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' id='0f562bd0'>
      <subrange length='6' type-id='f0981eeb' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' id='be0fa24b'>
      <subrange length='768' type-id='f0981eeb' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' id='cf30f637'>
      <subrange length='9' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' size-in-bits='64' visibility='default' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' size-in-bits='32' visibility='default' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb6' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fb1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fc1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fd7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43fc7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fd0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fd1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fbc' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fbb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fd6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fd6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fc5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fd4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fd5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fd2' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fc2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fca' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fcc' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fcb' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43fb4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fc9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43fb5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fbd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' size-in-bits='32' visibility='default' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fc4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdf' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb0' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fae' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fda' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' size-in-bits='32' visibility='default' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb7' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' size-in-bits='32' visibility='default' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb9' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' size-in-bits='32' visibility='default' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fcd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' size-in-bits='32' visibility='default' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fba' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb8' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd9' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbe' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbf' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc8' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc6' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fce' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fcf' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdb' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdc' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' size-in-bits='32' visibility='default' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd8' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fde' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43fe1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fe3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43fc0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fdd' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43faf' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='status_raw' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='status' type-id='38ef35c9' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__10' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb2' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe0' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fe2' visibility='default'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='72b49d60' const='yes' id='95b79f8b'/>
    <pointer-type-def type-id='95b79f8b' size-in-bits='64' id='51104a73'/>
    <qualified-type-def type-id='e0e1e78c' const='yes' id='a955db1b'/>
    <pointer-type-def type-id='a955db1b' size-in-bits='64' id='c3280e23'/>
    <pointer-type-def type-id='8adce621' size-in-bits='64' id='f6f849ad'/>
    <pointer-type-def type-id='223019a1' size-in-bits='64' id='0f552895'/>
    <pointer-type-def type-id='39eb7efb' size-in-bits='64' id='d0a508c7'/>
    <pointer-type-def type-id='82ce344b' size-in-bits='64' id='292537ff'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='b117a781' size-in-bits='64' id='a42628d9'/>
    <pointer-type-def type-id='615209f1' size-in-bits='64' id='d395c899'/>
    <pointer-type-def type-id='d395c899' size-in-bits='64' id='c7caf1c9'/>
    <pointer-type-def type-id='5bdb26bd' size-in-bits='64' id='9c23d1fd'/>
    <pointer-type-def type-id='9c23d1fd' size-in-bits='64' id='a3635575'/>
    <pointer-type-def type-id='f979a968' size-in-bits='64' id='728565ce'/>
    <pointer-type-def type-id='728565ce' size-in-bits='64' id='2bff65ec'/>
    <pointer-type-def type-id='dc04c171' size-in-bits='64' id='84aefac9'/>
    <pointer-type-def type-id='84aefac9' size-in-bits='64' id='c274f359'/>
    <pointer-type-def type-id='cfe40fb2' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='3e1ba881' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='6571814d' size-in-bits='64' id='ae42794d'/>
    <pointer-type-def type-id='04a82693' size-in-bits='64' id='67bf10c3'/>
    <pointer-type-def type-id='a0e8c12d' size-in-bits='64' id='538b928d'/>
    <pointer-type-def type-id='30a17994' size-in-bits='64' id='0d7532a2'/>
    <pointer-type-def type-id='0d7532a2' size-in-bits='64' id='b77e8c18'/>
    <pointer-type-def type-id='5c4cef53' size-in-bits='64' id='5f38ac73'/>
    <pointer-type-def type-id='5f38ac73' size-in-bits='64' id='3f37501b'/>
    <pointer-type-def type-id='487b2f7e' size-in-bits='64' id='dc2642c4'/>
    <pointer-type-def type-id='dc2642c4' size-in-bits='64' id='7e3b5caa'/>
    <pointer-type-def type-id='2e8e7df0' size-in-bits='64' id='663c4b46'/>
    <pointer-type-def type-id='7548cfcf' size-in-bits='64' id='d5db24a7'/>
    <pointer-type-def type-id='19c10ed2' size-in-bits='64' id='43edf320'/>
    <pointer-type-def type-id='7718a4aa' size-in-bits='64' id='5ca7f948'/>
    <pointer-type-def type-id='5ca7f948' size-in-bits='64' id='3e6d9546'/>
    <pointer-type-def type-id='411b4ac8' size-in-bits='64' id='16f1a48e'/>
    <pointer-type-def type-id='16f1a48e' size-in-bits='64' id='c2662e2c'/>
    <pointer-type-def type-id='dd417b27' size-in-bits='64' id='e44cedcf'/>
    <pointer-type-def type-id='c884ff2b' size-in-bits='64' id='dcc8163b'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='f749e2bb' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='4d39c5a2' size-in-bits='64' id='978ac92c'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='2131c8e5' size-in-bits='64' id='12bea681'/>
    <pointer-type-def type-id='6f744fd4' size-in-bits='64' id='9871eaf6'/>
    <pointer-type-def type-id='609191f2' size-in-bits='64' id='76794904'/>
    <pointer-type-def type-id='0f1ea160' size-in-bits='64' id='70f6a38a'/>
    <pointer-type-def type-id='48a24528' size-in-bits='64' id='51b945aa'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='cfe40fb2'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba881'/>
    <class-decl name='spdk_nvme_transport' size-in-bits='3264' is-struct='yes' visibility='default' id='e0e1e78c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ops' type-id='7e9ac88f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='link' type-id='e7f43fe4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2bb'/>
    <type-decl name='void' id='48b5725f'/>
    <function-decl name='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build' mangled-name='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_io_cmd_raw_no_payload_build'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_io_raw' mangled-name='spdk_nvme_ctrlr_cmd_io_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_io_raw'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='8f92235e' name='len'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_io_raw_with_md' mangled-name='spdk_nvme_ctrlr_cmd_io_raw_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_io_raw_with_md'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='8f92235e' name='len'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_admin_raw' mangled-name='spdk_nvme_ctrlr_cmd_admin_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_admin_raw'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='538b928d' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='8f92235e' name='len'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_set_feature' mangled-name='spdk_nvme_ctrlr_cmd_set_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_set_feature'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='feature'/>
      <parameter type-id='8f92235e' name='cdw11'/>
      <parameter type-id='8f92235e' name='cdw12'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_feature' mangled-name='spdk_nvme_ctrlr_cmd_get_feature' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_feature'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='feature'/>
      <parameter type-id='8f92235e' name='cdw11'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_feature_ns' mangled-name='spdk_nvme_ctrlr_cmd_get_feature_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_feature_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='feature'/>
      <parameter type-id='8f92235e' name='cdw11'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <parameter type-id='8f92235e' name='ns_id'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_set_feature_ns' mangled-name='spdk_nvme_ctrlr_cmd_set_feature_ns' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_set_feature_ns'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='feature'/>
      <parameter type-id='8f92235e' name='cdw11'/>
      <parameter type-id='8f92235e' name='cdw12'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <parameter type-id='8f92235e' name='ns_id'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_log_page_ext' mangled-name='spdk_nvme_ctrlr_cmd_get_log_page_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_log_page_ext'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='log_page'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='8f92235e' name='cdw10'/>
      <parameter type-id='8f92235e' name='cdw11'/>
      <parameter type-id='8f92235e' name='cdw14'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_get_log_page' mangled-name='spdk_nvme_ctrlr_cmd_get_log_page' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_get_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='log_page'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_abort' mangled-name='spdk_nvme_ctrlr_cmd_abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_abort'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <parameter type-id='149c6638' name='cid'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_abort_ext' mangled-name='spdk_nvme_ctrlr_cmd_abort_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_abort_ext'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='5ca7f948' name='qpair'/>
      <parameter type-id='eaa32e2f' name='cmd_cb_arg'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_security_receive' mangled-name='spdk_nvme_ctrlr_cmd_security_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_security_receive'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='secp'/>
      <parameter type-id='149c6638' name='spsp'/>
      <parameter type-id='b96825af' name='nssf'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_security_send' mangled-name='spdk_nvme_ctrlr_cmd_security_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_security_send'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='b96825af' name='secp'/>
      <parameter type-id='149c6638' name='spsp'/>
      <parameter type-id='b96825af' name='nssf'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_directive_send' mangled-name='spdk_nvme_ctrlr_cmd_directive_send' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_directive_send'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='8f92235e' name='doper'/>
      <parameter type-id='8f92235e' name='dtype'/>
      <parameter type-id='8f92235e' name='dspec'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='8f92235e' name='cdw12'/>
      <parameter type-id='8f92235e' name='cdw13'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_cmd_directive_receive' mangled-name='spdk_nvme_ctrlr_cmd_directive_receive' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_cmd_directive_receive'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='8f92235e' name='doper'/>
      <parameter type-id='8f92235e' name='dtype'/>
      <parameter type-id='8f92235e' name='dspec'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='8f92235e' name='cdw12'/>
      <parameter type-id='8f92235e' name='cdw13'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='8adce621'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='223019a1'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='39eb7efb'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='82ce344b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='90421557'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='48a24528'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='90421557'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='70af6b93'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='609191f2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0f1ea160'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='51104a73'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr_ocssd_cmd.c' language='LANG_C99'>
    <function-decl name='spdk_nvme_ctrlr_is_ocssd_supported' mangled-name='spdk_nvme_ctrlr_is_ocssd_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_ocssd_supported'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ocssd_ctrlr_cmd_geometry' mangled-name='spdk_nvme_ocssd_ctrlr_cmd_geometry' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ocssd_ctrlr_cmd_geometry'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='eaa32e2f' name='payload'/>
      <parameter type-id='8f92235e' name='payload_size'/>
      <parameter type-id='766930c6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_cuse.c' language='LANG_C99'>
    <function-decl name='spdk_nvme_cuse_register' mangled-name='spdk_nvme_cuse_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_register'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_unregister' mangled-name='spdk_nvme_cuse_unregister' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_unregister'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_update_namespaces' mangled-name='spdk_nvme_cuse_update_namespaces' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_update_namespaces'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_get_ctrlr_name' mangled-name='spdk_nvme_cuse_get_ctrlr_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_get_ctrlr_name'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='26a90f95' name='name'/>
      <parameter type-id='78c01427' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_cuse_get_ns_name' mangled-name='spdk_nvme_cuse_get_ns_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_cuse_get_ns_name'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='8f92235e' name='nsid'/>
      <parameter type-id='26a90f95' name='name'/>
      <parameter type-id='78c01427' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_discovery.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='6b40ccf0' size-in-bits='infinite' id='a8bdf52c'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <class-decl name='spdk_nvme_tcp_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' id='6d63b4d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sectype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='629227c2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page' size-in-bits='8192' is-struct='yes' visibility='default' id='fd3ac1ab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='genctr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='numrec' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='recfmt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved0' type-id='8afe3065' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='entries' type-id='a8bdf52c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page_entry' size-in-bits='8192' is-struct='yes' visibility='default' id='6b40ccf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='adrfam' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='treq' type-id='e7f43fe5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='portid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='asqsz' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='3d43e61c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trsvcid' type-id='d0f1c0cb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reserved1' type-id='f3fa1b1a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subnqn' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='traddr' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='tsas' type-id='e874a69d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_rdma_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' id='210ab761'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdma_qptype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rdma_prtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rdma_cms' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved0' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rdma_pkey' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved2' type-id='d05e5752' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fe5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secure_channel' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_nvme_discovery_cb' type-id='ac8c05a3' id='3f2e0350'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8048' id='8afe3065'>
      <subrange length='1006' type-id='f0981eeb' id='a0761f50'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1536' id='f3fa1b1a'>
      <subrange length='192' type-id='f0981eeb' id='3fea28a9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='176' id='3d43e61c'>
      <subrange length='22' type-id='f0981eeb' id='41cf2209'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1968' id='d05e5752'>
      <subrange length='246' type-id='f0981eeb' id='ca576a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2040' id='629227c2'>
      <subrange length='255' type-id='f0981eeb' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='f0981eeb' id='53010e10'/>
    </array-type-def>
    <union-decl name='spdk_nvmf_transport_specific_address_subtype' size-in-bits='2048' visibility='default' id='e874a69d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rdma' type-id='210ab761' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tcp' type-id='6d63b4d7' visibility='default'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='fd3ac1ab' size-in-bits='64' id='e9dc7ceb'/>
    <pointer-type-def type-id='51ff5e2f' size-in-bits='64' id='ac8c05a3'/>
    <function-decl name='spdk_nvme_ctrlr_get_discovery_log_page' mangled-name='spdk_nvme_ctrlr_get_discovery_log_page' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_discovery_log_page'>
      <parameter type-id='0d7532a2' name='ctrlr'/>
      <parameter type-id='3f2e0350' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='51ff5e2f'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='51104a73'/>
      <parameter type-id='e9dc7ceb'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ns.c' language='LANG_C99'>
    <enum-decl name='spdk_nvme_dealloc_logical_block_read_value' id='d59d4727'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_DEALLOC_NOT_REPORTED' value='0'/>
      <enumerator name='SPDK_NVME_DEALLOC_READ_00' value='1'/>
      <enumerator name='SPDK_NVME_DEALLOC_READ_FF' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_pi_type' id='b5f5d02e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_DISABLE' value='0'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE1' value='1'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE2' value='2'/>
      <enumerator name='SPDK_NVME_FMT_NVM_PROTECTION_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_nvme_dealloc_logical_block_read_value_t' type-id='d59d4727' id='80b8ce90'/>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='2e8e7df0' const='yes' id='61222049'/>
    <pointer-type-def type-id='61222049' size-in-bits='64' id='4bb8fbd9'/>
    <qualified-type-def type-id='4e56c4fd' const='yes' id='1fb4ca72'/>
    <pointer-type-def type-id='1fb4ca72' size-in-bits='64' id='419a8888'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <qualified-type-def type-id='b96825af' const='yes' id='2b61797f'/>
    <pointer-type-def type-id='2b61797f' size-in-bits='64' id='9f7200cf'/>
    <function-decl name='spdk_nvme_ns_get_id' mangled-name='spdk_nvme_ns_get_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_id'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_is_active' mangled-name='spdk_nvme_ns_is_active' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_is_active'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ctrlr' mangled-name='spdk_nvme_ns_get_ctrlr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ctrlr'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='0d7532a2'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_max_io_xfer_size' mangled-name='spdk_nvme_ns_get_max_io_xfer_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_max_io_xfer_size'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_sector_size' mangled-name='spdk_nvme_ns_get_sector_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_sector_size'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_extended_sector_size' mangled-name='spdk_nvme_ns_get_extended_sector_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_extended_sector_size'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_num_sectors' mangled-name='spdk_nvme_ns_get_num_sectors' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_num_sectors'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_size' mangled-name='spdk_nvme_ns_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_size'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_flags' mangled-name='spdk_nvme_ns_get_flags' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_flags'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_pi_type' mangled-name='spdk_nvme_ns_get_pi_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_pi_type'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='b5f5d02e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_supports_extended_lba' mangled-name='spdk_nvme_ns_supports_extended_lba' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_supports_extended_lba'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_supports_compare' mangled-name='spdk_nvme_ns_supports_compare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_supports_compare'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_md_size' mangled-name='spdk_nvme_ns_get_md_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_md_size'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_format_index' mangled-name='spdk_nvme_ns_get_format_index' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_format_index'>
      <parameter type-id='419a8888' name='nsdata'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_data' mangled-name='spdk_nvme_ns_get_data' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_data'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='419a8888'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_dealloc_logical_block_read_value' mangled-name='spdk_nvme_ns_get_dealloc_logical_block_read_value' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_dealloc_logical_block_read_value'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='80b8ce90'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_optimal_io_boundary' mangled-name='spdk_nvme_ns_get_optimal_io_boundary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_optimal_io_boundary'>
      <parameter type-id='663c4b46' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_nguid' mangled-name='spdk_nvme_ns_get_nguid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_nguid'>
      <parameter type-id='4bb8fbd9' name='ns'/>
      <return type-id='9f7200cf'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_uuid' mangled-name='spdk_nvme_ns_get_uuid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_uuid'>
      <parameter type-id='4bb8fbd9' name='ns'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_csi' mangled-name='spdk_nvme_ns_get_csi' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_csi'>
      <parameter type-id='4bb8fbd9' name='ns'/>
      <return type-id='fac3fed3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ana_group_id' mangled-name='spdk_nvme_ns_get_ana_group_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ana_group_id'>
      <parameter type-id='4bb8fbd9' name='ns'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ns_get_ana_state' mangled-name='spdk_nvme_ns_get_ana_state' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ns_get_ana_state'>
      <parameter type-id='4bb8fbd9' name='ns'/>
      <return type-id='78649e32'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ns_cmd.c' language='LANG_C99'>
    <enum-decl name='spdk_nvme_reservation_acquire_action' id='a2f65d1a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_ACQUIRE' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_PREEMPT' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_PREEMPT_ABORT' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_register_action' id='c065b103'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_REGISTER_KEY' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_UNREGISTER_KEY' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_REPLACE_KEY' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_register_cptpl' id='2835de9e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_NO_CHANGES' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_CLEAR_POWER_ON' value='2'/>
      <enumerator name='SPDK_NVME_RESERVE_PTPL_PERSIST_POWER_LOSS' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_release_action' id='51443505'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_RELEASE' value='0'/>
      <enumerator name='SPDK_NVME_RESERVE_CLEAR' value='1'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_reservation_type' id='bf8dc671'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_RESERVE_WRITE_EXCLUSIVE' value='1'/>
      <enumerator name='SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS' value='2'/>
      <enumerator name='SPDK_NVME_RESERVE_WRITE_EXCLUSIVE_REG_ONLY' value='3'/>
