<abi-corpus version='2.1' soname='libspdk_bdev_nvme.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.0'/>
    <dependency name='libspdk_util.so.6.0'/>
    <dependency name='libspdk_json.so.5.0'/>
    <dependency name='libspdk_jsonrpc.so.5.0'/>
    <dependency name='libspdk_rpc.so.5.0'/>
    <dependency name='libspdk_bdev.so.12.0'/>
    <dependency name='libspdk_thread.so.8.0'/>
    <dependency name='libspdk_accel.so.12.0'/>
    <dependency name='libspdk_nvme.so.10.0'/>
    <dependency name='libspdk_trace.so.8.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <abi-instr address-size='64' path='bdev_nvme.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1600' id='ed3da487'>
      <subrange length='200' type-id='f0981eeb' id='53119c2f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' id='ca634421'>
      <subrange length='224' type-id='f0981eeb' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' id='12da2087'>
      <subrange length='33' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='bdev_nvme_multipath_policy' id='0865efa4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BDEV_NVME_MP_POLICY_ACTIVE_PASSIVE' value='0'/>
      <enumerator name='BDEV_NVME_MP_POLICY_ACTIVE_ACTIVE' value='1'/>
    </enum-decl>
    <enum-decl name='bdev_nvme_multipath_selector' id='606dd107'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BDEV_NVME_MP_SELECTOR_ROUND_ROBIN' value='1'/>
      <enumerator name='BDEV_NVME_MP_SELECTOR_QUEUE_DEPTH' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_claim_type' id='e323b446'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_CLAIM_NONE' value='0'/>
      <enumerator name='SPDK_BDEV_CLAIM_EXCL_WRITE' value='1'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_ONE' value='2'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_NONE' value='3'/>
      <enumerator name='SPDK_BDEV_CLAIM_READ_MANY_WRITE_SHARED' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_type' id='9cd6c10c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_READ' value='1'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE' value='2'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_UNMAP' value='3'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_FLUSH' value='4'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_RESET' value='5'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_ADMIN' value='6'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO' value='7'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO_MD' value='8'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE_ZEROES' value='9'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZCOPY' value='10'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_GET_ZONE_INFO' value='11'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_MANAGEMENT' value='12'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_APPEND' value='13'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE' value='14'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE_AND_WRITE' value='15'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ABORT' value='16'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_HOLE' value='17'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_SEEK_DATA' value='18'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COPY' value='19'/>
      <enumerator name='SPDK_BDEV_NUM_IO_TYPES' value='20'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_status' id='7f167725'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_BDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_BDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_zone_action' id='85264f60'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_CLOSE' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_FINISH' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_OPEN' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_RESET' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_OFFLINE' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_dif_type' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_ana_state' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_ams' id='468f6380'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_AMS_RR' value='0'/>
      <enumerator name='SPDK_NVME_CC_AMS_WRR' value='1'/>
      <enumerator name='SPDK_NVME_CC_AMS_VS' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_css' id='1fb07fa0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_CSS_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CC_CSS_IOCS' value='6'/>
      <enumerator name='SPDK_NVME_CC_CSS_NOIO' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4096' id='d0b1608e'>
      <subrange length='32' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='__bdev_internal_claim_v1' size-in-bits='64' is-struct='yes' visibility='default' id='2ed5d19b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='b509a840' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_claim_v2' size-in-bits='192' is-struct='yes' visibility='default' id='2fd5d32e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='claims' type-id='d8335c47' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='key' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_fields' size-in-bits='2432' is-struct='yes' visibility='default' id='0dc6d312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qos' type-id='c0bd1bdf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qos_mod_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='status' type-id='7f167725' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='examine_in_progress' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='claim_type' type-id='e323b446' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='claim' type-id='8de368de' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unregister_cb' type-id='10afdbb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='unregister_td' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='open_descs' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='link' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='reset_in_progress' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='qd_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='qd_desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='period' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='new_period' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='temporary_queue_depth' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='measured_queue_depth' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='io_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='weighted_io_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='stat' type-id='08cc63f9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='qd_poll_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1800'>
        <var-decl name='histogram_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1808'>
        <var-decl name='histogram_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='locked_ranges' type-id='905ae936' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='pending_locked_ranges' type-id='905ae936' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='bdev_name' type-id='5baf3205' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_io_internal_fields' size-in-bits='2368' is-struct='yes' visibility='default' id='e7a9259f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_submit_ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb' type-id='a720f07e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='caller_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='submit_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='error' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='in_submit_request' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='status' type-id='ee31ee44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='split' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='472'>
        <var-decl name='retry_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='buf_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bounce_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bounce_md_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='orig_md_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='orig_iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='get_aux_buf_cb' type-id='030e7a71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_buf_cb' type-id='cb1f5f5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='link' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='buf_link' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ch_link' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='iobuf' type-id='71e32ba2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='waitq_entry' type-id='56e41d71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='data_transfer_cpl' type-id='1ed1e4cd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_module_internal_fields' size-in-bits='576' is-struct='yes' visibility='default' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='quiesced_ranges' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tailq' type-id='e7f43f77' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='lba_range_tailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='905ae936' visibility='default' id='088b1745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_async_probe_ctx' size-in-bits='11776' is-struct='yes' visibility='default' id='278fe5d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='probe_ctx' type-id='75dd38a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base_name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='names' type-id='7d3cd834' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='trid' type-id='8712472c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4832'>
        <var-decl name='bdev_opts' type-id='a1549748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='drv_opts' type-id='388558d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11584'>
        <var-decl name='cb_fn' type-id='78015367' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11648'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11712'>
        <var-decl name='populates_in_progress' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11744'>
        <var-decl name='ctrlr_attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11752'>
        <var-decl name='probe_done' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11760'>
        <var-decl name='namespaces_populated' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_bdev' size-in-bits='4928' is-struct='yes' visibility='default' id='88d0adcd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disk' type-id='f6507fdd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3968'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4032'>
        <var-decl name='nbdev_ctrlr' type-id='cc4d3dbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='ref' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4448'>
        <var-decl name='mp_policy' type-id='0865efa4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='mp_selector' type-id='606dd107' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='rr_min_io' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='nvme_ns_list' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='opal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='tailq' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='err_stat' type-id='f9daea09' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_bdev_ctrlr' size-in-bits='448' is-struct='yes' visibility='default' id='9374e0f7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctrlrs' type-id='e7f43f7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bdevs' type-id='e7f43f7b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tailq' type-id='e7f43f7c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_bdev_ctrlrs' size-in-bits='128' is-struct='yes' visibility='default' id='a4fd6fcc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='cc4d3dbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3297f18f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_ctrlr' size-in-bits='1984' is-struct='yes' visibility='default' id='62183331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr' type-id='0d7532a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='active_path_id' type-id='39ebbf75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='resetting' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='161'>
        <var-decl name='reconnect_is_delayed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='162'>
        <var-decl name='fast_io_fail_timedout' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='163'>
        <var-decl name='destruct' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='164'>
        <var-decl name='ana_log_page_updating' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='165'>
        <var-decl name='io_path_cache_clearing' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='166'>
        <var-decl name='dont_retry' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='opts' type-id='a1549748' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='namespaces' type-id='bc9516ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opal_dev' type-id='cc582394' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='adminq_timer_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='reset_cb_fn' type-id='e1a70144' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='reset_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reset_detach_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='detach_ctx' type-id='57e3d1ac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='reset_start_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='reconnect_delay_timer' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='disconnected_cb' type-id='b3f5ecd2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tailq' type-id='e7f43f7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nbdev_ctrlr' type-id='cc4d3dbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='trids' type-id='3519896c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='max_ana_log_page_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ana_log_page' type-id='67bf10c3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='copied_ana_desc' type-id='ae42794d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='probe_ctx' type-id='ceb50d83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_ctrlr_opts' size-in-bits='160' is-struct='yes' visibility='default' id='a1549748'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prchk_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ctrlr_loss_timeout_sec' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reconnect_delay_sec' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fast_io_fail_timeout_sec' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='from_discovery_service' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_error_stat' size-in-bits='33024' is-struct='yes' visibility='default' id='aacc0401'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status_type' type-id='2f8b211b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='4338405c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_ns' size-in-bits='896' is-struct='yes' visibility='default' id='344f932b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ns' type-id='663c4b46' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctrlr' type-id='daac20d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bdev' type-id='69f8599d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ana_group_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ana_state' type-id='78649e32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ana_state_updating' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='ana_transition_timedout' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='anatt_timer' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='probe_ctx' type-id='ceb50d83' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tailq' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='node' type-id='e7f43f7f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='stat' type-id='08cc63f9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_ns_tree' size-in-bits='64' is-struct='yes' visibility='default' id='bc9516ec'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='94b7b13b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_path_id' size-in-bits='7040' is-struct='yes' visibility='default' id='8632cbc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trid' type-id='8712472c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='hostid' type-id='81599aaf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='link' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6976'>
        <var-decl name='is_failed' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nvme_paths' size-in-bits='128' is-struct='yes' visibility='default' id='3519896c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='39ebbf75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='8d1e428d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev' size-in-bits='3968' is-struct='yes' visibility='default' id='f6507fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aliases' type-id='ad35c6ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='product_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_cache' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='split_on_write_unit' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='write_unit_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='acwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='required_alignment' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='600'>
        <var-decl name='split_on_optimal_io_boundary' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='optimal_io_boundary' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_segment_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='max_num_segments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='max_unmap' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_unmap_segments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_zeroes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='max_copy' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='md_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='dif_is_head_of_md' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='dif_check_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='zoned' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='zone_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='max_zone_append_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='max_open_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='max_active_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1312'>
        <var-decl name='optimal_open_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='media_events' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1360'>
        <var-decl name='reset_io_drain_timeout' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='module' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='fn_table' type-id='9750090a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='internal' type-id='0dc6d312' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_alias' size-in-bits='448' is-struct='yes' visibility='default' id='5b4f6d22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alias' type-id='5baf3205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tailq' type-id='e7f43f81' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_aliases_list' size-in-bits='128' is-struct='yes' visibility='default' id='ad35c6ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='6e513b50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='23e0a10e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_fn_table' size-in-bits='768' is-struct='yes' visibility='default' id='bcf92cc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='b9b212f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='ce046974' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_type_supported' type-id='dd06e335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_io_channel' type-id='ddc2673d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dump_info_json' type-id='4184f7d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_config_json' type-id='e4c0e0eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_spin_time' type-id='857b42bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_module_ctx' type-id='5ad9edb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_memory_domains' type-id='19c4f5a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='reset_device_stat' type-id='b7f9d8e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='dump_device_stat_json' type-id='e87c492d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='accel_sequence_supported' type-id='dd06e335' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io' size-in-bits='7936' is-struct='yes' visibility='default' id='68ee9836'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='num_retries' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_iov' type-id='d0b1608e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='u' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='module_link' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5568'>
        <var-decl name='internal' type-id='e7a9259f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7936'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_stat' size-in-bits='1408' is-struct='yes' visibility='default' id='21c89d01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bytes_read' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_read_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bytes_written' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_write_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bytes_unmapped' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_unmap_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='bytes_copied' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='num_copy_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='read_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='max_read_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='min_read_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='write_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='max_write_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='min_write_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='unmap_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='max_unmap_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='min_unmap_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='copy_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_copy_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='min_copy_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ticks_rate' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='io_error' type-id='0bc48c8c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f82' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module' size-in-bits='1216' is-struct='yes' visibility='default' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='eb9d423e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='f1f36be0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='f1f36be0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module_claim' size-in-bits='512' is-struct='yes' visibility='default' id='564b2089'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='16dc656a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='link' type-id='e7f43f83' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_name' size-in-bits='320' is-struct='yes' visibility='default' id='5baf3205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f84' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' size-in-bits='192' is-struct='yes' visibility='default' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ana_group_descriptor' size-in-bits='256' is-struct='yes' visibility='default' id='6571814d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_group_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_of_nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='change_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ana_state' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='reserved1' type-id='fa97480e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nsid' type-id='1e7b9b2b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ana_page' size-in-bits='128' is-struct='yes' visibility='default' id='04a82693'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='change_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_ana_group_desc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved' type-id='0f562bd0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_opts' size-in-bits='6544' is-struct='yes' visibility='default' id='388558d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_io_queues' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_cmb_sqs' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='no_shn_notification' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='reserved6' type-id='0f4b9e74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arb_mechanism' type-id='468f6380' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arbitration_burst' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='low_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='medium_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='high_priority_weight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_retry_count' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='reserved21' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='src_addr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='src_svcid' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4368'>
        <var-decl name='host_id' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4432'>
        <var-decl name='extended_host_id' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4560'>
        <var-decl name='reserved570' type-id='0f4b9e74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='command_set' type-id='1fb07fa0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='admin_timeout_ms' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='header_digest' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4648'>
        <var-decl name='data_digest' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4656'>
        <var-decl name='disable_error_logging' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4664'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='admin_queue_size' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4688'>
        <var-decl name='reserved586' type-id='0f562bd0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='fabrics_connect_timeout_us' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='disable_read_ana_log_page' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='reserved610' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='disable_read_changed_ns_list_log_page' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4936'>
        <var-decl name='psk' type-id='ed3da487' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_host_id' size-in-bits='2320' is-struct='yes' visibility='default' id='81599aaf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostaddr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='hostsvcid' type-id='12da2087' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' size-in-bits='4512' is-struct='yes' visibility='default' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' size-in-bits='256' is-struct='yes' visibility='default' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab59c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='v2_claims' size-in-bits='128' is-struct='yes' visibility='default' id='d8335c47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='87d40811' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='0dc8f4e1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='1088' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fused_iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fused_iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='stored_user_cb' type-id='a720f07e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='split_remaining_num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='split_current_offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='split_outstanding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='zcopy' type-id='e7f43f87' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='abort' type-id='e7f43f88' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='seek' type-id='e7f43f89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy' type-id='e7f43f8a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__75' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='69f8599d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='88f53b15' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__79' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='69f8599d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='88f53b15' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__80' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='cc4d3dbf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='3297f18f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__78' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='daac20d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='2ff7de89' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='daac20d9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='2ff7de89' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='94b7b13b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='94b7b13b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='94b7b13b' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='94b7b13b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='2e2bbdc3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='94b7b13b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='2e2bbdc3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='39ebbf75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8d1e428d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7cbf4535' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='6e513b50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='23e0a10e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__72' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3ecde4cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_to_abort' type-id='378e9c1c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__67' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='378e9c1c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ab7fe902' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__70' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__71' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='87d40811' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='0dc8f4e1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch_ref' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='wait_poller' type-id='e7f43f8d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__69' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd' type-id='a0e8c12d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nbytes' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='md_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stop_time_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sct' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sc' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zone_action' type-id='85264f60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='populate' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='commit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='start' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sk' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='asc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ascq' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='bdev_nvme_reset_cb' type-id='7f8b4dc2' id='e1a70144'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='lba_range_tailq_t' type-id='088b1745' id='905ae936'/>
    <typedef-decl name='nvme_ctrlr_disconnected_cb' type-id='bff891fc' id='b3f5ecd2'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_create_nvme_fn' type-id='f8a85803' id='78015367'/>
    <typedef-decl name='spdk_bdev_io_completion_cb' type-id='0818f3c5' id='a720f07e'/>
    <typedef-decl name='spdk_bdev_io_get_aux_buf_cb' type-id='47423596' id='030e7a71'/>
    <typedef-decl name='spdk_bdev_io_get_buf_cb' type-id='adc98f44' id='cb1f5f5e'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' id='065af103'/>
    <typedef-decl name='spdk_bdev_unregister_cb' type-id='1ed1e4cd' id='10afdbb3'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='fa35b1b9' id='8b006695'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <array-type-def dimensions='2' type-id='8f92235e' size-in-bits='32768' id='4338405c'>
      <subrange length='4' type-id='f0981eeb' id='16fe7105'/>
      <subrange length='256' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='256' id='2f8b211b'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='infinite' id='1e7b9b2b'>
      <subrange length='infinite' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='120' id='fa97480e'>
      <subrange length='15' type-id='f0981eeb' id='8484ba73'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' id='0f562bd0'>
      <subrange length='6' type-id='f0981eeb' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='infinite' id='048fe7bc'>
