<abi-corpus version='2.4' soname='libspdk_nvme.so.16.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libfuse3.so.3'/>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_keyring.so.3.0'/>
    <dependency name='libspdk_sock.so.12.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libspdk_dma.so.6.0'/>
    <dependency name='libspdk_vfio_user.so.6.0'/>
    <dependency name='libspdk_rdma_provider.so.8.0'/>
    <dependency name='libspdk_rdma_utils.so.2.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvme_build_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_connect_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvme_cpl_get_status_type_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_memzone_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_memzone_lookup' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_memzone_reserve' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_compare' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_fmt' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_parse' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_allow' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_attach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read16' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_write16' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_claim' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_detach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_disable_interrupts' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_enable_interrupts' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_addr' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_interrupt_efd_by_index' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_is_removed' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_unclaim' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_unmap_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_driver_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_enumerate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_event_listen' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_get_event' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_nvme_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_register_error_handler' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_process_is_primary' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_realloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_dequeue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_enqueue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_unaffinitize_thread' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_vtophys' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='nvme.c' language='LANG_C11'>
    <class-decl name='spdk_nvme_host_id' is-struct='yes' visibility='default' size-in-bits='2320' filepath='nvme.h' line='550' column='1' hash='0e68b152e21e7483' id='81599aaf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='hostaddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='hostsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='565' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_nvme_attach_cb' type-id='d09bd471' size-in-bits='64' filepath='nvme.h' line='868' column='1' hash='fd7a63c0c6c822c4' id='196479c9'/>
    <typedef-decl name='spdk_nvme_attach_fail_cb' type-id='df19448c' size-in-bits='64' filepath='nvme.h' line='880' column='1' hash='fd7a63c0c6c822c4' id='499fb374'/>
    <typedef-decl name='spdk_nvme_probe_cb' type-id='09a72931' size-in-bits='64' filepath='nvme.h' line='854' column='1' hash='fd7a63c0c6c822c4' id='abc0b7d8'/>
    <pointer-type-def type-id='242fa1d8' size-in-bits='64' hash='fd7a63c0c6c822c4' id='09a72931'/>
    <pointer-type-def type-id='81599aaf' size-in-bits='64' hash='76e3848b36680f1a' id='4b0091b7'/>
    <pointer-type-def type-id='8cd337c8' size-in-bits='64' hash='af575e3a90c61b58' id='8035fbf9'/>
    <pointer-type-def type-id='72aef3b2' size-in-bits='64' hash='f2bde6be00ed4f7e' id='a85c83ff'/>
    <pointer-type-def type-id='f01d71a9' size-in-bits='64' hash='fd7a63c0c6c822c4' id='df19448c'/>
    <pointer-type-def type-id='b2a984a4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='d09bd471'/>
    <pointer-type-def type-id='7528a00e' size-in-bits='64' id='ebba7414'/>
    <pointer-type-def type-id='30a17994' size-in-bits='64' id='0d7532a2'/>
    <pointer-type-def type-id='0e876556' size-in-bits='64' id='57e3d1ac'/>
    <pointer-type-def type-id='57e3d1ac' size-in-bits='64' id='e1a2d5f2'/>
    <pointer-type-def type-id='a394da29' size-in-bits='64' id='75dd38a1'/>
    <function-decl name='spdk_nvme_detach' mangled-name='spdk_nvme_detach' filepath='nvme.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_async' mangled-name='spdk_nvme_detach_async' filepath='nvme.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_async' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='135' column='1'/>
      <parameter type-id='e1a2d5f2' name='_detach_ctx' filepath='nvme.c' line='136' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll_async' mangled-name='spdk_nvme_detach_poll_async' filepath='nvme.c' line='178' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll_async' hash='388da3fa973fde78'>
      <parameter type-id='57e3d1ac' name='detach_ctx' filepath='nvme.c' line='178' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_detach_poll' mangled-name='spdk_nvme_detach_poll' filepath='nvme.c' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_detach_poll' hash='7f32ffea222edbe7'>
      <parameter type-id='57e3d1ac' name='detach_ctx' filepath='nvme.c' line='206' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe' mangled-name='spdk_nvme_probe' filepath='nvme.c' line='869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe' hash='80bf9e73d159049a'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='869' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='869' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='870' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='870' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='871' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_ext' mangled-name='spdk_nvme_probe_ext' filepath='nvme.c' line='877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_ext' hash='b27e4554929c0a85'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='877' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='877' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='878' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='878' column='1'/>
      <parameter type-id='499fb374' name='attach_fail_cb' filepath='nvme.c' line='879' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='879' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect' mangled-name='spdk_nvme_connect' filepath='nvme.c' line='979' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect' hash='0448ca1c8eab64e4'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='979' column='1'/>
      <parameter type-id='69be0b8c' name='opts' filepath='nvme.c' line='980' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme.c' line='980' column='1'/>
      <return type-id='0d7532a2'/>
    </function-decl>
    <function-decl name='spdk_nvme_trid_populate_transport' mangled-name='spdk_nvme_trid_populate_transport' filepath='nvme.c' line='1023' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_trid_populate_transport' hash='0014900cc9fc140a'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1023' column='1'/>
      <parameter type-id='8cd337c8' name='trtype' filepath='nvme.c' line='1024' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_populate_trstring' mangled-name='spdk_nvme_transport_id_populate_trstring' filepath='nvme.c' line='1057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_populate_trstring' hash='d88304c328bd8e19'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1221' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1221' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_trtype' mangled-name='spdk_nvme_transport_id_parse_trtype' filepath='nvme.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_trtype' hash='cf6fd13f42fd9da3'>
      <parameter type-id='8035fbf9' name='trtype' filepath='nvme.c' line='1084' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1084' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_trtype_str' mangled-name='spdk_nvme_transport_id_trtype_str' filepath='nvme.c' line='1107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_trtype_str' hash='a6b21d1322afaa23'>
      <parameter type-id='8cd337c8' name='trtype' filepath='nvme.c' line='1107' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse_adrfam' mangled-name='spdk_nvme_transport_id_parse_adrfam' filepath='nvme.c' line='1128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse_adrfam' hash='aa1db65819a7d1c8'>
      <parameter type-id='a85c83ff' name='adrfam' filepath='nvme.c' line='1128' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1128' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_adrfam_str' mangled-name='spdk_nvme_transport_id_adrfam_str' filepath='nvme.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_adrfam_str' hash='b5f01304c9062a4e'>
      <parameter type-id='72aef3b2' name='adrfam' filepath='nvme.c' line='1149' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_parse' mangled-name='spdk_nvme_transport_id_parse' filepath='nvme.c' line='1221' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_parse' hash='d88304c328bd8e19'>
      <parameter type-id='6f56757a' name='trid' filepath='nvme.c' line='1221' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1221' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_host_id_parse' mangled-name='spdk_nvme_host_id_parse' filepath='nvme.c' line='1315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_host_id_parse' hash='18f6e4d8c93be987'>
      <parameter type-id='4b0091b7' name='hostid' filepath='nvme.c' line='1315' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1315' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_transport_id_compare' mangled-name='spdk_nvme_transport_id_compare' filepath='nvme.c' line='1382' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_transport_id_compare' hash='ddd40dde69ccd642'>
      <parameter type-id='7e9611b1' name='trid1' filepath='nvme.c' line='1382' column='1'/>
      <parameter type-id='7e9611b1' name='trid2' filepath='nvme.c' line='1383' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_parse' mangled-name='spdk_nvme_prchk_flags_parse' filepath='nvme.c' line='1435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_parse' hash='e93b08feb1771e16'>
      <parameter type-id='90421557' name='prchk_flags' filepath='nvme.c' line='1435' column='1'/>
      <parameter type-id='80f4b756' name='str' filepath='nvme.c' line='1435' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_prchk_flags_str' mangled-name='spdk_nvme_prchk_flags_str' filepath='nvme.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_prchk_flags_str' hash='cf5212e813271279'>
      <parameter type-id='8f92235e' name='prchk_flags' filepath='nvme.c' line='1470' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_scan_attached' mangled-name='spdk_nvme_scan_attached' filepath='nvme.c' line='1488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_scan_attached' hash='92fc56849108da7b'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1488' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_async' mangled-name='spdk_nvme_probe_async' filepath='nvme.c' line='1514' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_async' hash='ba018a83f2dcb5bf'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1514' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='1515' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='1516' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='1517' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='1518' column='1'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_async_ext' mangled-name='spdk_nvme_probe_async_ext' filepath='nvme.c' line='1524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_async_ext' hash='4df624541fd6a25e'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1524' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme.c' line='1525' column='1'/>
      <parameter type-id='abc0b7d8' name='probe_cb' filepath='nvme.c' line='1526' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='1527' column='1'/>
      <parameter type-id='499fb374' name='attach_fail_cb' filepath='nvme.c' line='1528' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme.c' line='1529' column='1'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <function-decl name='spdk_nvme_probe_poll_async' mangled-name='spdk_nvme_probe_poll_async' filepath='nvme.c' line='1556' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_probe_poll_async' hash='388da3fa973fde78'>
      <parameter type-id='75dd38a1' name='probe_ctx' filepath='nvme.c' line='1556' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_connect_async' mangled-name='spdk_nvme_connect_async' filepath='nvme.c' line='1598' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_connect_async' hash='6c08dc590a1c924f'>
      <parameter type-id='7e9611b1' name='trid' filepath='nvme.c' line='1598' column='1'/>
      <parameter type-id='69be0b8c' name='opts' filepath='nvme.c' line='1599' column='1'/>
      <parameter type-id='196479c9' name='attach_cb' filepath='nvme.c' line='1600' column='1'/>
      <return type-id='75dd38a1'/>
    </function-decl>
    <class-decl name='spdk_nvme_detach_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='nvme_internal.h' line='1181' column='1' id='0e876556'/>
    <class-decl name='spdk_nvme_probe_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='nvme_internal.h' line='1185' column='1' id='a394da29'/>
    <function-type size-in-bits='64' hash='ab490e2751f744bf' id='242fa1d8'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='f5423aff'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' hash='c20fc3bac8ab21d9' id='f01d71a9'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='0d1aad9a9d8841d1' id='b2a984a4'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7e9611b1'/>
      <parameter type-id='0d7532a2'/>
      <parameter type-id='69be0b8c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='f5b6fd04'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='6fe2b829'>
      <parameter type-id='75dd38a1' name='probe_ctx' filepath='nvme.c' line='1556' column='1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='2131c8e5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a2'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_auth.c' language='LANG_C11'>
    <enum-decl name='spdk_nvmf_dhchap_dhgroup' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='475' column='1' hash='6479d8517b7b9644' id='f5a5567b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_NULL' value='0'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_2048' value='1'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_3072' value='2'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_4096' value='3'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_6144' value='4'/>
      <enumerator name='SPDK_NVMF_DHCHAP_DHGROUP_8192' value='5'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_dhchap_hash' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='467' column='1' hash='943c598b7ce01f38' id='25208824'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_DHCHAP_HASH_NONE' value='0'/>
      <enumerator name='SPDK_NVMF_DHCHAP_HASH_SHA256' value='1'/>
      <enumerator name='SPDK_NVMF_DHCHAP_HASH_SHA384' value='2'/>
      <enumerator name='SPDK_NVMF_DHCHAP_HASH_SHA512' value='3'/>
    </enum-decl>
    <pointer-type-def type-id='1bef703f' size-in-bits='64' id='f004afe7'/>
    <pointer-type-def type-id='cab020b5' size-in-bits='64' id='cc5478f5'/>
    <pointer-type-def type-id='cc5478f5' size-in-bits='64' id='87fa470d'/>
    <pointer-type-def type-id='7718a4aa' size-in-bits='64' id='5ca7f948'/>
    <class-decl name='spdk_key' is-struct='yes' visibility='default' is-declaration-only='yes' id='1bef703f'/>
    <class-decl name='spdk_nvme_dhchap_dhkey' is-struct='yes' visibility='default' is-declaration-only='yes' id='cab020b5'/>
    <function-decl name='spdk_nvme_dhchap_get_digest_id' mangled-name='spdk_nvme_dhchap_get_digest_id' filepath='nvme_auth.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_get_digest_id' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='dhgroup' filepath='nvme_auth.c' line='93' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_get_digest_name' mangled-name='spdk_nvme_dhchap_get_digest_name' filepath='nvme_auth.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_get_digest_name' hash='7cffa03161e7e042'>
      <parameter type-id='95e97e5e' name='id' filepath='nvme_auth.c' line='107' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_get_dhgroup_id' mangled-name='spdk_nvme_dhchap_get_dhgroup_id' filepath='nvme_auth.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_get_dhgroup_id' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='dhgroup' filepath='nvme_auth.c' line='93' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_get_dhgroup_name' mangled-name='spdk_nvme_dhchap_get_dhgroup_name' filepath='nvme_auth.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_get_dhgroup_name' hash='7cffa03161e7e042'>
      <parameter type-id='95e97e5e' name='id' filepath='nvme_auth.c' line='107' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_get_digest_length' mangled-name='spdk_nvme_dhchap_get_digest_length' filepath='nvme_auth.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_get_digest_length' hash='958caec14f108579'>
      <parameter type-id='95e97e5e' name='id' filepath='nvme_auth.c' line='121' column='1'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_calculate' mangled-name='spdk_nvme_dhchap_calculate' filepath='nvme_auth.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_calculate' hash='43f11caa0343c0b9'>
      <parameter type-id='f004afe7' name='key' filepath='nvme_auth.c' line='400' column='1'/>
      <parameter type-id='25208824' name='hash' filepath='nvme_auth.c' line='400' column='1'/>
      <parameter type-id='80f4b756' name='type' filepath='nvme_auth.c' line='401' column='1'/>
      <parameter type-id='8f92235e' name='seq' filepath='nvme_auth.c' line='401' column='1'/>
      <parameter type-id='149c6638' name='tid' filepath='nvme_auth.c' line='401' column='1'/>
      <parameter type-id='b96825af' name='scc' filepath='nvme_auth.c' line='401' column='1'/>
      <parameter type-id='80f4b756' name='nqn1' filepath='nvme_auth.c' line='402' column='1'/>
      <parameter type-id='80f4b756' name='nqn2' filepath='nvme_auth.c' line='402' column='1'/>
      <parameter type-id='eaa32e2f' name='dhkey' filepath='nvme_auth.c' line='402' column='1'/>
      <parameter type-id='b59d7dce' name='dhlen' filepath='nvme_auth.c' line='402' column='1'/>
      <parameter type-id='eaa32e2f' name='cval' filepath='nvme_auth.c' line='403' column='1'/>
      <parameter type-id='eaa32e2f' name='rval' filepath='nvme_auth.c' line='403' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_generate_dhkey' mangled-name='spdk_nvme_dhchap_generate_dhkey' filepath='nvme_auth.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_generate_dhkey' hash='6043620c168c09be'>
      <parameter type-id='f5a5567b' name='dhgroup' filepath='nvme_auth.c' line='481' column='1'/>
      <return type-id='cc5478f5'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_dhkey_free' mangled-name='spdk_nvme_dhchap_dhkey_free' filepath='nvme_auth.c' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_dhkey_free' hash='7f32ffea222edbe7'>
      <parameter type-id='87fa470d' name='key' filepath='nvme_auth.c' line='512' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_dhkey_get_pubkey' mangled-name='spdk_nvme_dhchap_dhkey_get_pubkey' filepath='nvme_auth.c' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_dhkey_get_pubkey' hash='7d89e85eebc58a80'>
      <parameter type-id='cc5478f5' name='dhkey' filepath='nvme_auth.c' line='523' column='1'/>
      <parameter type-id='eaa32e2f' name='pub' filepath='nvme_auth.c' line='523' column='1'/>
      <parameter type-id='78c01427' name='len' filepath='nvme_auth.c' line='523' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_dhchap_dhkey_derive_secret' mangled-name='spdk_nvme_dhchap_dhkey_derive_secret' filepath='nvme_auth.c' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_dhchap_dhkey_derive_secret' hash='b3b61834beb80b69'>
      <parameter type-id='cc5478f5' name='dhkey' filepath='nvme_auth.c' line='612' column='1'/>
      <parameter type-id='eaa32e2f' name='peer' filepath='nvme_auth.c' line='613' column='1'/>
      <parameter type-id='b59d7dce' name='peerlen' filepath='nvme_auth.c' line='613' column='1'/>
      <parameter type-id='eaa32e2f' name='secret' filepath='nvme_auth.c' line='613' column='1'/>
      <parameter type-id='78c01427' name='seclen' filepath='nvme_auth.c' line='613' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_qpair_authenticate' mangled-name='spdk_nvme_qpair_authenticate' filepath='nvme_auth.c' line='1265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_qpair_authenticate' hash='a7f99494147764a8'>
      <parameter type-id='5ca7f948' name='qpair' filepath='nvme_auth.c' line='1265' column='1'/>
      <parameter type-id='283aeba5' name='cb_fn' filepath='nvme_auth.c' line='1266' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme_auth.c' line='1266' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' hash='6ed507bb73d52e47' id='ca634421'>
      <subrange length='224' lower-bound='0' upper-bound='223' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='13efbde50778ea2c' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' hash='4b216217eb2844ff' id='12da2087'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <enum-decl name='spdk_nvme_cc_ams' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='678' column='1' hash='173cec4dd356b4b5' id='468f6380'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_AMS_RR' value='0'/>
      <enumerator name='SPDK_NVME_CC_AMS_WRR' value='1'/>
      <enumerator name='SPDK_NVME_CC_AMS_VS' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_css' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='117' column='1' hash='839f455cd031a1d0' id='1fb07fa0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_CSS_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CC_CSS_IOCS' value='6'/>
      <enumerator name='SPDK_NVME_CC_CSS_NOIO' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_fw_commit_action' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='4153' column='1' hash='3b8a5fabad6db9a5' id='0009b8fa'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_IMG' value='0'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_AND_ENABLE_IMG' value='1'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ENABLE_IMG' value='2'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_RUN_IMG' value='3'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_REPLACE_BOOT_PARTITION' value='6'/>
      <enumerator name='SPDK_NVME_FW_COMMIT_ACTIVATE_BOOT_PARTITION' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qp_failure_reason' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='416' column='1' hash='143315ec0e0ba58d' id='738b4017'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_NONE' value='0'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_LOCAL' value='1'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_REMOTE' value='2'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_UNKNOWN' value='3'/>
      <enumerator name='SPDK_NVME_QPAIR_FAILURE_RESET' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_qprio' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='653' column='1' hash='6c5dd7c7e698aa47' id='438eb703'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_QPRIO_URGENT' value='0'/>
      <enumerator name='SPDK_NVME_QPRIO_HIGH' value='1'/>
      <enumerator name='SPDK_NVME_QPRIO_MEDIUM' value='2'/>
      <enumerator name='SPDK_NVME_QPRIO_LOW' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='435' column='1' hash='a773cdff5c729a70' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='116' column='1' hash='26614543a63ed59a' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' hash='7f2e925fbbd5f331' id='d0740e9b'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' hash='061dc5075fa0153c' id='3a071e7d'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' hash='58e6b55d0796a605' id='bf64ebc5'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='ede1f91d' visibility='default' filepath='struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='8910171f' visibility='default' filepath='struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='8e100159' visibility='default' filepath='struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_spdk_pci_device_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='765' column='1' hash='38fc92e059e2dd5b' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='766' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='776' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_event_handler_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='fd_group.h' line='36' column='1' hash='e7ab4467a2066d96' id='67302c12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='fd_group.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='events' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fd_type' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2197' column='1' hash='625bfd40fd7a4ce6' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2199' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' is-struct='yes' visibility='default' size-in-bits='2048' filepath='nvme_spec.h' line='2102' column='1' hash='8881fab07f5b51bb' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f73' visibility='default' filepath='nvme_spec.h' line='2117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f74' visibility='default' filepath='nvme_spec.h' line='2127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default' filepath='nvme_spec.h' line='2129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2160' column='1' hash='d44d55926a6dbf9e' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' is-struct='yes' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2202' column='1' hash='9636b79acb9332bc' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2147' column='1' hash='689f98af8f67664b' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' is-struct='yes' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2133' column='1' hash='806ee8c5d272ff30' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2143' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvme_spec.h' line='2300' column='1' hash='9acd0c5b6825c66b' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default' filepath='nvme_spec.h' line='2310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default' filepath='nvme_spec.h' line='2313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default' filepath='nvme_spec.h' line='2316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f75' visibility='default' filepath='nvme_spec.h' line='2331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default' filepath='nvme_spec.h' line='2340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default' filepath='nvme_spec.h' line='2349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='627055da' visibility='default' filepath='nvme_spec.h' line='2352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default' filepath='nvme_spec.h' line='2366' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default' filepath='nvme_spec.h' line='2368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f76' visibility='default' filepath='nvme_spec.h' line='2379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f77' visibility='default' filepath='nvme_spec.h' line='2388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f78' visibility='default' filepath='nvme_spec.h' line='2399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvme_spec.h' line='2404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f79' visibility='default' filepath='nvme_spec.h' line='2427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f7a' visibility='default' filepath='nvme_spec.h' line='2446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f7b' visibility='default' filepath='nvme_spec.h' line='2460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f7c' visibility='default' filepath='nvme_spec.h' line='2468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f7d' visibility='default' filepath='nvme_spec.h' line='2501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2504' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab595' visibility='default' filepath='nvme_spec.h' line='2515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab596' visibility='default' filepath='nvme_spec.h' line='2541' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab597' visibility='default' filepath='nvme_spec.h' line='2558' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f7e' visibility='default' filepath='nvme_spec.h' line='2585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default' filepath='nvme_spec.h' line='2598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default' filepath='nvme_spec.h' line='2604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f7f' visibility='default' filepath='nvme_spec.h' line='2612' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f7f' visibility='default' filepath='nvme_spec.h' line='2618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2620' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvme_spec.h' line='2626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvme_spec.h' line='2629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f80' visibility='default' filepath='nvme_spec.h' line='2637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2650' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2653' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f82' visibility='default' filepath='nvme_spec.h' line='2665' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvme_spec.h' line='2668' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2671' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2677' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default' filepath='nvme_spec.h' line='2679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvme_spec.h' line='2681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default' filepath='nvme_spec.h' line='2683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvme_spec.h' line='2685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default' filepath='nvme_spec.h' line='2688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default' filepath='nvme_spec.h' line='2691' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_key_opts' is-struct='yes' visibility='default' size-in-bits='192' filepath='nvme.h' line='1234' column='1' hash='29a8423c132431a6' id='f50aab2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='1236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dhchap_key' type-id='f004afe8' visibility='default' filepath='nvme.h' line='1238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dhchap_ctrlr_key' type-id='f004afe8' visibility='default' filepath='nvme.h' line='1240' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_list' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvme_spec.h' line='4062' column='1' hash='2334212e9a00483b' id='448e2afd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_count' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='4063' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ctrlr_list' type-id='2ca8d8c8' visibility='default' filepath='nvme_spec.h' line='4064' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_opts' is-struct='yes' visibility='default' size-in-bits='6848' filepath='nvme.h' line='49' column='1' hash='d4f437bc8a6db7ec' id='388558d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_io_queues' type-id='8f92235e' visibility='default' filepath='nvme.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_cmb_sqs' type-id='c894953d' visibility='default' filepath='nvme.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='no_shn_notification' type-id='c894953d' visibility='default' filepath='nvme.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_interrupts' type-id='c894953d' visibility='default' filepath='nvme.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arb_mechanism' type-id='468f6380' visibility='default' filepath='nvme.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arbitration_burst' type-id='b96825af' visibility='default' filepath='nvme.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='low_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='medium_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='high_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_retry_count' type-id='b96825af' visibility='default' filepath='nvme.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='reserved21' type-id='d3490169' visibility='default' filepath='nvme.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='src_addr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='src_svcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4368'>
        <var-decl name='host_id' type-id='13339fda' visibility='default' filepath='nvme.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4432'>
        <var-decl name='extended_host_id' type-id='fa9986a5' visibility='default' filepath='nvme.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4560'>
        <var-decl name='reserved570' type-id='0f4b9e74' visibility='default' filepath='nvme.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='command_set' type-id='1fb07fa0' visibility='default' filepath='nvme.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='admin_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='header_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4648'>
        <var-decl name='data_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4656'>
        <var-decl name='disable_error_logging' type-id='c894953d' visibility='default' filepath='nvme.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4664'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default' filepath='nvme.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='admin_queue_size' type-id='149c6638' visibility='default' filepath='nvme.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4688'>
        <var-decl name='reserved586' type-id='0f562bd0' visibility='default' filepath='nvme.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='fabrics_connect_timeout_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='disable_read_ana_log_page' type-id='c894953d' visibility='default' filepath='nvme.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='reserved610' type-id='d3538ec5' visibility='default' filepath='nvme.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='disable_read_changed_ns_list_log_page' type-id='b96825af' visibility='default' filepath='nvme.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4936'>
        <var-decl name='reserved617' type-id='d8d29afc' visibility='default' filepath='nvme.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default' filepath='nvme.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='tls_psk' type-id='f004afe8' visibility='default' filepath='nvme.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='dhchap_key' type-id='f004afe8' visibility='default' filepath='nvme.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='dhchap_ctrlr_key' type-id='f004afe8' visibility='default' filepath='nvme.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='dhchap_digests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='dhchap_dhgroups' type-id='8f92235e' visibility='default' filepath='nvme.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_format' is-struct='yes' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='4098' column='1' hash='9808477b9bebdbc7' id='b9f3fc28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lbaf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pil' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='ses' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='lbafu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='4111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_io_qpair_opts' is-struct='yes' visibility='default' size-in-bits='640' filepath='nvme.h' line='1720' column='1' hash='d06f079de849dc6c' id='16b11ada'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qprio' type-id='438eb703' visibility='default' filepath='nvme.h' line='1725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='1730' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='1743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved13' type-id='d3490169' visibility='default' filepath='nvme.h' line='1765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq' type-id='e7f43f83' visibility='default' filepath='nvme.h' line='1788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cq' type-id='e7f43f84' visibility='default' filepath='nvme.h' line='1793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='create_only' type-id='c894953d' visibility='default' filepath='nvme.h' line='1800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='async_mode' type-id='c894953d' visibility='default' filepath='nvme.h' line='1806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='disable_pcie_sgl_merge' type-id='c894953d' visibility='default' filepath='nvme.h' line='1813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='536'>
        <var-decl name='reserved67' type-id='0f4ddd0b' visibility='default' filepath='nvme.h' line='1816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='1824' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvme_spec.h' line='2776' column='1' hash='05ea5e9110495e41' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2784' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f85' visibility='default' filepath='nvme_spec.h' line='2804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2807' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f86' visibility='default' filepath='nvme_spec.h' line='2817' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='2829' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43f88' visibility='default' filepath='nvme_spec.h' line='2847' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='2859' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='2865' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab599' visibility='default' filepath='nvme_spec.h' line='2895' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='2900' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59a' visibility='default' filepath='nvme_spec.h' line='2929' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2932' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2938' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2941' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2947' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2950' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2953' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2956' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2959' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2962' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2965' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default' filepath='nvme_spec.h' line='2979' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='2991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='3000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='3003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default' filepath='nvme_spec.h' line='3017' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default' filepath='nvme_spec.h' line='3019' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' is-struct='yes' visibility='default' size-in-bits='256' filepath='nvme_spec.h' line='1966' column='1' hash='d4b0ba5202a5b2ae' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1967' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1969' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1972' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1976' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1979' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1995' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2001' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2003' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' is-struct='yes' visibility='default' size-in-bits='4512' filepath='nvme.h' line='491' column='1' hash='ed30d5448f2f7c82' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='536' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='723' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='727' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' is-struct='yes' visibility='default' size-in-bits='960' filepath='env.h' line='745' column='1' hash='f69b0a5b42882896' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='746' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='748' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='749' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='1b5ad344' visibility='default' filepath='env.h' line='756' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='50305372' visibility='default' filepath='env.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='e25894ac' visibility='default' filepath='env.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='e25894ac' visibility='default' filepath='env.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='778' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='730' column='1' hash='12edc1ed2493e379' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='734' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='nvme.h' line='1784' column='1' hash='7d56772a5d29fb65#3' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='538b928d' visibility='default' filepath='nvme.h' line='1785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1786' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1787' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='nvme.h' line='1789' column='1' hash='6f0e9b4075e03d19#4' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vaddr' type-id='25e0c706' visibility='default' filepath='nvme.h' line='1790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='paddr' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer_size' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='1792' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='777' column='1' hash='75df1d70e5e3877c#6' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2662' column='1' hash='9767bffa0f8777ea#7' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2663' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2664' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2123' column='1' hash='b17c4aa2d8ef21ad#8' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2537' column='1' hash='0b48f1d97617debb#10' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2538' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2539' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='430' column='1' hash='57b268c386f446fb#17' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bpsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='brs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='abpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='448' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2552' column='1' hash='785236a11693d5b2#20' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2555' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2556' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='129' column='1' hash='e03f6aa13d924c69#25' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2241' column='1' hash='73bab5495637871e#34' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2295' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='63' column='1' hash='90940cd50741059a#41' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='cmbs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='3006' column='1' hash='ad6873c62e1736a6#42' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3008' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3014' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3016' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f93' size-in-bits='2048' hash='198b5a7e4ddaacc3' id='93b898c4'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='b10be967'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__18' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='165' column='1' hash='6f81b8f60dce81bd#63' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='296' column='1' hash='28b4640e01eaa461#66' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='bir' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='pmrtu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='pmrwbm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='pmrto' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='cmss' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='245' column='1' hash='c1b5e2fe431e1bda#73' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='lists' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='wds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='szu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='sz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='210' column='1' hash='5f9ccc305444347b#75' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2576' column='1' hash='789bb739e46bef15#87' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2583' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2584' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2862' column='1' hash='30b4a6364240ed1e#89' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2863' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2864' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2113' column='1' hash='6b85fcea99adfce3#90' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2820' column='1' hash='b8a4691d449aaa0d#91' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2822' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2825' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2810' column='1' hash='58bd387a5fee80fb#92' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2813' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2815' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2816' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2632' column='1' hash='ab73cb5f5cff5e86#93' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2635' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2636' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2609' column='1' hash='05d436016e8653a4#95' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2610' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2611' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2325' column='1' hash='558047c0c94b3f28#96' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2330' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2430' column='1' hash='9d2f75ab41d6cf8b#97' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2445' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2492' column='1' hash='e937dff58185f4fd#98' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2500' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2371' column='1' hash='8d09c5c84ddbd595#99' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2378' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2509' column='1' hash='ffb4a09ce9c4044a#101' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2513' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2897' column='1' hash='3c3312d54c61beb5#102' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2898' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2899' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2869' column='1' hash='70ae345752cf7e77#103' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2874' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2877' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2880' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2883' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2892' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2832' column='1' hash='f978528019698af6#104' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2834' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2837' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2846' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2850' column='1' hash='7c5110f2bc87bbde#105' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2852' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2856' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2858' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2640' column='1' hash='c508a2d20acfeec2#106' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2642' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2643' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2905' column='1' hash='f28912e6d6efcdc7#107' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2915' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2918' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2925' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2927' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2413' column='1' hash='3da67497a3287303#111' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2426' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2391' column='1' hash='b843dcadb9b50e2c#112' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2398' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2455' column='1' hash='4be39c871050f7c9#113' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2459' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2463' column='1' hash='0f2dc76781d19391#114' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2467' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2787' column='1' hash='d40cc61d5f8865a9#115' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2789' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2792' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2795' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2803' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2382' column='1' hash='26d11d28096cad73#116' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2387' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2987' column='1' hash='7e554c90841cac2e#117' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2990' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='45' column='1' id='bb4788fa'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' size-in-bits='8' filepath='types.h' line='37' column='1' hash='3c595c3350588f18' id='2171a512'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' size-in-bits='8' filepath='stdint-intn.h' line='24' column='1' hash='3c595c3350588f18' id='ee31ee44'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_nvme_aer_cb' type-id='cc5bf317' size-in-bits='64' filepath='nvme.h' line='1600' column='1' hash='fd7a63c0c6c822c4' id='8565ca96'/>
    <typedef-decl name='spdk_nvme_authenticate_cb' type-id='82328a76' size-in-bits='64' filepath='nvme.h' line='2210' column='1' hash='fd7a63c0c6c822c4' id='283aeba5'/>
    <typedef-decl name='spdk_nvme_qp_failure_reason' type-id='738b4017' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='424' column='1' hash='143315ec0e0ba58d' id='346f4e4b'/>
    <typedef-decl name='spdk_nvme_remove_cb' type-id='67ce7fb4' size-in-bits='64' filepath='nvme.h' line='896' column='1' hash='fd7a63c0c6c822c4' id='b978a222'/>
    <typedef-decl name='spdk_nvme_timeout_cb' type-id='bf274bcf' size-in-bits='64' filepath='nvme.h' line='1654' column='1' hash='fd7a63c0c6c822c4' id='818cfb43'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='32752' hash='09d75e0f412194cf' id='2ca8d8c8'>
      <subrange length='2047' lower-bound='0' upper-bound='2046' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='4174ca4c481d460d' id='e51ae5ac'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' hash='2acba3b681188244' id='45439f56'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' hash='cedf16acf4bd1010' id='c1c22e6c'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' hash='56b33b5cd7037af7' id='25518ee9'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' hash='1ffdb83e6e1680f3' id='b68a110f'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' hash='00d2c90e49260374' id='1acf0601'>
      <subrange length='119' lower-bound='0' upper-bound='118' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='bfff208dfbbd4720' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' hash='63976325609d9c03' id='ba8c55f2'>
      <subrange length='11' lower-bound='0' upper-bound='10' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7d831a267d1aafe8' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1600' hash='d520f8093bb3fb1a' id='d8d29afc'>
      <subrange length='200' lower-bound='0' upper-bound='199' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='c1708a8d000243c1' id='53119c2f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' hash='0b225993f94fc7d7' id='d8dd2858'>
      <subrange length='204' lower-bound='0' upper-bound='203' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='70023e1b992c93d1' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' hash='2b510ff88d82681e' id='90687fee'>
      <subrange length='242' lower-bound='0' upper-bound='241' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='adc3967ae8d6d19f' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' hash='e6dda4fc6d697382' id='62946659'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' hash='92399eb84731c3e2' id='0f4b9e74'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' hash='4c697ddd27f47a1b' id='74b3417b'>
      <subrange length='3712' lower-bound='0' upper-bound='3711' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eb20c0b5952f62d3' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' hash='87dcd7386226cc55' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='48' hash='b6435304905fc8f6' id='0f562bd0'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='52fa524b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' hash='43eeb328ea84a499' id='be0fa24b'>
      <subrange length='768' lower-bound='0' upper-bound='767' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='ee5e6385becf0897' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' hash='24c833a0e6bde8ce' id='13339fda'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' hash='f457ac50d169e89c' id='cf30f637'>
      <subrange length='9' lower-bound='0' upper-bound='8' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='34fc5cd709b37f15' id='12e4273c'/>
    </array-type-def>
    <union-decl name='spdk_nvme_bpinfo_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='428' column='1' hash='0c2ff12a1c87d73a' id='9e9f6fb8'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='429' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8e' visibility='default' filepath='nvme_spec.h' line='449' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' visibility='default' size-in-bits='64' filepath='nvme_spec.h' line='61' column='1' hash='f830796bf6587b35' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='62' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f92' visibility='default' filepath='nvme_spec.h' line='105' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='127' column='1' hash='5782f75ef646d15e' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='128' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f90' visibility='default' filepath='nvme_spec.h' line='154' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cdata_ctratt' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2239' column='1' hash='4e25609f37a2bf75' id='627055da'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2240' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f91' visibility='default' filepath='nvme_spec.h' line='2296' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmbsz_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='243' column='1' hash='5c696a6e5f7fe997' id='bde1820f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='244' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f96' visibility='default' filepath='nvme_spec.h' line='261' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='163' column='1' hash='eb76e78dba1f81ca' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='164' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f94' visibility='default' filepath='nvme_spec.h' line='182' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_pmrcap_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='294' column='1' hash='533d89b814202a0c' id='e61e4ac5'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='295' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f95' visibility='default' filepath='nvme_spec.h' line='327' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='208' column='1' hash='090ac51562ff1f93' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='209' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f97' visibility='default' filepath='nvme_spec.h' line='217' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme.h' line='1759' column='1' hash='528745ce7e74fd87#3' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='delay_cmd_submit' type-id='c894953d' visibility='default' filepath='nvme.h' line='1760' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delay_pcie_doorbell' type-id='c894953d' visibility='default' filepath='nvme.h' line='1761' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='env.h' line='750' column='1' hash='dc65722026032fd3#4' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='numa_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='751' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='752' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2868' column='1' hash='598112b0049eeada#11' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43f99' visibility='default' filepath='nvme_spec.h' line='2893' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2894' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2535' column='1' hash='9c977e8ef3c46b59#13' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2536' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8d' visibility='default' filepath='nvme_spec.h' line='2540' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2550' column='1' hash='9442f632bc6a6723#19' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2551' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8f' visibility='default' filepath='nvme_spec.h' line='2557' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2507' column='1' hash='23da3d9c43787895#20' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2508' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f98' visibility='default' filepath='nvme_spec.h' line='2514' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2903' column='1' hash='23da3d9c43787895#21' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2904' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9a' visibility='default' filepath='nvme_spec.h' line='2928' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='dca988a5' size-in-bits='64' hash='e8c018048121152c' id='ede1f91d'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='514f4721' const='yes' hash='aa19f10f03299f1e' id='db3704b8'/>
    <pointer-type-def type-id='db3704b8' size-in-bits='64' hash='ec1c9b68750e20ab' id='a99c31d6'/>
    <qualified-type-def type-id='388558d7' const='yes' hash='4bc35c8c472ee7ea' id='86722dee'/>
    <pointer-type-def type-id='86722dee' size-in-bits='64' hash='dd22557c77971408' id='69be0b8c'/>
    <qualified-type-def type-id='16b11ada' const='yes' hash='6be510d7f65da66c' id='50d38b19'/>
    <pointer-type-def type-id='50d38b19' size-in-bits='64' hash='1d43681d589e5b6f' id='70042149'/>
    <qualified-type-def type-id='8712472c' const='yes' hash='6b269f09d40f46e4' id='ee6bba01'/>
    <pointer-type-def type-id='ee6bba01' size-in-bits='64' hash='340da2b1e62d7000' id='7e9611b1'/>
    <pointer-type-def type-id='d8ef6f95' size-in-bits='64' hash='fd7a63c0c6c822c4' id='50305372'/>
    <pointer-type-def type-id='fa9ac61d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='1b5ad344'/>
    <pointer-type-def type-id='e704d407' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e25894ac'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' hash='54c1e9f81ec7a1db' id='78c01427'/>
    <pointer-type-def type-id='67302c12' size-in-bits='64' hash='208620969292ce77' id='bfd3fa20'/>
    <pointer-type-def type-id='72b49d60' size-in-bits='64' hash='a74d6773bb808395' id='25e0c706'/>
    <pointer-type-def type-id='f50aab2b' size-in-bits='64' hash='c4a77807748d5a9c' id='15653b1b'/>
    <pointer-type-def type-id='448e2afd' size-in-bits='64' hash='9b5e3b0397162eab' id='c829039d'/>
    <pointer-type-def type-id='388558d7' size-in-bits='64' hash='bc947bdaed5bdc82' id='f5423aff'/>
    <pointer-type-def type-id='b9f3fc28' size-in-bits='64' hash='000af9d938e6e003' id='80e5734e'/>
    <pointer-type-def type-id='16b11ada' size-in-bits='64' hash='7880efeb59290554' id='44486348'/>
    <pointer-type-def type-id='4e56c4fd' size-in-bits='64' hash='ea3108cabafbe5cb' id='4b4afe0d'/>
    <pointer-type-def type-id='38ef35c9' size-in-bits='64' hash='61bb45b40a372304' id='d18635a1'/>
    <pointer-type-def type-id='8712472c' size-in-bits='64' hash='62df1894fed77635' id='6f56757a'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' hash='4670fa82230db99b' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' hash='8bc7219f41f400e9' id='b4842653'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <pointer-type-def type-id='2131c8e5' size-in-bits='64' hash='fd7a63c0c6c822c4' id='67ce7fb4'/>
    <pointer-type-def type-id='57f1a596' size-in-bits='64' hash='fd7a63c0c6c822c4' id='bf274bcf'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <qualified-type-def type-id='30a17994' const='yes' id='daa760af'/>
    <pointer-type-def type-id='daa760af' size-in-bits='64' id='ba7cf15f'/>
    <pointer-type-def type-id='7528a00e' size-in-bits='64' id='ebba7415'/>
    <pointer-type-def type-id='1bef7040' size-in-bits='64' id='f004afe8'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='30a17994' size-in-bits='64' id='0d7532a3'/>
    <pointer-type-def type-id='2e8e7df0' size-in-bits='64' id='663c4b46'/>
    <pointer-type-def type-id='7718a4aa' size-in-bits='64' id='5ca7f949'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_key' is-struct='yes' visibility='default' is-declaration-only='yes' id='1bef7040'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <function-decl name='spdk_nvme_ctrlr_get_default_ctrlr_opts' mangled-name='spdk_nvme_ctrlr_get_default_ctrlr_opts' filepath='nvme_ctrlr.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_ctrlr_opts' hash='d5b1bf755644300a'>
      <parameter type-id='f5423aff' name='opts' filepath='nvme_ctrlr.c' line='146' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='146' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_opts' mangled-name='spdk_nvme_ctrlr_get_opts' filepath='nvme_ctrlr.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_opts' hash='8b531aaa7bbfefe0'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='228' column='1'/>
      <return type-id='69be0b8c'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_default_io_qpair_opts' mangled-name='spdk_nvme_ctrlr_get_default_io_qpair_opts' filepath='nvme_ctrlr.c' line='278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_default_io_qpair_opts' hash='f50d7552c31cb041'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='278' column='1'/>
      <parameter type-id='44486348' name='opts' filepath='nvme_ctrlr.c' line='279' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='280' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_connect_io_qpair' mangled-name='spdk_nvme_ctrlr_connect_io_qpair' filepath='nvme_ctrlr.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_connect_io_qpair' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='410' column='1'/>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='410' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_disconnect_io_qpair' filepath='nvme_ctrlr.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect_io_qpair' hash='7f32ffea222edbe7'>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='430' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_admin_qp_fd' mangled-name='spdk_nvme_ctrlr_get_admin_qp_fd' filepath='nvme_ctrlr.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_admin_qp_fd' hash='2cc2e75792604f81'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='440' column='1'/>
      <parameter type-id='bfd3fa20' name='opts' filepath='nvme_ctrlr.c' line='441' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_io_qpair' mangled-name='spdk_nvme_ctrlr_alloc_io_qpair' filepath='nvme_ctrlr.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_io_qpair' hash='db60c695a790985f'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='447' column='1'/>
      <parameter type-id='70042149' name='user_opts' filepath='nvme_ctrlr.c' line='448' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='nvme_ctrlr.c' line='449' column='1'/>
      <return type-id='5ca7f949'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_io_qpair' mangled-name='spdk_nvme_ctrlr_reconnect_io_qpair' filepath='nvme_ctrlr.c' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_io_qpair' hash='388da3fa973fde78'>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='590' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' mangled-name='spdk_nvme_ctrlr_get_admin_qp_failure_reason' filepath='nvme_ctrlr.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_admin_qp_failure_reason' hash='3bfd75ea257bf236'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='567' column='1'/>
      <return type-id='346f4e4b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_io_qpair' mangled-name='spdk_nvme_ctrlr_free_io_qpair' filepath='nvme_ctrlr.c' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_io_qpair' hash='388da3fa973fde78'>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='590' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_failed' mangled-name='spdk_nvme_ctrlr_is_failed' filepath='nvme_ctrlr.c' line='1084' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_failed' hash='c7c710e908194b91'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5516' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_fail' mangled-name='spdk_nvme_ctrlr_fail' filepath='nvme_ctrlr.c' line='1122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_fail' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5260' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disconnect' mangled-name='spdk_nvme_ctrlr_disconnect' filepath='nvme_ctrlr.c' line='1766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disconnect' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_async' mangled-name='spdk_nvme_ctrlr_reconnect_async' filepath='nvme_ctrlr.c' line='1778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_async' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5260' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reconnect_poll_async' mangled-name='spdk_nvme_ctrlr_reconnect_poll_async' filepath='nvme_ctrlr.c' line='1822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reconnect_poll_async' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset' mangled-name='spdk_nvme_ctrlr_reset' filepath='nvme_ctrlr.c' line='1940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reset_subsystem' mangled-name='spdk_nvme_ctrlr_reset_subsystem' filepath='nvme_ctrlr.c' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reset_subsystem' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_trid' mangled-name='spdk_nvme_ctrlr_set_trid' filepath='nvme_ctrlr.c' line='2006' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_trid' hash='09c2209575068ab4'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='2006' column='1'/>
      <parameter type-id='6f56757a' name='trid' filepath='nvme_ctrlr.c' line='2006' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_remove_cb' mangled-name='spdk_nvme_ctrlr_set_remove_cb' filepath='nvme_ctrlr.c' line='2035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_remove_cb' hash='5695f5ce05a4c55f'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='2035' column='1'/>
      <parameter type-id='b978a222' name='remove_cb' filepath='nvme_ctrlr.c' line='2036' column='1'/>
      <parameter type-id='eaa32e2f' name='remove_ctx' filepath='nvme_ctrlr.c' line='2036' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_set_keys' mangled-name='spdk_nvme_ctrlr_set_keys' filepath='nvme_ctrlr.c' line='2049' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_set_keys' hash='e2544592d240406b'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='2049' column='1'/>
      <parameter type-id='15653b1b' name='opts' filepath='nvme_ctrlr.c' line='2049' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_nssr_supported' mangled-name='spdk_nvme_ctrlr_is_nssr_supported' filepath='nvme_ctrlr.c' line='4582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_nssr_supported' hash='c7c710e908194b91'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5516' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_process_admin_completions' mangled-name='spdk_nvme_ctrlr_process_admin_completions' filepath='nvme_ctrlr.c' line='4593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_process_admin_completions' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5603' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_data' mangled-name='spdk_nvme_ctrlr_get_data' filepath='nvme_ctrlr.c' line='4640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_data' hash='94a9fde81bfb470d'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4640' column='1'/>
      <return type-id='a99c31d6'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_csts' mangled-name='spdk_nvme_ctrlr_get_regs_csts' filepath='nvme_ctrlr.c' line='4645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_csts' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4645' column='1'/>
      <return type-id='f62d2dc3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cc' mangled-name='spdk_nvme_ctrlr_get_regs_cc' filepath='nvme_ctrlr.c' line='4655' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cc' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4655' column='1'/>
      <return type-id='f0fcbcb4'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cap' mangled-name='spdk_nvme_ctrlr_get_regs_cap' filepath='nvme_ctrlr.c' line='4665' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cap' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4665' column='1'/>
      <return type-id='007005ee'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_vs' mangled-name='spdk_nvme_ctrlr_get_regs_vs' filepath='nvme_ctrlr.c' line='4670' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_vs' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4670' column='1'/>
      <return type-id='900beaa3'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_cmbsz' mangled-name='spdk_nvme_ctrlr_get_regs_cmbsz' filepath='nvme_ctrlr.c' line='4675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_cmbsz' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4675' column='1'/>
      <return type-id='bde1820f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_pmrcap' mangled-name='spdk_nvme_ctrlr_get_regs_pmrcap' filepath='nvme_ctrlr.c' line='4686' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_pmrcap' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4686' column='1'/>
      <return type-id='e61e4ac5'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_regs_bpinfo' mangled-name='spdk_nvme_ctrlr_get_regs_bpinfo' filepath='nvme_ctrlr.c' line='4697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_regs_bpinfo' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4697' column='1'/>
      <return type-id='9e9f6fb8'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pmrsz' mangled-name='spdk_nvme_ctrlr_get_pmrsz' filepath='nvme_ctrlr.c' line='4709' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pmrsz' hash='e0055d99adb0e173'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5591' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_num_ns' mangled-name='spdk_nvme_ctrlr_get_num_ns' filepath='nvme_ctrlr.c' line='4715' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_num_ns' hash='2bb88322482ae81c'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4736' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_active_ns' mangled-name='spdk_nvme_ctrlr_is_active_ns' filepath='nvme_ctrlr.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_active_ns' hash='79745b8d969ff31b'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4721' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4721' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_first_active_ns' mangled-name='spdk_nvme_ctrlr_get_first_active_ns' filepath='nvme_ctrlr.c' line='4736' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_first_active_ns' hash='2bb88322482ae81c'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4736' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_next_active_ns' mangled-name='spdk_nvme_ctrlr_get_next_active_ns' filepath='nvme_ctrlr.c' line='4757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_next_active_ns' hash='0389e499374a3f97'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4757' column='1'/>
      <parameter type-id='8f92235e' name='prev_nsid' filepath='nvme_ctrlr.c' line='4757' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_ns' mangled-name='spdk_nvme_ctrlr_get_ns' filepath='nvme_ctrlr.c' line='4780' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_ns' hash='2bb88322482ae81c'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4780' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4780' column='1'/>
      <return type-id='663c4b46'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_pci_device' mangled-name='spdk_nvme_ctrlr_get_pci_device' filepath='nvme_ctrlr.c' line='4813' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_pci_device' hash='c152b797b087b0d8'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4813' column='1'/>
      <return type-id='efc5406b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_numa_id' mangled-name='spdk_nvme_ctrlr_get_numa_id' filepath='nvme_ctrlr.c' line='4827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_numa_id' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5603' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_id' mangled-name='spdk_nvme_ctrlr_get_id' filepath='nvme_ctrlr.c' line='4837' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_id' hash='a123d258525fc45e'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4837' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_max_xfer_size' mangled-name='spdk_nvme_ctrlr_get_max_xfer_size' filepath='nvme_ctrlr.c' line='4843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_max_xfer_size' hash='2bb88322482ae81c'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='4843' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_max_sges' mangled-name='spdk_nvme_ctrlr_get_max_sges' filepath='nvme_ctrlr.c' line='4849' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_max_sges' hash='a123d258525fc45e'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='4849' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_aer_callback' mangled-name='spdk_nvme_ctrlr_register_aer_callback' filepath='nvme_ctrlr.c' line='4859' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_aer_callback' hash='5695f5ce05a4c55f'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4859' column='1'/>
      <parameter type-id='8565ca96' name='aer_cb_fn' filepath='nvme_ctrlr.c' line='4860' column='1'/>
      <parameter type-id='eaa32e2f' name='aer_cb_arg' filepath='nvme_ctrlr.c' line='4861' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' mangled-name='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' filepath='nvme_ctrlr.c' line='4877' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_read_changed_ns_list_log_page' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5260' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_register_timeout_callback' mangled-name='spdk_nvme_ctrlr_register_timeout_callback' filepath='nvme_ctrlr.c' line='4883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_register_timeout_callback' hash='3aa907ea60dd12ba'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4883' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_io_us' filepath='nvme_ctrlr.c' line='4884' column='1'/>
      <parameter type-id='9c313c2d' name='timeout_admin_us' filepath='nvme_ctrlr.c' line='4884' column='1'/>
      <parameter type-id='818cfb43' name='cb_fn' filepath='nvme_ctrlr.c' line='4885' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr.c' line='4885' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_log_page_supported' mangled-name='spdk_nvme_ctrlr_is_log_page_supported' filepath='nvme_ctrlr.c' line='4905' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_log_page_supported' hash='d5e141ff0e52545d'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4913' column='1'/>
      <parameter type-id='b96825af' name='feature_code' filepath='nvme_ctrlr.c' line='4913' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_feature_supported' mangled-name='spdk_nvme_ctrlr_is_feature_supported' filepath='nvme_ctrlr.c' line='4913' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_feature_supported' hash='d5e141ff0e52545d'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4913' column='1'/>
      <parameter type-id='b96825af' name='feature_code' filepath='nvme_ctrlr.c' line='4913' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_attach_ns' mangled-name='spdk_nvme_ctrlr_attach_ns' filepath='nvme_ctrlr.c' line='4921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_attach_ns' hash='56a63776cd492f08'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4971' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4971' column='1'/>
      <parameter type-id='c829039d' name='payload' filepath='nvme_ctrlr.c' line='4972' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_detach_ns' mangled-name='spdk_nvme_ctrlr_detach_ns' filepath='nvme_ctrlr.c' line='4971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_detach_ns' hash='56a63776cd492f08'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4971' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='4971' column='1'/>
      <parameter type-id='c829039d' name='payload' filepath='nvme_ctrlr.c' line='4972' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_create_ns' mangled-name='spdk_nvme_ctrlr_create_ns' filepath='nvme_ctrlr.c' line='5009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_create_ns' hash='e4d92b4b45f935f9'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5009' column='1'/>
      <parameter type-id='4b4afe0d' name='payload' filepath='nvme_ctrlr.c' line='5009' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_delete_ns' mangled-name='spdk_nvme_ctrlr_delete_ns' filepath='nvme_ctrlr.c' line='5046' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_delete_ns' hash='6668baab5275d4c5'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5046' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='5046' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_format' mangled-name='spdk_nvme_ctrlr_format' filepath='nvme_ctrlr.c' line='5082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_format' hash='5f07b1f746584c77'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5082' column='1'/>
      <parameter type-id='8f92235e' name='nsid' filepath='nvme_ctrlr.c' line='5082' column='1'/>
      <parameter type-id='80e5734e' name='format' filepath='nvme_ctrlr.c' line='5083' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_update_firmware' mangled-name='spdk_nvme_ctrlr_update_firmware' filepath='nvme_ctrlr.c' line='5116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_update_firmware' hash='f457f8cf6c4c3048'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5116' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5116' column='1'/>
      <parameter type-id='8f92235e' name='size' filepath='nvme_ctrlr.c' line='5116' column='1'/>
      <parameter type-id='95e97e5e' name='slot' filepath='nvme_ctrlr.c' line='5117' column='1'/>
      <parameter type-id='0009b8fa' name='commit_action' filepath='nvme_ctrlr.c' line='5117' column='1'/>
      <parameter type-id='d18635a1' name='completion_status' filepath='nvme_ctrlr.c' line='5117' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_reserve_cmb' mangled-name='spdk_nvme_ctrlr_reserve_cmb' filepath='nvme_ctrlr.c' line='5223' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_reserve_cmb' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_cmb' mangled-name='spdk_nvme_ctrlr_map_cmb' filepath='nvme_ctrlr.c' line='5248' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_cmb' hash='dd52aedfbd7a23ba'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_cmb' mangled-name='spdk_nvme_ctrlr_unmap_cmb' filepath='nvme_ctrlr.c' line='5260' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_cmb' hash='7f32ffea222edbe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5260' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_enable_pmr' mangled-name='spdk_nvme_ctrlr_enable_pmr' filepath='nvme_ctrlr.c' line='5268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_enable_pmr' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_disable_pmr' mangled-name='spdk_nvme_ctrlr_disable_pmr' filepath='nvme_ctrlr.c' line='5280' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_disable_pmr' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_map_pmr' mangled-name='spdk_nvme_ctrlr_map_pmr' filepath='nvme_ctrlr.c' line='5292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_map_pmr' hash='dd52aedfbd7a23ba'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_unmap_pmr' mangled-name='spdk_nvme_ctrlr_unmap_pmr' filepath='nvme_ctrlr.c' line='5304' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_unmap_pmr' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_start' mangled-name='spdk_nvme_ctrlr_read_boot_partition_start' filepath='nvme_ctrlr.c' line='5316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_start' hash='9b5e3cc521d97890'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5316' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5316' column='1'/>
      <parameter type-id='8f92235e' name='bprsz' filepath='nvme_ctrlr.c' line='5317' column='1'/>
      <parameter type-id='8f92235e' name='bprof' filepath='nvme_ctrlr.c' line='5317' column='1'/>
      <parameter type-id='8f92235e' name='bpid' filepath='nvme_ctrlr.c' line='5317' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_read_boot_partition_poll' mangled-name='spdk_nvme_ctrlr_read_boot_partition_poll' filepath='nvme_ctrlr.c' line='5374' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_read_boot_partition_poll' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a2' name='ctrlr' filepath='nvme.c' line='108' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_write_boot_partition' mangled-name='spdk_nvme_ctrlr_write_boot_partition' filepath='nvme_ctrlr.c' line='5481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_write_boot_partition' hash='fc5663b0df16d09d'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5481' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5482' column='1'/>
      <parameter type-id='8f92235e' name='size' filepath='nvme_ctrlr.c' line='5482' column='1'/>
      <parameter type-id='8f92235e' name='bpid' filepath='nvme_ctrlr.c' line='5482' column='1'/>
      <parameter type-id='766930c6' name='cb_fn' filepath='nvme_ctrlr.c' line='5483' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='nvme_ctrlr.c' line='5483' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_discovery' mangled-name='spdk_nvme_ctrlr_is_discovery' filepath='nvme_ctrlr.c' line='5507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_discovery' hash='c7c710e908194b91'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5516' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_is_fabrics' mangled-name='spdk_nvme_ctrlr_is_fabrics' filepath='nvme_ctrlr.c' line='5516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_is_fabrics' hash='c7c710e908194b91'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5516' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_receive' mangled-name='spdk_nvme_ctrlr_security_receive' filepath='nvme_ctrlr.c' line='5524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_receive' hash='cf62e500fba69dec'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5557' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr.c' line='5557' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_security_send' mangled-name='spdk_nvme_ctrlr_security_send' filepath='nvme_ctrlr.c' line='5557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_security_send' hash='cf62e500fba69dec'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5557' column='1'/>
      <parameter type-id='b96825af' name='secp' filepath='nvme_ctrlr.c' line='5557' column='1'/>
      <parameter type-id='149c6638' name='spsp' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='b96825af' name='nssf' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='nvme_ctrlr.c' line='5558' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_flags' mangled-name='spdk_nvme_ctrlr_get_flags' filepath='nvme_ctrlr.c' line='5591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_flags' hash='e0055d99adb0e173'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5591' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_transport_id' mangled-name='spdk_nvme_ctrlr_get_transport_id' filepath='nvme_ctrlr.c' line='5597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_transport_id' hash='a7650a2733365fe7'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5597' column='1'/>
      <return type-id='7e9611b1'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_alloc_qid' mangled-name='spdk_nvme_ctrlr_alloc_qid' filepath='nvme_ctrlr.c' line='5603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_alloc_qid' hash='388da3fa973fde78'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5603' column='1'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_free_qid' mangled-name='spdk_nvme_ctrlr_free_qid' filepath='nvme_ctrlr.c' line='5622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_free_qid' hash='a123d258525fc45e'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5622' column='1'/>
      <parameter type-id='149c6638' name='qid' filepath='nvme_ctrlr.c' line='5622' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_get_memory_domains' mangled-name='spdk_nvme_ctrlr_get_memory_domains' filepath='nvme_ctrlr.c' line='5636' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_get_memory_domains' hash='d628501fd2223339'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='5636' column='1'/>
      <parameter type-id='1fc0b044' name='domains' filepath='nvme_ctrlr.c' line='5637' column='1'/>
      <parameter type-id='95e97e5e' name='array_size' filepath='nvme_ctrlr.c' line='5637' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvme_ctrlr_authenticate' mangled-name='spdk_nvme_ctrlr_authenticate' filepath='nvme_ctrlr.c' line='5643' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvme_ctrlr_authenticate' hash='a7f99494147764a8'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5643' column='1'/>
      <parameter type-id='283aeba5' name='cb_fn' filepath='nvme_ctrlr.c' line='5644' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='nvme_ctrlr.c' line='5644' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_nvme_ns' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='nvme_internal.h' line='566' column='1' id='2e8e7df0'/>
    <class-decl name='nvme_driver' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='nvme_internal.h' line='1218' column='1' id='7528a00e'/>
    <function-type size-in-bits='64' hash='35f9072fdd1fcb6c' id='d8ef6f95'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='05b34402ba93ca54' id='fa9ac61d'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='62d730029a69659a' id='e704d407'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='a123d258525fc45e' id='57f1a596'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='0d7532a3'/>
      <parameter type-id='5ca7f949'/>
      <parameter type-id='149c6638'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='d628501fd2223339' id='a1468699'>
      <parameter type-id='ba7cf15f' name='ctrlr' filepath='nvme_ctrlr.c' line='5636' column='1'/>
      <parameter type-id='1fc0b044' name='domains' filepath='nvme_ctrlr.c' line='5637' column='1'/>
      <parameter type-id='95e97e5e' name='array_size' filepath='nvme_ctrlr.c' line='5637' column='1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='c476bfbf'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='410' column='1'/>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='410' column='1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='e198cfc2'>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='590' column='1'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='a123d258525fc45e' id='dcba7d19'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4837' column='1'/>
      <return type-id='149c6638'/>
    </function-type>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='934d7c13'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='4736' column='1'/>
      <return type-id='8f92235e'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='29ea6f2d'>
      <parameter type-id='5ca7f949' name='qpair' filepath='nvme_ctrlr.c' line='430' column='1'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='be23e0895f2a8211' id='4d39c5a2'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='51104a73'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='dd52aedfbd7a23ba' id='55dbe107'>
      <parameter type-id='0d7532a3' name='ctrlr' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='nvme_ctrlr.c' line='5292' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='nvme_ctrlr_cmd.c' language='LANG_C11'>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='spdk_nvme_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvme_spec.h' line='1380' column='1' hash='5391b474785ed5b0' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab59c' visibility='default' filepath='nvme_spec.h' line='1406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab59e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab59f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvme_spec.h' line='1447' column='1' hash='94b2f9e83d5892a3' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvme_spec.h' line='614' column='1' hash='215b19d231463b5a' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='1434' column='1' hash='fc053e45d751913c' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1440' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='884' column='1' hash='c003390e9270da18#5' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='893' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='699' column='1' hash='548fe5eb1a049464#12' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='712' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1092' column='1' hash='8feb1434fa7a9734#19' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1097' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='856' column='1' hash='ad5db448c44eb1fb#21' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='860' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1249' column='1' hash='8199c8f4e6f677b2#22' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1370' column='1' hash='db2edd28cd5ec2c2#23' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dsm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1375' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1265' column='1' hash='fe2509516d8ecd30#24' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1038' column='1' hash='3756f1ce18a8e2bd#27' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1041' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='992' column='1' hash='725513e69f184d20#29' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='996' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1051' column='1' hash='fb350fe9dce3eee7#30' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1057' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1082' column='1' hash='d7b5e6e248de3766#31' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1085' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1150' column='1' hash='239cebb925f40526#32' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1142' column='1' hash='7806a3c015202516#33' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1289' column='1' hash='66b466dc71d4538d#35' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='838' column='1' hash='ad35623b1f5cc13e#36' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='935' column='1' hash='ee77dca2c333c6ec#37' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='937' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='623' column='1' hash='a45795c19710272d#38' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1100' column='1' hash='279ac4d514f56a2a#39' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1208' column='1' hash='0af01c7b07646770#40' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1304' column='1' hash='95c154f9396afd9b#43' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1344' column='1' hash='6a6667d200647dbf#44' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='deac' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1323' column='1' hash='2eb288a02832e7b3#45' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1170' column='1' hash='9b10d28a122b47b8#46' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='806' column='1' hash='e79721de7c7902a8#47' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1118' column='1' hash='69d726b7e707ff5c#48' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='741' column='1' hash='6ca700154011a93f#49' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='745' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1258' column='1' hash='8fa8dd0dd6da05dd#51' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1221' column='1' hash='79f4ba2c78b21195#52' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1239' column='1' hash='060e7c2365604933#53' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1246' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1229' column='1' hash='30839990af78bd5b#54' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1067' column='1' hash='7c6ba9817ee43b85#55' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='724' column='1' hash='44d52284d00b720c#58' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1025' column='1' hash='472e59b041146dba#59' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1028' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1129' column='1' hash='1f720e9494b326d7#60' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1136' column='1' hash='c6400045f70b8a0d#61' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1197' column='1' hash='a554a88dd14d33a5#62' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1006' column='1' hash='cfd0a567e075c925#67' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1014' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1176' column='1' hash='8647d62f3d0684a1#68' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1186' column='1' hash='b355179652e4699e#69' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1158' column='1' hash='fc2ac53ee69a6ce7#70' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1111' column='1' hash='6c4054f7320227d6#72' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='821' column='1' hash='992874cbdd060d67#76' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='775' column='1' hash='c497d77219075caf#77' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='755' column='1' hash='e261fc93549fb3a4#78' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='792' column='1' hash='aac10391fdd2048d#79' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='630' column='1' hash='6c41b1621790411f#81' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='634' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1400' column='1' hash='ba6fe5fc0b0982e5#82' id='e7f43fc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='868' column='1' hash='6a6041472ff1c837#88' id='e7f43fca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='874' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='617' column='1' hash='0ca125c4c4058b5d#108' id='e7f43fcb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pid_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='154' column='1' hash='09d17c08f594edc7' id='3629bad8'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='pid_t' type-id='3629bad8' size-in-bits='32' filepath='types.h' line='97' column='1' hash='09d17c08f594edc7' id='587f89d2'/>
    <typedef-decl name='spdk_nvme_cmd_cb' type-id='cc5bf317' size-in-bits='64' filepath='nvme.h' line='1590' column='1' hash='fd7a63c0c6c822c4' id='766930c6'/>
    <typedef-decl name='spdk_nvme_req_next_sge_cb' type-id='3e624ae6' size-in-bits='64' filepath='nvme.h' line='2097' column='1' hash='fd7a63c0c6c822c4' id='218012e4'/>
    <typedef-decl name='spdk_nvme_req_reset_sgl_cb' type-id='c6dc7e1f' size-in-bits='64' filepath='nvme.h' line='2084' column='1' hash='fd7a63c0c6c822c4' id='48c98c81'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <union-decl name='spdk_nvme_cmd_cdw10' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1090' column='1' hash='f729993487cda28e' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fac' visibility='default' filepath='nvme_spec.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fc3' visibility='default' filepath='nvme_spec.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43fb3' visibility='default' filepath='nvme_spec.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fbc' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fbd' visibility='default' filepath='nvme_spec.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fc2' visibility='default' filepath='nvme_spec.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fc2' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fc0' visibility='default' filepath='nvme_spec.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fc1' visibility='default' filepath='nvme_spec.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fbe' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fad' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1218' column='1' hash='c6f24a4417ec38ae' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fb6' visibility='default' filepath='nvme_spec.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fb8' visibility='default' filepath='nvme_spec.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fb7' visibility='default' filepath='nvme_spec.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43f9f' visibility='default' filepath='nvme_spec.h' line='1256' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fb5' visibility='default' filepath='nvme_spec.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1283' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1284' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1285' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default' filepath='nvme_spec.h' line='1287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1301' column='1' hash='409f50359a910183' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fae' visibility='default' filepath='nvme_spec.h' line='1321' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fb0' visibility='default' filepath='nvme_spec.h' line='1342' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write_zeroes' type-id='e7f43faf' visibility='default' filepath='nvme_spec.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default' filepath='nvme_spec.h' line='1362' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default' filepath='nvme_spec.h' line='1363' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw13' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1367' column='1' hash='07c32d403035ba47' id='9683a609'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1368' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fa0' visibility='default' filepath='nvme_spec.h' line='1376' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' visibility='default' size-in-bits='8' filepath='nvme_spec.h' line='865' column='1' hash='b194772d5bf0827f' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fca' visibility='default' filepath='nvme_spec.h' line='875' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='697' column='1' hash='44475d80415793ca' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9c' visibility='default' filepath='nvme_spec.h' line='713' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='882' column='1' hash='b02e6967552029f4' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9b' visibility='default' filepath='nvme_spec.h' line='894' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='773' column='1' hash='f0de7008476a1512' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='774' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc5' visibility='default' filepath='nvme_spec.h' line='783' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1036' column='1' hash='c76756b07e5ea163' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='1042' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1049' column='1' hash='42632b5a443edf37' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='1058' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1065' column='1' hash='a6348cbe8cd5c862' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb9' visibility='default' filepath='nvme_spec.h' line='1073' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1080' column='1' hash='d0d5826be39cc841' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='990' column='1' hash='418fe3865b0daf94' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='997' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='819' column='1' hash='e2d9e57a46b61039' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='820' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc4' visibility='default' filepath='nvme_spec.h' line='829' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='836' column='1' hash='73897c16e3d2eec5' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='846' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='933' column='1' hash='426ac8873573abb9' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='934' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='938' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='739' column='1' hash='ccac3eb052b5bf75' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb4' visibility='default' filepath='nvme_spec.h' line='746' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='804' column='1' hash='21b1a862c233b552' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='805' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb2' visibility='default' filepath='nvme_spec.h' line='812' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='722' column='1' hash='91f449230aa78a07' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='723' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fba' visibility='default' filepath='nvme_spec.h' line='732' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1004' column='1' hash='e7d28a5a2732c962' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbf' visibility='default' filepath='nvme_spec.h' line='1015' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1023' column='1' hash='f8eb99c82fc1cc49' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fbb' visibility='default' filepath='nvme_spec.h' line='1029' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='753' column='1' hash='e07ef12254b4bb9e' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='754' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc6' visibility='default' filepath='nvme_spec.h' line='766' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='790' column='1' hash='cb8fe3c5aab3fa2d' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc7' visibility='default' filepath='nvme_spec.h' line='797' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='854' column='1' hash='fa2b0cbfb10fd99e' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9e' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1399' column='1' hash='816ecb30b0290a0d#9' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fc9' visibility='default' filepath='nvme_spec.h' line='1403' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1405' column='1'/>
      </data-member>
    </union-decl>
