<abi-corpus version='2.4' soname='libspdk_log.so.8.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_deprecation_get_description' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_hits' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_remove_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_deprecation_get_tag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_flog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_clear_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_deprecated' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_log_to_syslog_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_usage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vflog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vlog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__ctype_b_loc' version='GLIBC_2.3' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__stack_chk_fail' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='clock_gettime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='closelog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='fflush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='fnmatch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='fprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='fputs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='fwrite' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='localtime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='openlog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcasecmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='syslog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vasprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vsnprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='log.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' size-in-bits='32' alignment-in-bits='32' filepath='log.h' line='90' column='1' hash='f54503d906878e62' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='ede1f91d' visibility='default' filepath='struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='8910171f' visibility='default' filepath='struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='8e100159' visibility='default' filepath='struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_log_opts' is-struct='yes' visibility='default' size-in-bits='320' filepath='log.h' line='50' column='1' hash='dd3b7a299d8a9407' id='05b8af75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='log.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='log' type-id='d9d8b578' visibility='default' filepath='log.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='open' type-id='a73d192d' visibility='default' filepath='log.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close' type-id='80506f5f' visibility='default' filepath='log.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='log.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='45' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_log_cb' type-id='bba1f737' size-in-bits='64' filepath='log.h' line='33' column='1' id='8adc526d'/>
    <typedef-decl name='spdk_log_close_cb' type-id='c5c76c9c' size-in-bits='64' filepath='log.h' line='48' column='1' id='eefd4908'/>
    <typedef-decl name='spdk_log_open_cb' type-id='c5c76c9c' size-in-bits='64' filepath='log.h' line='41' column='1' id='735f2a34'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='dca988a5' size-in-bits='64' hash='e8c018048121152c' id='ede1f91d'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' hash='39fc40d7ba4ca689' id='b7f2d5e6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='95e97e5e' const='yes' hash='8cef8df4b6728924' id='2448a865'/>
    <pointer-type-def type-id='8adc526d' size-in-bits='64' hash='f9bfb9ebf7814693' id='d9d8b578'/>
    <pointer-type-def type-id='eefd4908' size-in-bits='64' hash='e02963238390310c' id='80506f5f'/>
    <pointer-type-def type-id='735f2a34' size-in-bits='64' hash='33fda192ec1854fd' id='a73d192d'/>
    <pointer-type-def type-id='05b8af75' size-in-bits='64' hash='c76dd87ab6dcc1e6' id='346222b5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_log_set_level' mangled-name='spdk_log_set_level' filepath='log.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_level' hash='7752fe97b393f20c'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='46' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_level' mangled-name='spdk_log_get_level' filepath='log.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_level' hash='7752fe97b393f20c'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_set_print_level' mangled-name='spdk_log_set_print_level' filepath='log.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_print_level' hash='7752fe97b393f20c'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='46' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_print_level' mangled-name='spdk_log_get_print_level' filepath='log.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_print_level' hash='7752fe97b393f20c'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_open' mangled-name='spdk_log_open' filepath='log.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_open' hash='314d7ab011eef34e'>
      <parameter type-id='d9d8b578' name='log' filepath='log.c' line='71' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_open_ext' mangled-name='spdk_log_open_ext' filepath='log.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_open_ext' hash='2bb8a1b5639cc0d4'>
      <parameter type-id='346222b5' name='opts' filepath='log.c' line='83' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_close' mangled-name='spdk_log_close' filepath='log.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_close' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_enable_timestamps' mangled-name='spdk_log_enable_timestamps' filepath='log.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_enable_timestamps' hash='c7c710e908194b91'>
      <parameter type-id='c894953d' name='value' filepath='log.c' line='112' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log' mangled-name='spdk_log' filepath='log.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log' hash='408d5f61f86c386e'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='143' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='143' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='143' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='143' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='144' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_to_syslog_level' mangled-name='spdk_log_to_syslog_level' filepath='log.c' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_to_syslog_level' hash='d8805999bdf5dd04'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='154' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vlog' mangled-name='spdk_vlog' filepath='log.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vlog' hash='6963e09b162b97db'>
      <parameter type-id='4271cbce' name='level' filepath='log.c' line='176' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='176' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='176' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='176' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='177' column='1'/>
      <parameter type-id='b7f2d5e6' name='ap' filepath='log.c' line='177' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vflog' mangled-name='spdk_vflog' filepath='log.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vflog' hash='637c3c8015edcf4d'>
      <parameter type-id='822cd80b' name='fp' filepath='log.c' line='237' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='237' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='237' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='237' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='238' column='1'/>
      <parameter type-id='b7f2d5e6' name='ap' filepath='log.c' line='238' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_flog' mangled-name='spdk_flog' filepath='log.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_flog' hash='6bfcdf7caa2a2936'>
      <parameter type-id='822cd80b' name='fp' filepath='log.c' line='257' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log.c' line='257' column='1'/>
      <parameter type-id='2448a865' name='line' filepath='log.c' line='257' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log.c' line='257' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='log.c' line='258' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_dump' mangled-name='spdk_log_dump' filepath='log.c' line='313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_dump' hash='31bf867ad770dbfb'>
      <parameter type-id='822cd80b' name='fp' filepath='log.c' line='313' column='1'/>
      <parameter type-id='80f4b756' name='label' filepath='log.c' line='313' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='log.c' line='313' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='log.c' line='313' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='28648b863d4bd105' id='bba1f737'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2448a865'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='log_deprecated.c' language='LANG_C11'>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='spdk_log_for_each_deprecation_fn' type-id='ccbd1bed' size-in-bits='64' filepath='log.h' line='391' column='1' hash='fd7a63c0c6c822c4' id='2a1ead45'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <pointer-type-def type-id='ddc88dac' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ccbd1bed'/>
    <qualified-type-def type-id='9eea344e' const='yes' id='43598b17'/>
    <pointer-type-def type-id='43598b17' size-in-bits='64' id='42f63107'/>
    <pointer-type-def type-id='9eea344e' size-in-bits='64' id='e1c4d514'/>
    <pointer-type-def type-id='e1c4d514' size-in-bits='64' id='a6dbb09a'/>
    <class-decl name='spdk_deprecation' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='log_deprecated.c' line='11' column='1' id='9eea344e'/>
    <function-decl name='spdk_log_deprecation_register' mangled-name='spdk_log_deprecation_register' filepath='log_deprecated.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_deprecation_register' hash='7e91961bdb7b0ad3'>
      <parameter type-id='80f4b756' name='tag' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='80f4b756' name='description' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='80f4b756' name='remove_release' filepath='log_deprecated.c' line='46' column='1'/>
      <parameter type-id='8f92235e' name='rate_limit_seconds' filepath='log_deprecated.c' line='47' column='1'/>
      <parameter type-id='a6dbb09a' name='depp' filepath='log_deprecated.c' line='47' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_deprecated' mangled-name='spdk_log_deprecated' filepath='log_deprecated.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_deprecated' hash='17da239d6ad9fdba'>
      <parameter type-id='e1c4d514' name='dep' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='80f4b756' name='file' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='8f92235e' name='line' filepath='log_deprecated.c' line='77' column='1'/>
      <parameter type-id='80f4b756' name='func' filepath='log_deprecated.c' line='77' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_for_each_deprecation' mangled-name='spdk_log_for_each_deprecation' filepath='log_deprecated.c' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_for_each_deprecation' hash='a7f99494147764a8'>
      <parameter type-id='eaa32e2f' name='ctx' filepath='log_deprecated.c' line='107' column='1'/>
      <parameter type-id='2a1ead45' name='fn' filepath='log_deprecated.c' line='107' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_tag' mangled-name='spdk_deprecation_get_tag' filepath='log_deprecated.c' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_tag' hash='53885bde0aa65efe'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='135' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_description' mangled-name='spdk_deprecation_get_description' filepath='log_deprecated.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_description' hash='53885bde0aa65efe'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='135' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_remove_release' mangled-name='spdk_deprecation_get_remove_release' filepath='log_deprecated.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_remove_release' hash='53885bde0aa65efe'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='135' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_deprecation_get_hits' mangled-name='spdk_deprecation_get_hits' filepath='log_deprecated.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_deprecation_get_hits' hash='e0055d99adb0e173'>
      <parameter type-id='42f63107' name='deprecation' filepath='log_deprecated.c' line='141' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='ddc88dac'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='e1c4d514'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='log_flags.c' language='LANG_C11'>
    <class-decl name='spdk_log_flag' is-struct='yes' visibility='default' size-in-bits='256' filepath='log.h' line='266' column='1' hash='05e123fbc3d28b29' id='c29bb739'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='log.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='log.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enabled' type-id='c894953d' visibility='default' filepath='log.h' line='269' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='log.h' line='267' column='1' hash='21776d34837997f2' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ce203111' visibility='default' filepath='log.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b7ad7fe1' visibility='default' filepath='log.h' line='267' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c29bb739' size-in-bits='64' hash='d3565c17052f3a48' id='ce203111'/>
    <pointer-type-def type-id='ce203111' size-in-bits='64' hash='7df62e13fe823c29' id='b7ad7fe1'/>
    <function-decl name='spdk_log_register_flag' mangled-name='spdk_log_register_flag' filepath='log_flags.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_register_flag' hash='9eab6116cfdcb643'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='28' column='1'/>
      <parameter type-id='ce203111' name='flag' filepath='log_flags.c' line='28' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_flag' mangled-name='spdk_log_get_flag' filepath='log_flags.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_flag' hash='19a1d02fa5635f5c'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='55' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_log_set_flag' mangled-name='spdk_log_set_flag' filepath='log_flags.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_flag' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='96' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_clear_flag' mangled-name='spdk_log_clear_flag' filepath='log_flags.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_clear_flag' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='name' filepath='log_flags.c' line='96' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_get_first_flag' mangled-name='spdk_log_get_first_flag' filepath='log_flags.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_first_flag' hash='84cea45398a7a5df'>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_get_next_flag' mangled-name='spdk_log_get_next_flag' filepath='log_flags.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_next_flag' hash='28d9086a9636e7f4'>
      <parameter type-id='ce203111' name='flag' filepath='log_flags.c' line='108' column='1'/>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_usage' mangled-name='spdk_log_usage' filepath='log_flags.c' line='114' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_usage' hash='800cce20e5719a2b'>
      <parameter type-id='822cd80b' name='f' filepath='log_flags.c' line='114' column='1'/>
      <parameter type-id='80f4b756' name='log_arg' filepath='log_flags.c' line='114' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
