<abi-corpus version='2.4' soname='libspdk_blob_bdev.so.13.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_thread.so.12.0'/>
    <dependency name='libspdk_bdev.so.18.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_create_bs_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_create_bs_dev_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_update_bs_blockcnt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_bdev_claim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='memset' version='GLIBC_2.2.5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_copy_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_desc_get_bdev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_free_io' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_get_block_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_get_num_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_get_physical_block_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_io_type_supported' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_module_claim_bdev_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_open_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_queue_io_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_read_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_readv_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_readv_blocks_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_unmap_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_write_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_write_zeroes_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_writev_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bdev_writev_blocks_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_put_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='blob_bdev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <enum-decl name='spdk_bdev_event_type' size-in-bits='32' alignment-in-bits='32' filepath='bdev.h' line='41' column='1' hash='5ba52e2bfb7395aa' id='3add6f5a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_EVENT_REMOVE' value='0'/>
      <enumerator name='SPDK_BDEV_EVENT_RESIZE' value='1'/>
      <enumerator name='SPDK_BDEV_EVENT_MEDIA_MANAGEMENT' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='__bdev_module_internal_fields' is-struct='yes' visibility='default' size-in-bits='576' filepath='bdev_module.h' line='149' column='1' hash='63f5be309d0e77f9' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='quiesced_ranges' type-id='e7f43f72' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_bs_dev_opts' is-struct='yes' visibility='default' size-in-bits='64' filepath='blob_bdev.h' line='25' column='1' hash='838d0c35ef2c3342' id='03105d44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob_bdev.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module' is-struct='yes' visibility='default' size-in-bits='1216' filepath='bdev_module.h' line='40' column='1' hash='115c5ab91ffe4c71' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='65e3965a' visibility='default' filepath='bdev_module.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='c640490b' visibility='default' filepath='bdev_module.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='494cdc6d' visibility='default' filepath='bdev_module.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='bdev_module.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='65e3965a' visibility='default' filepath='bdev_module.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='82f59c11' visibility='default' filepath='bdev_module.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='82f59c11' visibility='default' filepath='bdev_module.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default' filepath='bdev_module.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='blob.h' line='171' column='1' hash='d17a330c630e0141' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' is-struct='yes' visibility='default' size-in-bits='1280' filepath='blob.h' line='183' column='1' hash='bc194d0c09e1edaf' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='ebc27c62' visibility='default' filepath='blob.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='0c87adc6' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='7a375257' visibility='default' filepath='blob.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='ec0088fb' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='ec0088fb' visibility='default' filepath='blob.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='9a3d0978' visibility='default' filepath='blob.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='9a3d0978' visibility='default' filepath='blob.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='23168c30' visibility='default' filepath='blob.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='311fca94' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='311fca94' visibility='default' filepath='blob.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4a9ec7e9' visibility='default' filepath='blob.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='afcde08d' visibility='default' filepath='blob.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='is_range_valid' type-id='afcde08d' visibility='default' filepath='blob.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='translate_lba' type-id='05114f47' visibility='default' filepath='blob.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy' type-id='9a6dafa7' visibility='default' filepath='blob.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_degraded' type-id='088f71e9' visibility='default' filepath='blob.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='263' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' is-struct='yes' visibility='default' size-in-bits='192' filepath='blob.h' line='161' column='1' hash='66b11ce90ae11b3c' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' is-struct='yes' visibility='default' size-in-bits='256' filepath='thread.h' line='1041' column='1' hash='f3654a830a369375' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='1042' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='1043' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='1044' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='1046' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='167' column='1' hash='88a04d14b93cac82' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default' filepath='bdev_module.h' line='167' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev_module.h' line='169' column='1' hash='1465e55946c9c912#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eec' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' size-in-bits='32' filepath='pthreadtypes.h' line='103' column='1' hash='ae69415523d5e788' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eec' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_event_cb_t' type-id='78d860eb' size-in-bits='64' filepath='bdev.h' line='74' column='1' hash='fd7a63c0c6c822c4' id='3de10a34'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='03ca1b4b' size-in-bits='64' filepath='blob.h' line='118' column='1' hash='fd7a63c0c6c822c4' id='7683f572'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eec'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='088f71e9'/>
    <pointer-type-def type-id='793673b2' size-in-bits='64' hash='fd7a63c0c6c822c4' id='afcde08d'/>
    <pointer-type-def type-id='73b5cb02' size-in-bits='64' hash='fd7a63c0c6c822c4' id='05114f47'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='ad11f404' size-in-bits='64' hash='fd7a63c0c6c822c4' id='494cdc6d'/>
    <pointer-type-def type-id='b39d85cf' size-in-bits='64' hash='fd7a63c0c6c822c4' id='65e3965a'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4a9ec7e9'/>
    <pointer-type-def type-id='03105d44' size-in-bits='64' hash='545511d411a9aab2' id='c34853f2'/>
    <pointer-type-def type-id='3384ef92' size-in-bits='64' hash='b801e000dde8ec89' id='b509a840'/>
    <pointer-type-def type-id='b509a840' size-in-bits='64' hash='5554de9e63c368f3' id='68341ede'/>
    <pointer-type-def type-id='3a1587ff' size-in-bits='64' hash='41afd7cacfa527b1' id='e79cd027'/>
    <pointer-type-def type-id='c7372297' size-in-bits='64' hash='a41648db21b39856' id='44388ddf'/>
    <pointer-type-def type-id='44388ddf' size-in-bits='64' hash='3600ed88c067324b' id='5a0778af'/>
    <pointer-type-def type-id='c0d240d3' size-in-bits='64' hash='549de05cd96f1e43' id='d8768e33'/>
    <pointer-type-def type-id='5f1f8343' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ebc27c62'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='ce3367a6' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82f59c11'/>
    <pointer-type-def type-id='10183a3e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='78d860eb'/>
    <pointer-type-def type-id='faef6e24' size-in-bits='64' hash='fd7a63c0c6c822c4' id='7a375257'/>
    <pointer-type-def type-id='d8775801' size-in-bits='64' hash='fd7a63c0c6c822c4' id='0c87adc6'/>
