<abi-corpus version='2.4' soname='libspdk_ftl.so.10.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_thread.so.12.0'/>
    <dependency name='libspdk_bdev.so.18.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libspdk_jsonrpc.so.7.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_ftl_conf_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_conf_deinit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_get_attrs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_get_conf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_ftl_dev_set_fast_shutdown' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_poller_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_put_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strcpy_pad' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_exit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_get_last_tsc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_description' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_owner_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u32log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u64log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_malloc_socket' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_dequeue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_enqueue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='ftl_base_bdev.c' language='LANG_C11'>
    <var-decl name='ftl_bitmap_buffer_alignment' type-id='d0fa5dde' visibility='default' filepath='ftl_bitmap.h' line='16' column='1'/>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_core.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <array-type-def dimensions='1' type-id='096b0b42' size-in-bits='3840' hash='bbd409d39ae7ccb7' id='e60e29c6'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1c0e592c7ffbdbf5' id='52fa524b'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='ftl_stats' is-struct='yes' visibility='default' size-in-bits='4160' filepath='ftl.h' line='58' column='1' hash='695b60630d7baf51' id='36f74cd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='limits' type-id='85c64d26' visibility='default' filepath='ftl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='io_activity_total' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='entries' type-id='e60e29c6' visibility='default' filepath='ftl.h' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_entry' is-struct='yes' visibility='default' size-in-bits='640' filepath='ftl.h' line='43' column='1' hash='645a1ab75a24226e' id='096b0b42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read' type-id='2ce53abd' visibility='default' filepath='ftl.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write' type-id='2ce53abd' visibility='default' filepath='ftl.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_error' is-struct='yes' visibility='default' size-in-bits='192' filepath='ftl.h' line='31' column='1' hash='415744863698ab48' id='652a872c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='media' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='crc' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='other' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ftl_stats_group' is-struct='yes' visibility='default' size-in-bits='320' filepath='ftl.h' line='37' column='1' hash='9d2cea2f51642499' id='2ce53abd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ios' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='errors' type-id='652a872c' visibility='default' filepath='ftl.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_ftl_attrs' is-struct='yes' visibility='default' size-in-bits='192' filepath='ftl.h' line='163' column='1' hash='1c5872bffc999f05' id='aa6cb391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_size' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='optimum_io_size' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_ftl_fn' type-id='82328a76' size-in-bits='64' filepath='ftl.h' line='172' column='1' hash='fd7a63c0c6c822c4' id='19dafce4'/>
    <typedef-decl name='spdk_ftl_stats_fn' type-id='e9764a75' size-in-bits='64' filepath='ftl.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='cb4ea0c8'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='256' hash='4782e910fd534fc8' id='85c64d26'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <pointer-type-def type-id='36f74cd1' size-in-bits='64' hash='b91d3625e19bdcbe' id='463fc3a9'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='aa6cb391' size-in-bits='64' hash='bfa9b25141bd77b1' id='cdbd9bf9'/>
    <pointer-type-def type-id='c6068e88' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e9764a75'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <qualified-type-def type-id='2379e16e' const='yes' id='28b05667'/>
    <pointer-type-def type-id='28b05667' size-in-bits='64' id='5a97db37'/>
    <pointer-type-def type-id='7bf9465a' size-in-bits='64' id='36f8a0e8'/>
    <pointer-type-def type-id='2379e16e' size-in-bits='64' id='5c15bda4'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <function-decl name='spdk_ftl_io_size' mangled-name='spdk_ftl_io_size' filepath='ftl_core.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_io_size' hash='e0055d99adb0e173'>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_get_attrs' mangled-name='spdk_ftl_dev_get_attrs' filepath='ftl_core.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_get_attrs' hash='5f727c6cfe6f97cd'>
      <parameter type-id='5a97db37' name='dev' filepath='ftl_core.c' line='303' column='1'/>
      <parameter type-id='cdbd9bf9' name='attrs' filepath='ftl_core.c' line='303' column='1'/>
      <parameter type-id='b59d7dce' name='attrs_size' filepath='ftl_core.c' line='304' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_writev' mangled-name='spdk_ftl_writev' filepath='ftl_core.c' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_writev' hash='ca529eb9c86eda87'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='36f8a0e8' name='io' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='9c313c2d' name='lba' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='9c313c2d' name='lba_cnt' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='b59d7dce' name='iov_cnt' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='19dafce4' name='cb_fn' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_core.c' line='422' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_readv' mangled-name='spdk_ftl_readv' filepath='ftl_core.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_readv' hash='ca529eb9c86eda87'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='36f8a0e8' name='io' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='ftl_core.c' line='421' column='1'/>
      <parameter type-id='9c313c2d' name='lba' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='9c313c2d' name='lba_cnt' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='b59d7dce' name='iov_cnt' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='19dafce4' name='cb_fn' filepath='ftl_core.c' line='422' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_core.c' line='422' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_unmap' mangled-name='spdk_ftl_unmap' filepath='ftl_core.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_unmap' hash='b6c7236d3a4d41b7'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='467' column='1'/>
      <parameter type-id='36f8a0e8' name='io' filepath='ftl_core.c' line='467' column='1'/>
      <parameter type-id='a7e01876' name='ch' filepath='ftl_core.c' line='467' column='1'/>
      <parameter type-id='9c313c2d' name='lba' filepath='ftl_core.c' line='468' column='1'/>
      <parameter type-id='9c313c2d' name='lba_cnt' filepath='ftl_core.c' line='468' column='1'/>
      <parameter type-id='19dafce4' name='cb_fn' filepath='ftl_core.c' line='468' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_core.c' line='468' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_init' mangled-name='spdk_ftl_init' filepath='ftl_core.c' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_init' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_fini' mangled-name='spdk_ftl_fini' filepath='ftl_core.c' line='805' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_set_fast_shutdown' mangled-name='spdk_ftl_dev_set_fast_shutdown' filepath='ftl_core.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_set_fast_shutdown' hash='c7c710e908194b91'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='812' column='1'/>
      <parameter type-id='c894953d' name='fast_shutdown' filepath='ftl_core.c' line='812' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ftl_get_io_channel' mangled-name='spdk_ftl_get_io_channel' filepath='ftl_core.c' line='853' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_io_channel' hash='7f32ffea222edbe7'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='853' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_ftl_get_stats' mangled-name='spdk_ftl_get_stats' filepath='ftl_core.c' line='898' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_stats' hash='c3036ddf9dcf6adf'>
      <parameter type-id='5c15bda4' name='dev' filepath='ftl_core.c' line='898' column='1'/>
      <parameter type-id='463fc3a9' name='stats' filepath='ftl_core.c' line='898' column='1'/>
      <parameter type-id='cb4ea0c8' name='cb_fn' filepath='ftl_core.c' line='898' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_core.c' line='899' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <var-decl name='g_ftl_write_buf' type-id='eaa32e2f' visibility='default' filepath='ftl_core.h' line='41' column='1'/>
    <var-decl name='g_ftl_read_buf' type-id='eaa32e2f' visibility='default' filepath='ftl_core.h' line='42' column='1'/>
    <class-decl name='spdk_ftl_dev' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='ftl_core.h' line='46' column='1' id='2379e16e'/>
    <class-decl name='ftl_io' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='ftl_io.h' line='58' column='1' id='7bf9465a'/>
    <function-type size-in-bits='64' hash='61c044b271cfb531' id='c6068e88'>
      <parameter type-id='463fc3a9'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_init.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='b59d7dce' size-in-bits='256' hash='3faccf7f3517bdb4' id='314f9837'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <class-decl name='spdk_ftl_conf' is-struct='yes' visibility='default' size-in-bits='1088' filepath='ftl.h' line='82' column='1' hash='f922dcd8de164553' id='71e1eb61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='ftl.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='ftl.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='overprovisioning' type-id='9c313c2d' visibility='default' filepath='ftl.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='l2p_dram_limit' type-id='b59d7dce' visibility='default' filepath='ftl.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='core_mask' type-id='26a90f95' visibility='default' filepath='ftl.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='user_io_pool_size' type-id='b59d7dce' visibility='default' filepath='ftl.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='limits' type-id='314f9837' visibility='default' filepath='ftl.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='mode' type-id='8f92235e' visibility='default' filepath='ftl.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='nv_cache' type-id='e7f43f72' visibility='default' filepath='ftl.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='prep_upgrade_on_shutdown' type-id='c894953d' visibility='default' filepath='ftl.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='808'>
        <var-decl name='verbose_mode' type-id='c894953d' visibility='default' filepath='ftl.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved' type-id='0f4b9e74' visibility='default' filepath='ftl.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='base_bdev' type-id='26a90f95' visibility='default' filepath='ftl.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cache_bdev' type-id='26a90f95' visibility='default' filepath='ftl.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='fast_shutdown' type-id='c894953d' visibility='default' filepath='ftl.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='968'>
        <var-decl name='reserved2' type-id='d3538ec5' visibility='default' filepath='ftl.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='conf_size' type-id='b59d7dce' visibility='default' filepath='ftl.h' line='149' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' is-struct='yes' visibility='default' size-in-bits='128' filepath='uuid.h' line='21' column='1' hash='ad18e2956698a415' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='ftl.h' line='107' column='1' hash='3acda274eaf435c6' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='chunk_compaction_threshold' type-id='8f92235e' visibility='default' filepath='ftl.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='chunk_free_target' type-id='8f92235e' visibility='default' filepath='ftl.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='spdk_ftl_init_fn' type-id='49476f47' size-in-bits='64' filepath='ftl.h' line='173' column='1' hash='fd7a63c0c6c822c4' id='f94ea377'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' hash='92399eb84731c3e2' id='0f4b9e74'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='uuid.h' line='22' column='1' hash='83563518080289b9' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='71e1eb61' const='yes' hash='019b91ca7d2f7097' id='8ca3f2c6'/>
    <pointer-type-def type-id='8ca3f2c6' size-in-bits='64' hash='5238ca6493b501b6' id='52176984'/>
    <pointer-type-def type-id='901f6dfe' size-in-bits='64' hash='fd7a63c0c6c822c4' id='49476f47'/>
    <pointer-type-def type-id='2379e16e' size-in-bits='64' id='5c15bda5'/>
    <function-decl name='spdk_ftl_dev_init' mangled-name='spdk_ftl_dev_init' filepath='ftl_init.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_init' hash='8cf2be8a6274c7b0'>
      <parameter type-id='52176984' name='conf' filepath='ftl_init.c' line='163' column='1'/>
      <parameter type-id='f94ea377' name='cb_fn' filepath='ftl_init.c' line='163' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_init.c' line='163' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_ftl_dev_free' mangled-name='spdk_ftl_dev_free' filepath='ftl_init.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_dev_free' hash='a7f99494147764a8'>
      <parameter type-id='5c15bda5' name='dev' filepath='ftl_init.c' line='208' column='1'/>
      <parameter type-id='19dafce4' name='cb_fn' filepath='ftl_init.c' line='208' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_init.c' line='208' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='901f6dfe'>
      <parameter type-id='5c15bda5'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_l2p_cache.c' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_nv_cache.c' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_trace.c' language='LANG_C11'>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f73' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' hash='953f9801eb087566' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eed'/>
    <pointer-type-def type-id='a6dc9de4' size-in-bits='64' hash='f13879d37c217898' id='ddda0722'/>
    <var-decl name='g_trace_file' type-id='ddda0722' visibility='default' filepath='trace.h' line='149' column='1' elf-symbol-id='g_trace_file'/>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_mngt_band.c' language='LANG_C11'>
    <qualified-type-def type-id='b59d7dce' const='yes' hash='86827e66a8bd4e2d' id='d0fa5dde'/>
  </abi-instr>
  <abi-instr address-size='64' path='ftl_mngt_misc.c' language='LANG_C11'>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='2379e16e' size-in-bits='64' id='5c15bda6'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b637'/>
    <class-decl name='spdk_jsonrpc_request' is-struct='yes' visibility='default' is-declaration-only='yes' id='1c42476f'/>
    <function-decl name='spdk_ftl_get_properties' mangled-name='spdk_ftl_get_properties' filepath='ftl_mngt_misc.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ftl_get_properties' hash='a7f99494147764a8'>
      <parameter type-id='5c15bda6' name='dev' filepath='ftl_mngt_misc.c' line='370' column='1'/>
      <parameter type-id='42a6b637' name='request' filepath='ftl_mngt_misc.c' line='370' column='1'/>
      <parameter type-id='19dafce4' name='cb_fn' filepath='ftl_mngt_misc.c' line='371' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='ftl_mngt_misc.c' line='371' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
