<abi-corpus version='2.4' soname='libspdk_bdev_nvme.so.8.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libspdk_jsonrpc.so.7.0'/>
    <dependency name='libspdk_rpc.so.8.0'/>
    <dependency name='libspdk_bdev.so.18.0'/>
    <dependency name='libspdk_thread.so.12.0'/>
    <dependency name='libspdk_accel.so.17.0'/>
    <dependency name='libspdk_keyring.so.3.0'/>
    <dependency name='libspdk_nvme.so.16.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_nvme_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_nvme_delete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_nvme_get_default_ctrlr_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_nvme_get_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_nvme_set_multipath_policy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_trace_register_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_tpoint_register_relation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate_sha1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_set_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcasecmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_process_is_primary' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='bdev_nvme.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' hash='6ed507bb73d52e47' id='ca634421'>
      <subrange length='224' lower-bound='0' upper-bound='223' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='13efbde50778ea2c' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' hash='4b216217eb2844ff' id='12da2087'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' hash='e7f9696e246a3049' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_bdev_nvme_multipath_policy' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='23' column='1' hash='8952fa27524a38cd' id='76fda5ef'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BDEV_NVME_MP_POLICY_ACTIVE_PASSIVE' value='0'/>
      <enumerator name='BDEV_NVME_MP_POLICY_ACTIVE_ACTIVE' value='1'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_nvme_multipath_selector' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='28' column='1' hash='ed7e32bd9345fb45' id='c526c38c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BDEV_NVME_MP_SELECTOR_ROUND_ROBIN' value='1'/>
      <enumerator name='BDEV_NVME_MP_SELECTOR_QUEUE_DEPTH' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_timeout_action' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='55' column='1' hash='d32e1d12e6b37915' id='9d786c01'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_NVME_TIMEOUT_ACTION_NONE' value='0'/>
      <enumerator name='SPDK_BDEV_NVME_TIMEOUT_ACTION_RESET' value='1'/>
      <enumerator name='SPDK_BDEV_NVME_TIMEOUT_ACTION_ABORT' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_ams' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='678' column='1' hash='173cec4dd356b4b5' id='468f6380'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_AMS_RR' value='0'/>
      <enumerator name='SPDK_NVME_CC_AMS_WRR' value='1'/>
      <enumerator name='SPDK_NVME_CC_AMS_VS' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_cc_css' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='117' column='1' hash='839f455cd031a1d0' id='1fb07fa0'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_CC_CSS_NVM' value='0'/>
      <enumerator name='SPDK_NVME_CC_CSS_IOCS' value='6'/>
      <enumerator name='SPDK_NVME_CC_CSS_NOIO' value='7'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='435' column='1' hash='a773cdff5c729a70' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='116' column='1' hash='26614543a63ed59a' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='95e97e60'/>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_nvme_ctrlr_opts' is-struct='yes' visibility='default' size-in-bits='448' filepath='nvme.h' line='33' column='1' hash='b70247dd63075cc8' id='833b22ed'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prchk_flags' type-id='8f92235e' visibility='default' filepath='nvme.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ctrlr_loss_timeout_sec' type-id='3ff5601b' visibility='default' filepath='nvme.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='reconnect_delay_sec' type-id='8f92235e' visibility='default' filepath='nvme.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fast_io_fail_timeout_sec' type-id='8f92235e' visibility='default' filepath='nvme.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='from_discovery_service' type-id='c894953d' visibility='default' filepath='nvme.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='psk' type-id='80f4b756' visibility='default' filepath='nvme.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dhchap_key' type-id='80f4b756' visibility='default' filepath='nvme.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dhchap_ctrlr_key' type-id='80f4b756' visibility='default' filepath='nvme.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='allow_unrecognized_csi' type-id='c894953d' visibility='default' filepath='nvme.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='392'>
        <var-decl name='multipath' type-id='c894953d' visibility='default' filepath='nvme.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_nvme_opts' is-struct='yes' visibility='default' size-in-bits='1088' filepath='nvme.h' line='61' column='1' hash='baafe519962c3153' id='739bc403'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='action_on_timeout' type-id='9d786c01' visibility='default' filepath='nvme.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='timeout_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='timeout_admin_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transport_retry_count' type-id='8f92235e' visibility='default' filepath='nvme.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='arbitration_burst' type-id='8f92235e' visibility='default' filepath='nvme.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='low_priority_weight' type-id='8f92235e' visibility='default' filepath='nvme.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='medium_priority_weight' type-id='8f92235e' visibility='default' filepath='nvme.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='high_priority_weight' type-id='8f92235e' visibility='default' filepath='nvme.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvme_adminq_poll_period_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvme_ioq_poll_period_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='delay_cmd_submit' type-id='c894953d' visibility='default' filepath='nvme.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='reserved73' type-id='d3490169' visibility='default' filepath='nvme.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='bdev_retry_count' type-id='3ff5601b' visibility='default' filepath='nvme.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ctrlr_loss_timeout_sec' type-id='3ff5601b' visibility='default' filepath='nvme.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='reconnect_delay_sec' type-id='8f92235e' visibility='default' filepath='nvme.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fast_io_fail_timeout_sec' type-id='8f92235e' visibility='default' filepath='nvme.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default' filepath='nvme.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='744'>
        <var-decl name='disable_auto_failback' type-id='c894953d' visibility='default' filepath='nvme.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='752'>
        <var-decl name='generate_uuids' type-id='c894953d' visibility='default' filepath='nvme.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='760'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default' filepath='nvme.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nvme_error_stat' type-id='c894953d' visibility='default' filepath='nvme.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='776'>
        <var-decl name='io_path_stat' type-id='c894953d' visibility='default' filepath='nvme.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='allow_accel_sequence' type-id='c894953d' visibility='default' filepath='nvme.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='reserved99' type-id='0f44e2af' visibility='default' filepath='nvme.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rdma_srq_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='rdma_max_cq_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='rdma_cm_event_timeout_ms' type-id='149c6638' visibility='default' filepath='nvme.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='880'>
        <var-decl name='reserved110' type-id='0f4b9e74' visibility='default' filepath='nvme.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dhchap_digests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='dhchap_dhgroups' type-id='8f92235e' visibility='default' filepath='nvme.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='rdma_umr_per_io' type-id='c894953d' visibility='default' filepath='nvme.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='968'>
        <var-decl name='reserved121' type-id='d3490169' visibility='default' filepath='nvme.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='tcp_connect_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='enable_flush' type-id='c894953d' visibility='default' filepath='nvme.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_opts' is-struct='yes' visibility='default' size-in-bits='6848' filepath='nvme.h' line='49' column='1' hash='d4f437bc8a6db7ec' id='388558d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_io_queues' type-id='8f92235e' visibility='default' filepath='nvme.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_cmb_sqs' type-id='c894953d' visibility='default' filepath='nvme.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='no_shn_notification' type-id='c894953d' visibility='default' filepath='nvme.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='enable_interrupts' type-id='c894953d' visibility='default' filepath='nvme.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arb_mechanism' type-id='468f6380' visibility='default' filepath='nvme.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='arbitration_burst' type-id='b96825af' visibility='default' filepath='nvme.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='low_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='medium_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='high_priority_weight' type-id='b96825af' visibility='default' filepath='nvme.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='keep_alive_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='transport_retry_count' type-id='b96825af' visibility='default' filepath='nvme.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='reserved21' type-id='d3490169' visibility='default' filepath='nvme.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='io_queue_size' type-id='8f92235e' visibility='default' filepath='nvme.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='hostnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='io_queue_requests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='src_addr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='src_svcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4368'>
        <var-decl name='host_id' type-id='13339fda' visibility='default' filepath='nvme.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4432'>
        <var-decl name='extended_host_id' type-id='fa9986a5' visibility='default' filepath='nvme.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4560'>
        <var-decl name='reserved570' type-id='0f4b9e74' visibility='default' filepath='nvme.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4576'>
        <var-decl name='command_set' type-id='1fb07fa0' visibility='default' filepath='nvme.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='admin_timeout_ms' type-id='8f92235e' visibility='default' filepath='nvme.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4640'>
        <var-decl name='header_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4648'>
        <var-decl name='data_digest' type-id='c894953d' visibility='default' filepath='nvme.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4656'>
        <var-decl name='disable_error_logging' type-id='c894953d' visibility='default' filepath='nvme.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4664'>
        <var-decl name='transport_ack_timeout' type-id='b96825af' visibility='default' filepath='nvme.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4672'>
        <var-decl name='admin_queue_size' type-id='149c6638' visibility='default' filepath='nvme.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4688'>
        <var-decl name='reserved586' type-id='0f562bd0' visibility='default' filepath='nvme.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4736'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvme.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4800'>
        <var-decl name='fabrics_connect_timeout_us' type-id='9c313c2d' visibility='default' filepath='nvme.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='disable_read_ana_log_page' type-id='c894953d' visibility='default' filepath='nvme.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='reserved610' type-id='d3538ec5' visibility='default' filepath='nvme.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='disable_read_changed_ns_list_log_page' type-id='b96825af' visibility='default' filepath='nvme.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4936'>
        <var-decl name='reserved617' type-id='d8d29afc' visibility='default' filepath='nvme.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='transport_tos' type-id='b96825af' visibility='default' filepath='nvme.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='tls_psk' type-id='f004afe7' visibility='default' filepath='nvme.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='dhchap_key' type-id='f004afe7' visibility='default' filepath='nvme.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='dhchap_ctrlr_key' type-id='f004afe7' visibility='default' filepath='nvme.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='dhchap_digests' type-id='8f92235e' visibility='default' filepath='nvme.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='dhchap_dhgroups' type-id='8f92235e' visibility='default' filepath='nvme.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' is-struct='yes' visibility='default' size-in-bits='4512' filepath='nvme.h' line='491' column='1' hash='ed30d5448f2f7c82' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='507' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='536' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' size-in-bits='128' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' size-in-bits='320' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_nvme_create_cb' type-id='db87700c' size-in-bits='64' filepath='nvme.h' line='19' column='1' hash='fd7a63c0c6c822c4' id='b08e707e'/>
    <typedef-decl name='spdk_bdev_nvme_delete_cb' type-id='82328a76' size-in-bits='64' filepath='nvme.h' line='21' column='1' hash='fd7a63c0c6c822c4' id='cdcd7e57'/>
    <typedef-decl name='spdk_bdev_nvme_set_multipath_policy_cb' type-id='82328a76' size-in-bits='64' filepath='nvme.h' line='20' column='1' hash='fd7a63c0c6c822c4' id='63fb8c7a'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
