<abi-corpus version='2.4' soname='libspdk_jsonrpc.so.7.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_jsonrpc_begin_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_create_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_get_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_set_nonblock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_flog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_decode_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_strequal' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_bool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_string_fmt_v' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_val' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_parse_ip_addr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='jsonrpc_client.c' language='LANG_C11'>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='658455c7' size-in-bits='64' id='63dc953f'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_jsonrpc_begin_request' mangled-name='spdk_jsonrpc_begin_request' filepath='jsonrpc_client.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_request' hash='e9ea91a7eab8302c'>
      <parameter type-id='63dc953f' name='request' filepath='jsonrpc_client.c' line='165' column='1'/>
      <parameter type-id='3ff5601b' name='id' filepath='jsonrpc_client.c' line='165' column='1'/>
      <parameter type-id='80f4b756' name='method' filepath='jsonrpc_client.c' line='166' column='1'/>
      <return type-id='b8e14bfe'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_request' mangled-name='spdk_jsonrpc_end_request' filepath='jsonrpc_client.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_request' hash='7f32ffea222edbe7'>
      <parameter type-id='63dc953f' name='request' filepath='jsonrpc_client.c' line='190' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='jsonrpc_client.c' line='190' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client_request' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='jsonrpc_internal.h' line='81' column='1' id='658455c7'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_client_tcp.c' language='LANG_C11'>
    <class-decl name='spdk_jsonrpc_client_response' is-struct='yes' visibility='default' size-in-bits='256' filepath='jsonrpc.h' line='43' column='1' hash='b2fb899a3a442605' id='1361d8dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='result' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='9fc5272e' size-in-bits='64' hash='b552bd77ad66cb62' id='8505e504'/>
    <pointer-type-def type-id='1361d8dd' size-in-bits='64' hash='0c5fd3c569e0cb1c' id='f9dbe2ed'/>
    <pointer-type-def type-id='9d9bbaf1' size-in-bits='64' id='6137db59'/>
    <pointer-type-def type-id='658455c7' size-in-bits='64' id='63dc9540'/>
    <function-decl name='spdk_jsonrpc_client_connect' mangled-name='spdk_jsonrpc_client_connect' filepath='jsonrpc_client_tcp.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_connect' hash='7cffa03161e7e042'>
      <parameter type-id='80f4b756' name='addr' filepath='jsonrpc_client_tcp.c' line='231' column='1'/>
      <parameter type-id='95e97e5e' name='addr_family' filepath='jsonrpc_client_tcp.c' line='231' column='1'/>
      <return type-id='6137db59'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_close' mangled-name='spdk_jsonrpc_client_close' filepath='jsonrpc_client_tcp.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_close' hash='7f32ffea222edbe7'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='306' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_create_request' mangled-name='spdk_jsonrpc_client_create_request' filepath='jsonrpc_client_tcp.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_create_request' hash='7f32ffea222edbe7'>
      <return type-id='63dc9540'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_request' mangled-name='spdk_jsonrpc_client_free_request' filepath='jsonrpc_client_tcp.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_request' hash='7f32ffea222edbe7'>
      <parameter type-id='63dc9540' name='req' filepath='jsonrpc_client_tcp.c' line='343' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_poll' mangled-name='spdk_jsonrpc_client_poll' filepath='jsonrpc_client_tcp.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_poll' hash='d628501fd2223339'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='350' column='1'/>
      <parameter type-id='95e97e5e' name='timeout' filepath='jsonrpc_client_tcp.c' line='350' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_send_request' mangled-name='spdk_jsonrpc_client_send_request' filepath='jsonrpc_client_tcp.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_send_request' hash='388da3fa973fde78'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='360' column='1'/>
      <parameter type-id='63dc9540' name='req' filepath='jsonrpc_client_tcp.c' line='361' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_get_response' mangled-name='spdk_jsonrpc_client_get_response' filepath='jsonrpc_client_tcp.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_get_response' hash='28b705a7c7c0f3aa'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='372' column='1'/>
      <return type-id='f9dbe2ed'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_response' mangled-name='spdk_jsonrpc_client_free_response' filepath='jsonrpc_client_tcp.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_response' hash='28b705a7c7c0f3aa'>
      <parameter type-id='f9dbe2ed' name='resp' filepath='jsonrpc_client_tcp.c' line='386' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='jsonrpc_internal.h' line='101' column='1' id='9d9bbaf1'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' size-in-bits='32' alignment-in-bits='32' filepath='log.h' line='90' column='1' hash='f54503d906878e62' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='2ae61989' size-in-bits='64' id='b8e14bff'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b637'/>
    <pointer-type-def type-id='c4c192e4' size-in-bits='64' id='7923cb22'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61989'/>
    <class-decl name='spdk_jsonrpc_request' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='jsonrpc_internal.h' line='23' column='1' id='1c42476f'/>
    <class-decl name='spdk_jsonrpc_server_conn' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='jsonrpc_internal.h' line='48' column='1' id='c4c192e4'/>
    <function-decl name='spdk_jsonrpc_set_log_level' mangled-name='spdk_jsonrpc_set_log_level' filepath='jsonrpc_server.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_set_log_level' hash='7752fe97b393f20c'>
      <parameter type-id='4271cbce' name='level' filepath='jsonrpc_server.c' line='21' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_set_log_file' mangled-name='spdk_jsonrpc_set_log_file' filepath='jsonrpc_server.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_set_log_file' hash='2c833d407d937488'>
      <parameter type-id='822cd80b' name='file' filepath='jsonrpc_server.c' line='29' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_get_conn' mangled-name='spdk_jsonrpc_get_conn' filepath='jsonrpc_server.c' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_get_conn' hash='7f32ffea222edbe7'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='276' column='1'/>
      <return type-id='7923cb22'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_begin_result' mangled-name='spdk_jsonrpc_begin_result' filepath='jsonrpc_server.c' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_result' hash='7f32ffea222edbe7'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='366' column='1'/>
      <return type-id='b8e14bff'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_result' mangled-name='spdk_jsonrpc_end_result' filepath='jsonrpc_server.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_result' hash='7f32ffea222edbe7'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='375' column='1'/>
      <parameter type-id='b8e14bff' name='w' filepath='jsonrpc_server.c' line='375' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_bool_response' mangled-name='spdk_jsonrpc_send_bool_response' filepath='jsonrpc_server.c' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_bool_response' hash='c7c710e908194b91'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='389' column='1'/>
      <parameter type-id='c894953d' name='value' filepath='jsonrpc_server.c' line='389' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response' mangled-name='spdk_jsonrpc_send_error_response' filepath='jsonrpc_server.c' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response' hash='e9ea91a7eab8302c'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='407' column='1'/>
      <parameter type-id='95e97e5e' name='error_code' filepath='jsonrpc_server.c' line='408' column='1'/>
      <parameter type-id='80f4b756' name='msg' filepath='jsonrpc_server.c' line='408' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response_fmt' mangled-name='spdk_jsonrpc_send_error_response_fmt' filepath='jsonrpc_server.c' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response_fmt' hash='e9ea91a7eab8302c'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='425' column='1'/>
      <parameter type-id='95e97e5e' name='error_code' filepath='jsonrpc_server.c' line='426' column='1'/>
      <parameter type-id='80f4b756' name='fmt' filepath='jsonrpc_server.c' line='426' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server_tcp.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' size-in-bits='32' alignment-in-bits='32' filepath='json.h' line='21' column='1' hash='4b975249c4c2bd4a' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='socket.h' line='183' column='1' hash='17b889f8dd08e00f' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default' filepath='socket.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default' filepath='socket.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' is-struct='yes' visibility='default' size-in-bits='128' filepath='json.h' line='36' column='1' hash='8563d681b49b84d7' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__socklen_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='210' column='1' hash='e66b43f97c38e87a' id='83f97a0a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='sa_family_t' type-id='f0981eec' size-in-bits='16' filepath='sockaddr.h' line='28' column='1' hash='d7723bb93a30b11d' id='376fda66'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' size-in-bits='32' filepath='socket.h' line='33' column='1' hash='e66b43f97c38e87a' id='6b2697b0'/>
    <typedef-decl name='spdk_jsonrpc_conn_closed_fn' type-id='d72cdea4' size-in-bits='64' filepath='jsonrpc.h' line='67' column='1' hash='fd7a63c0c6c822c4' id='36baf675'/>
    <typedef-decl name='spdk_jsonrpc_handle_request_fn' type-id='b39153c1' size-in-bits='64' filepath='jsonrpc.h' line='60' column='1' hash='fd7a63c0c6c822c4' id='3effb642'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <qualified-type-def type-id='9fc5272e' const='yes' hash='58b78b3cb252e033' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' hash='04e62bb6175e0f38' id='3ee1fff1'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='64' hash='b051efca9beefff0' id='5c0abad8'/>
    <pointer-type-def type-id='fef343e4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b39153c1'/>
    <pointer-type-def type-id='953077c3' size-in-bits='64' hash='fd7a63c0c6c822c4' id='d72cdea4'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b638'/>
    <pointer-type-def type-id='79c1ff35' size-in-bits='64' id='3c05c735'/>
    <pointer-type-def type-id='c4c192e4' size-in-bits='64' id='7923cb23'/>
    <class-decl name='spdk_jsonrpc_server' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='jsonrpc_internal.h' line='71' column='1' id='79c1ff35'/>
    <function-decl name='spdk_jsonrpc_server_listen' mangled-name='spdk_jsonrpc_server_listen' filepath='jsonrpc_server_tcp.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_listen' hash='8bab6668074b312b'>
      <parameter type-id='95e97e5e' name='domain' filepath='jsonrpc_server_tcp.c' line='11' column='1'/>
      <parameter type-id='95e97e5e' name='protocol' filepath='jsonrpc_server_tcp.c' line='11' column='1'/>
      <parameter type-id='5c0abad8' name='listen_addr' filepath='jsonrpc_server_tcp.c' line='12' column='1'/>
      <parameter type-id='6b2697b0' name='addrlen' filepath='jsonrpc_server_tcp.c' line='12' column='1'/>
      <parameter type-id='3effb642' name='handle_request' filepath='jsonrpc_server_tcp.c' line='13' column='1'/>
      <return type-id='3c05c735'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_server_shutdown' mangled-name='spdk_jsonrpc_server_shutdown' filepath='jsonrpc_server_tcp.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_shutdown' hash='7f32ffea222edbe7'>
      <parameter type-id='3c05c735' name='server' filepath='jsonrpc_server_tcp.c' line='119' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_conn_add_close_cb' mangled-name='spdk_jsonrpc_conn_add_close_cb' filepath='jsonrpc_server_tcp.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_conn_add_close_cb' hash='a7f99494147764a8'>
      <parameter type-id='7923cb23' name='conn' filepath='jsonrpc_server_tcp.c' line='165' column='1'/>
