<abi-corpus version='2.4' soname='libspdk_trace.so.12.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libspdk_jsonrpc.so.7.0'/>
    <dependency name='libspdk_rpc.so.8.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_spdk_trace_record' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_cleanup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_clear_tpoint_group_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_clear_tpoints' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_create_tpoint_group_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_trace_disable_tpoint_group' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_json_write_named_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_end_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_send_bool_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_register_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u64log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_current_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_first_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_next_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='trace.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab#2' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' hash='953f9801eb087566' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='a6dc9de4' size-in-bits='64' hash='f13879d37c217898' id='ddda0722'/>
    <var-decl name='g_trace_file' type-id='ddda0722' visibility='default' filepath='trace.h' line='149' column='1'/>
    <function-decl name='_spdk_trace_record' mangled-name='_spdk_trace_record' filepath='trace.c' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_spdk_trace_record' hash='53dd94d80be6dac5'>
      <parameter type-id='9c313c2d' name='tsc' filepath='trace.c' line='43' column='1'/>
      <parameter type-id='149c6638' name='tpoint_id' filepath='trace.c' line='43' column='1'/>
      <parameter type-id='149c6638' name='owner_id' filepath='trace.c' line='43' column='1'/>
      <parameter type-id='8f92235e' name='size' filepath='trace.c' line='43' column='1'/>
      <parameter type-id='9c313c2d' name='object_id' filepath='trace.c' line='44' column='1'/>
      <parameter type-id='95e97e5e' name='num_args' filepath='trace.c' line='44' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_trace_register_user_thread' mangled-name='spdk_trace_register_user_thread' filepath='trace.c' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_register_user_thread' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_trace_unregister_user_thread' mangled-name='spdk_trace_unregister_user_thread' filepath='trace.c' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_unregister_user_thread' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_trace_init' mangled-name='spdk_trace_init' filepath='trace.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_init' hash='8f7cfc9c5916bfe9'>
      <parameter type-id='80f4b756' name='shm_name' filepath='trace.c' line='235' column='1'/>
      <parameter type-id='9c313c2d' name='num_entries' filepath='trace.c' line='235' column='1'/>
      <parameter type-id='8f92235e' name='num_threads' filepath='trace.c' line='235' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_trace_cleanup' mangled-name='spdk_trace_cleanup' filepath='trace.c' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_cleanup' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='30a82da4'>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='trace_flags.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_register_fn' is-struct='yes' visibility='default' size-in-bits='256' filepath='trace.h' line='475' column='1' hash='8010e5c98acfb400' id='fa16a4d0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='trace.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tgroup_id' type-id='b96825af' visibility='default' filepath='trace.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_fn' type-id='c640490b' visibility='default' filepath='trace.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='next' type-id='62e69c26' visibility='default' filepath='trace.h' line='479' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint_opts' is-struct='yes' visibility='default' size-in-bits='1152' filepath='trace.h' line='404' column='1' hash='d4465d9db4c21eeb' id='b8914557'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='trace.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='args' type-id='b7d6ede4' visibility='default' filepath='trace.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='trace.h' line='410' column='1' hash='27034ba5e0ba25de' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='trace.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='413' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f73' size-in-bits='1024' hash='326cd8284b6dcd24' id='b7d6ede4'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='b8914557' const='yes' hash='e48e9911d4e84378' id='eebbd522'/>
    <pointer-type-def type-id='eebbd522' size-in-bits='64' hash='2ad3bed59bce62f1' id='d9b05b98'/>
    <pointer-type-def type-id='fa16a4d0' size-in-bits='64' hash='4e80675f375a6f8b' id='62e69c26'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c640490b'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_trace_get_tpoint_mask' mangled-name='spdk_trace_get_tpoint_mask' filepath='trace_flags.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_get_tpoint_mask' hash='ef8d4a673fef6caa'>
      <parameter type-id='8f92235e' name='group_id' filepath='trace_flags.c' line='27' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_trace_set_tpoints' mangled-name='spdk_trace_set_tpoints' filepath='trace_flags.c' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_set_tpoints' hash='3f7b79ee24d3110f'>
      <parameter type-id='8f92235e' name='group_id' filepath='trace_flags.c' line='58' column='1'/>
      <parameter type-id='9c313c2d' name='tpoint_mask' filepath='trace_flags.c' line='58' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_trace_clear_tpoints' mangled-name='spdk_trace_clear_tpoints' filepath='trace_flags.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_trace_clear_tpoints' hash='3f7b79ee24d3110f'>
      <parameter type-id='8f92235e' name='group_id' filepath='trace_flags.c' line='58' column='1'/>
      <parameter type-id='9c313c2d' name='tpoint_mask' filepath='trace_flags.c' line='58' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
