<abi-corpus version='2.2' soname='libspdk_util.so.8.0'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_base64_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_capacity' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_count_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_strtol' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strtoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_u32log2' type='gnu-ifunc-type' binding='global-binding' visibility='default-visibility' alias='spdk_u32log2.resolver' is-defined='yes'/>
    <elf-symbol name='spdk_u32log2.resolver' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_u64log2' type='gnu-ifunc-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_u64log2.resolver' type='func-type' binding='weak-binding' visibility='default-visibility' alias='spdk_u64log2' is-defined='yes'/>
    <elf-symbol name='spdk_unhexlify' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_generate_sha1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_is_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_set_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vsprintf_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vsprintf_append_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xor_gen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xor_get_optimal_alignment' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='base64.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <function-decl name='spdk_base64_encode' mangled-name='spdk_base64_encode' filepath='base64.c' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_encode'>
      <parameter type-id='26a90f95' name='dst' filepath='base64.c' line='123' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='base64.c' line='123' column='1'/>
      <parameter type-id='b59d7dce' name='src_len' filepath='base64.c' line='123' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_encode' mangled-name='spdk_base64_urlsafe_encode' filepath='base64.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_encode'>
      <parameter type-id='26a90f95' name='dst' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='b59d7dce' name='src_len' filepath='base64.c' line='129' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_decode' mangled-name='spdk_base64_decode' filepath='base64.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_decode'>
      <parameter type-id='eaa32e2f' name='dst' filepath='base64.c' line='232' column='1'/>
      <parameter type-id='78c01427' name='dst_len' filepath='base64.c' line='232' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='base64.c' line='232' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_decode' mangled-name='spdk_base64_urlsafe_decode' filepath='base64.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_decode'>
      <parameter type-id='eaa32e2f' name='dst' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='78c01427' name='dst_len' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='base64.c' line='242' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
  </abi-instr>
  <abi-instr address-size='64' path='bit_array.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <qualified-type-def type-id='cfe40fb1' const='yes' id='58a40d50'/>
    <pointer-type-def type-id='58a40d50' size-in-bits='64' id='0441370e'/>
    <qualified-type-def type-id='e7349382' const='yes' id='bce190f9'/>
    <pointer-type-def type-id='bce190f9' size-in-bits='64' id='2a16fc29'/>
    <pointer-type-def type-id='cfe40fb1' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='6ef42d89' size-in-bits='64' id='4d63d799'/>
    <pointer-type-def type-id='e7349382' size-in-bits='64' id='d5dec3d0'/>
    <pointer-type-def type-id='d5dec3d0' size-in-bits='64' id='a7ae828e'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' filepath='bit_array.c' line='24' column='1' is-declaration-only='yes' id='cfe40fb1'/>
    <function-decl name='spdk_bit_array_create' mangled-name='spdk_bit_array_create' filepath='bit_array.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_create'>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='30' column='1'/>
      <return type-id='6ef42d89'/>
    </function-decl>
    <function-decl name='spdk_bit_array_free' mangled-name='spdk_bit_array_free' filepath='bit_array.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_free'>
      <parameter type-id='4d63d799' name='bap' filepath='bit_array.c' line='40' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_resize' mangled-name='spdk_bit_array_resize' filepath='bit_array.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_resize'>
      <parameter type-id='4d63d799' name='bap' filepath='bit_array.c' line='67' column='1'/>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='67' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_capacity' mangled-name='spdk_bit_array_capacity' filepath='bit_array.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_capacity'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='131' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_get' mangled-name='spdk_bit_array_get' filepath='bit_array.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_get'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='151' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='151' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_array_set' mangled-name='spdk_bit_array_set' filepath='bit_array.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_set'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='163' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='163' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear' mangled-name='spdk_bit_array_clear' filepath='bit_array.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='176' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='176' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_set' mangled-name='spdk_bit_array_find_first_set' filepath='bit_array.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_set'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='229' column='1'/>
      <parameter type-id='8f92235e' name='start_bit_index' filepath='bit_array.c' line='229' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_clear' mangled-name='spdk_bit_array_find_first_clear' filepath='bit_array.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_clear'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='247' column='1'/>
      <parameter type-id='8f92235e' name='start_bit_index' filepath='bit_array.c' line='247' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_set' mangled-name='spdk_bit_array_count_set' filepath='bit_array.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_set'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='265' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_clear' mangled-name='spdk_bit_array_count_clear' filepath='bit_array.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_clear'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='283' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_store_mask' mangled-name='spdk_bit_array_store_mask' filepath='bit_array.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_store_mask'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='289' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='289' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_load_mask' mangled-name='spdk_bit_array_load_mask' filepath='bit_array.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_load_mask'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='307' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='307' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear_mask' mangled-name='spdk_bit_array_clear_mask' filepath='bit_array.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear_mask'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='325' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_bit_pool' is-struct='yes' visibility='default' filepath='bit_array.c' line='338' column='1' is-declaration-only='yes' id='e7349382'/>
    <function-decl name='spdk_bit_pool_create' mangled-name='spdk_bit_pool_create' filepath='bit_array.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create'>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='345' column='1'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_create_from_array' mangled-name='spdk_bit_pool_create_from_array' filepath='bit_array.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create_from_array'>
      <parameter type-id='6ef42d89' name='array' filepath='bit_array.c' line='369' column='1'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free' mangled-name='spdk_bit_pool_free' filepath='bit_array.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free'>
      <parameter type-id='a7ae828e' name='ppool' filepath='bit_array.c' line='386' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_resize' mangled-name='spdk_bit_pool_resize' filepath='bit_array.c' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_resize'>
      <parameter type-id='a7ae828e' name='ppool' filepath='bit_array.c' line='403' column='1'/>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='403' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_capacity' mangled-name='spdk_bit_pool_capacity' filepath='bit_array.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_capacity'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='423' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_is_allocated' mangled-name='spdk_bit_pool_is_allocated' filepath='bit_array.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_is_allocated'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='429' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='429' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_allocate_bit' mangled-name='spdk_bit_pool_allocate_bit' filepath='bit_array.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_allocate_bit'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='435' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_bit' mangled-name='spdk_bit_pool_free_bit' filepath='bit_array.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_bit'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='450' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='450' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_allocated' mangled-name='spdk_bit_pool_count_allocated' filepath='bit_array.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_allocated'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='462' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_free' mangled-name='spdk_bit_pool_count_free' filepath='bit_array.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_free'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='468' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_store_mask' mangled-name='spdk_bit_pool_store_mask' filepath='bit_array.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_store_mask'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='474' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='474' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_load_mask' mangled-name='spdk_bit_pool_load_mask' filepath='bit_array.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_load_mask'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='480' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='480' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_all_bits' mangled-name='spdk_bit_pool_free_all_bits' filepath='bit_array.c' line='488' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_all_bits'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='488' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cpuset.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' filepath='cpuset.h' line='25' column='1' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <qualified-type-def type-id='aec5215a' const='yes' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' id='75291c35'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' id='d5319498'/>
    <function-decl name='spdk_cpuset_alloc' mangled-name='spdk_cpuset_alloc' filepath='cpuset.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_alloc'>
      <return type-id='d5319498'/>
    </function-decl>
    <function-decl name='spdk_cpuset_free' mangled-name='spdk_cpuset_free' filepath='cpuset.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_free'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='16' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_equal' mangled-name='spdk_cpuset_equal' filepath='cpuset.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_equal'>
      <parameter type-id='75291c35' name='set1' filepath='cpuset.c' line='22' column='1'/>
      <parameter type-id='75291c35' name='set2' filepath='cpuset.c' line='22' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_copy' mangled-name='spdk_cpuset_copy' filepath='cpuset.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_copy'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='30' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='30' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_negate' mangled-name='spdk_cpuset_negate' filepath='cpuset.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_negate'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='38' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_and' mangled-name='spdk_cpuset_and' filepath='cpuset.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_and'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='48' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='48' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_or' mangled-name='spdk_cpuset_or' filepath='cpuset.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_or'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='59' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='59' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_xor' mangled-name='spdk_cpuset_xor' filepath='cpuset.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_xor'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='70' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='70' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_zero' mangled-name='spdk_cpuset_zero' filepath='cpuset.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_zero'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='81' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_set_cpu' mangled-name='spdk_cpuset_set_cpu' filepath='cpuset.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_set_cpu'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='88' column='1'/>
      <parameter type-id='8f92235e' name='cpu' filepath='cpuset.c' line='88' column='1'/>
      <parameter type-id='c894953d' name='state' filepath='cpuset.c' line='88' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_get_cpu' mangled-name='spdk_cpuset_get_cpu' filepath='cpuset.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_get_cpu'>
      <parameter type-id='75291c35' name='set' filepath='cpuset.c' line='100' column='1'/>
      <parameter type-id='8f92235e' name='cpu' filepath='cpuset.c' line='100' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_count' mangled-name='spdk_cpuset_count' filepath='cpuset.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_count'>
      <parameter type-id='75291c35' name='set' filepath='cpuset.c' line='108' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_cpuset_fmt' mangled-name='spdk_cpuset_fmt' filepath='cpuset.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_fmt'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='124' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_cpuset_parse' mangled-name='spdk_cpuset_parse' filepath='cpuset.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_parse'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='279' column='1'/>
      <parameter type-id='80f4b756' name='mask' filepath='cpuset.c' line='279' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc16.c' language='LANG_C11'>
    <typedef-decl name='__uint16_t' type-id='f0981eed' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <function-decl name='spdk_crc16_t10dif' mangled-name='spdk_crc16_t10dif' filepath='crc16.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif'>
      <parameter type-id='149c6638' name='init_crc' filepath='crc16.c' line='17' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc16.c' line='17' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc16.c' line='17' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_crc16_t10dif_copy' mangled-name='spdk_crc16_t10dif_copy' filepath='crc16.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif_copy'>
      <parameter type-id='149c6638' name='init_crc' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='ae3e8ca6' name='dst' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='ae3e8ca6' name='src' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc16.c' line='24' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32_ieee.c' language='LANG_C11'>
    <function-decl name='spdk_crc32_ieee_update' mangled-name='spdk_crc32_ieee_update' filepath='crc32_ieee.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32_ieee_update'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32_ieee.c' line='18' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32c.c' language='LANG_C11'>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <function-decl name='spdk_crc32c_update' mangled-name='spdk_crc32c_update' filepath='crc32c.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_update'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32c.c' line='13' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32c.c' line='13' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32c.c' line='13' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_crc32c_iov_update' mangled-name='spdk_crc32c_iov_update' filepath='crc32c.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_iov_update'>
      <parameter type-id='cc4b1be9' name='iov' filepath='crc32c.c' line='112' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='crc32c.c' line='112' column='1'/>
      <parameter type-id='8f92235e' name='crc32c' filepath='crc32c.c' line='112' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_crc32c_nvme' mangled-name='spdk_crc32c_nvme' filepath='crc32c.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_nvme'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32c.c' line='130' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32c.c' line='130' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32c.c' line='130' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc64.c' language='LANG_C11'>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <function-decl name='spdk_crc64_nvme' mangled-name='spdk_crc64_nvme' filepath='crc64.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc64_nvme'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc64.c' line='13' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc64.c' line='13' column='1'/>
      <parameter type-id='9c313c2d' name='crc' filepath='crc64.c' line='13' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dif.c' language='LANG_C11'>
    <enum-decl name='spdk_dif_type' filepath='dif.h' line='32' column='1' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_dif_ctx' size-in-bits='512' is-struct='yes' visibility='default' filepath='dif.h' line='60' column='1' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx_init_ext_opts' size-in-bits='128' is-struct='yes' visibility='default' filepath='dif.h' line='51' column='1' id='d3237ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dif.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dif_pi_format' type-id='8f92235e' visibility='default' filepath='dif.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_error' size-in-bits='256' is-struct='yes' visibility='default' filepath='dif.h' line='117' column='1' id='035f351a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='err_type' type-id='b96825af' visibility='default' filepath='dif.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expected' type-id='9c313c2d' visibility='default' filepath='dif.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='actual' type-id='9c313c2d' visibility='default' filepath='dif.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='err_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <qualified-type-def type-id='6e011169' const='yes' id='507bcddc'/>
    <pointer-type-def type-id='507bcddc' size-in-bits='64' id='a8e53a42'/>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <pointer-type-def type-id='d3237ae7' size-in-bits='64' id='343546bf'/>
    <pointer-type-def type-id='035f351a' size-in-bits='64' id='c7935638'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <function-decl name='spdk_dif_ctx_init' mangled-name='spdk_dif_ctx_init' filepath='dif.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_init'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='459' column='1'/>
      <parameter type-id='8f92235e' name='block_size' filepath='dif.c' line='459' column='1'/>
      <parameter type-id='8f92235e' name='md_size' filepath='dif.c' line='459' column='1'/>
      <parameter type-id='c894953d' name='md_interleave' filepath='dif.c' line='460' column='1'/>
      <parameter type-id='c894953d' name='dif_loc' filepath='dif.c' line='460' column='1'/>
      <parameter type-id='388e2dcf' name='dif_type' filepath='dif.c' line='460' column='1'/>
      <parameter type-id='8f92235e' name='dif_flags' filepath='dif.c' line='460' column='1'/>
      <parameter type-id='8f92235e' name='init_ref_tag' filepath='dif.c' line='461' column='1'/>
      <parameter type-id='149c6638' name='apptag_mask' filepath='dif.c' line='461' column='1'/>
      <parameter type-id='149c6638' name='app_tag' filepath='dif.c' line='461' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='462' column='1'/>
      <parameter type-id='9c313c2d' name='guard_seed' filepath='dif.c' line='462' column='1'/>
      <parameter type-id='343546bf' name='opts' filepath='dif.c' line='462' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_data_offset' mangled-name='spdk_dif_ctx_set_data_offset' filepath='dif.c' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_data_offset'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='526' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='526' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_remapped_init_ref_tag' mangled-name='spdk_dif_ctx_set_remapped_init_ref_tag' filepath='dif.c' line='541' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_remapped_init_ref_tag'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='541' column='1'/>
      <parameter type-id='8f92235e' name='remapped_init_ref_tag' filepath='dif.c' line='542' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_generate' mangled-name='spdk_dif_generate' filepath='dif.c' line='688' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='688' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='688' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='688' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='689' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify' mangled-name='spdk_dif_verify' filepath='dif.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='952' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='952' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='952' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='953' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='953' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c' mangled-name='spdk_dif_update_crc32c' filepath='dif.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1035' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1035' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1035' column='1'/>
      <parameter type-id='90421557' name='_crc32c' filepath='dif.c' line='1036' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1036' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_copy' mangled-name='spdk_dif_generate_copy' filepath='dif.c' line='1149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_copy'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1149' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1149' column='1'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs' filepath='dif.c' line='1149' column='1'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt' filepath='dif.c' line='1150' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1150' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1151' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_copy' mangled-name='spdk_dif_verify_copy' filepath='dif.c' line='1288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_copy'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1288' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1288' column='1'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs' filepath='dif.c' line='1288' column='1'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt' filepath='dif.c' line='1289' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1289' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1290' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='1291' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_inject_error' mangled-name='spdk_dif_inject_error' filepath='dif.c' line='1396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_inject_error'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1396' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1396' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1396' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1397' column='1'/>
      <parameter type-id='8f92235e' name='inject_flags' filepath='dif.c' line='1397' column='1'/>
      <parameter type-id='90421557' name='inject_offset' filepath='dif.c' line='1398' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_generate' mangled-name='spdk_dix_generate' filepath='dif.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_generate'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1542' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1542' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='1542' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1543' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1543' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_verify' mangled-name='spdk_dix_verify' filepath='dif.c' line='1662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_verify'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1662' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1662' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='1662' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1663' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1663' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='1664' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_inject_error' mangled-name='spdk_dix_inject_error' filepath='dif.c' line='1694' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_inject_error'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1694' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1694' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='1694' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1695' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1695' column='1'/>
      <parameter type-id='8f92235e' name='inject_flags' filepath='dif.c' line='1696' column='1'/>
      <parameter type-id='90421557' name='inject_offset' filepath='dif.c' line='1696' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_set_md_interleave_iovs' mangled-name='spdk_dif_set_md_interleave_iovs' filepath='dif.c' line='1773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_set_md_interleave_iovs'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1773' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1773' column='1'/>
      <parameter type-id='cc4b1be9' name='buf_iovs' filepath='dif.c' line='1774' column='1'/>
      <parameter type-id='95e97e5e' name='buf_iovcnt' filepath='dif.c' line='1774' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='1775' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='1775' column='1'/>
      <parameter type-id='90421557' name='_mapped_len' filepath='dif.c' line='1776' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1777' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_stream' mangled-name='spdk_dif_generate_stream' filepath='dif.c' line='1862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_stream'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1862' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1862' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='1863' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='1863' column='1'/>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='1864' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_stream' mangled-name='spdk_dif_verify_stream' filepath='dif.c' line='1906' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_stream'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1906' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1906' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='1907' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='1907' column='1'/>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='1908' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='1909' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c_stream' mangled-name='spdk_dif_update_crc32c_stream' filepath='dif.c' line='1955' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c_stream'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1955' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1955' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='1956' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='1956' column='1'/>
      <parameter type-id='90421557' name='_crc32c' filepath='dif.c' line='1957' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1957' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_get_range_with_md' mangled-name='spdk_dif_get_range_with_md' filepath='dif.c' line='1992' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_range_with_md'>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='1992' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='1992' column='1'/>
      <parameter type-id='90421557' name='_buf_offset' filepath='dif.c' line='1993' column='1'/>
      <parameter type-id='90421557' name='_buf_len' filepath='dif.c' line='1993' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1994' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_get_length_with_md' mangled-name='spdk_dif_get_length_with_md' filepath='dif.c' line='2021' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_length_with_md'>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2021' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2021' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_dif_remap_ref_tag' mangled-name='spdk_dif_remap_ref_tag' filepath='dif.c' line='2145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_remap_ref_tag'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2145' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2145' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2145' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2146' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2146' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_remap_ref_tag' mangled-name='spdk_dix_remap_ref_tag' filepath='dif.c' line='2263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_remap_ref_tag'>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='2263' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2263' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2264' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2265' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd.c' language='LANG_C11'>
    <function-decl name='spdk_fd_get_blocklen' mangled-name='spdk_fd_get_blocklen' filepath='fd.c' line='39' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_blocklen'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='39' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_fd_get_size' mangled-name='spdk_fd_get_size' filepath='fd.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_size'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='65' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd_group.c' language='LANG_C11'>
    <class-decl name='epoll_event' size-in-bits='96' is-struct='yes' visibility='default' filepath='epoll.h' line='84' column='1' id='7064bc4a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='events' type-id='8f92235e' visibility='default' filepath='epoll.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='86315334' visibility='default' filepath='epoll.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='epoll_data_t' type-id='c72ff3d7' filepath='epoll.h' line='82' column='1' id='86315334'/>
    <typedef-decl name='spdk_fd_fn' type-id='b9b212f5' filepath='fd_group.h' line='29' column='1' id='12d464a6'/>
    <union-decl name='epoll_data' size-in-bits='64' visibility='default' filepath='epoll.h' line='76' column='1' id='c72ff3d7'>
      <data-member access='public'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='epoll.h' line='78' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='epoll.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='8f92235e' visibility='default' filepath='epoll.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='9c313c2d' visibility='default' filepath='epoll.h' line='81' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='7064bc4a' size-in-bits='64' id='9da7f678'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='c8d12ece' size-in-bits='64' id='eb7a8954'/>
    <pointer-type-def type-id='eb7a8954' size-in-bits='64' id='2fe6715a'/>
    <class-decl name='spdk_fd_group' is-struct='yes' visibility='default' filepath='fd_group.c' line='48' column='1' is-declaration-only='yes' id='c8d12ece'/>
    <function-decl name='spdk_fd_group_get_fd' mangled-name='spdk_fd_group_get_fd' filepath='fd_group.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_fd'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='59' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_get_epoll_event' mangled-name='spdk_fd_group_get_epoll_event' filepath='fd_group.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_epoll_event'>
      <parameter type-id='9da7f678' name='event' filepath='fd_group.c' line='69' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_unnest' mangled-name='spdk_fd_group_unnest' filepath='fd_group.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_unnest'>
      <parameter type-id='eb7a8954' name='parent' filepath='fd_group.c' line='176' column='1'/>
      <parameter type-id='eb7a8954' name='child' filepath='fd_group.c' line='176' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_nest' mangled-name='spdk_fd_group_nest' filepath='fd_group.c' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_nest'>
      <parameter type-id='eb7a8954' name='parent' filepath='fd_group.c' line='199' column='1'/>
      <parameter type-id='eb7a8954' name='child' filepath='fd_group.c' line='199' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_add' mangled-name='spdk_fd_group_add' filepath='fd_group.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_add'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='228' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='228' column='1'/>
      <parameter type-id='12d464a6' name='fn' filepath='fd_group.c' line='228' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='fd_group.c' line='229' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='fd_group.c' line='229' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_remove' mangled-name='spdk_fd_group_remove' filepath='fd_group.c' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_remove'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='282' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='282' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_event_modify' mangled-name='spdk_fd_group_event_modify' filepath='fd_group.c' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_event_modify'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='333' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='334' column='1'/>
      <parameter type-id='95e97e5e' name='event_types' filepath='fd_group.c' line='334' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_create' mangled-name='spdk_fd_group_create' filepath='fd_group.c' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_create'>
      <parameter type-id='2fe6715a' name='_egrp' filepath='fd_group.c' line='371' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_destroy' mangled-name='spdk_fd_group_destroy' filepath='fd_group.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_destroy'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='400' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_wait' mangled-name='spdk_fd_group_wait' filepath='fd_group.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_wait'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='415' column='1'/>
      <parameter type-id='95e97e5e' name='timeout' filepath='fd_group.c' line='415' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='file.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eed' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_posix_file_load' mangled-name='spdk_posix_file_load' filepath='file.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_posix_file_load'>
      <parameter type-id='822cd80b' name='file' filepath='file.c' line='9' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='file.c' line='9' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hexlify.c' language='LANG_C11'>
    <function-decl name='spdk_hexlify' mangled-name='spdk_hexlify' filepath='hexlify.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_hexlify'>
      <parameter type-id='80f4b756' name='bin' filepath='hexlify.c' line='35' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='hexlify.c' line='35' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_unhexlify' mangled-name='spdk_unhexlify' filepath='hexlify.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unhexlify'>
      <parameter type-id='80f4b756' name='hex' filepath='hexlify.c' line='60' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='iov.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='7ba5bfe3' size-in-bits='640' id='0918d7f1'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7ba5bfe3' size-in-bits='unknown' id='c2430667'>
      <subrange length='unknown' lower-bound='0' upper-bound='-1' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <class-decl name='spdk_iov_xfer' size-in-bits='192' is-struct='yes' visibility='default' filepath='util.h' line='213' column='1' id='b1ac7456'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='util.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='util.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cur_iov_idx' type-id='95e97e5e' visibility='default' filepath='util.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cur_iov_offset' type-id='b59d7dce' visibility='default' filepath='util.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_ioviter' size-in-bits='704' is-struct='yes' visibility='default' filepath='util.h' line='123' column='1' id='cda159a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='8f92235e' visibility='default' filepath='util.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_single_ioviter' size-in-bits='320' is-struct='yes' visibility='default' filepath='util.h' line='110' column='1' id='7ba5bfe3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default' filepath='util.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='b59d7dce' visibility='default' filepath='util.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idx' type-id='b59d7dce' visibility='default' filepath='util.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='util.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iov_base' type-id='ae3e8ca6' visibility='default' filepath='util.h' line='115' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='640' is-anonymous='yes' visibility='default' filepath='util.h' line='126' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='iters_compat' type-id='0918d7f1' visibility='default' filepath='util.h' line='127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iters' type-id='c2430667' visibility='default' filepath='util.h' line='128' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='cc4b1be9' size-in-bits='64' id='5d3cb3f9'/>
    <pointer-type-def type-id='b1ac7456' size-in-bits='64' id='34d237dc'/>
    <pointer-type-def type-id='cda159a0' size-in-bits='64' id='949c74e6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <function-decl name='spdk_iov_memset' mangled-name='spdk_iov_memset' filepath='iov.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_memset'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='10' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='10' column='1'/>
      <parameter type-id='95e97e5e' name='c' filepath='iov.c' line='10' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iov_one' mangled-name='spdk_iov_one' filepath='iov.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_one'>
      <parameter type-id='cc4b1be9' name='iov' filepath='iov.c' line='25' column='1'/>
      <parameter type-id='7292109c' name='iovcnt' filepath='iov.c' line='25' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='25' column='1'/>
      <parameter type-id='b59d7dce' name='buflen' filepath='iov.c' line='25' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioviter_first' mangled-name='spdk_ioviter_first' filepath='iov.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_first'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='35' column='1'/>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='36' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='36' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='37' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='37' column='1'/>
      <parameter type-id='63e171df' name='src' filepath='iov.c' line='38' column='1'/>
      <parameter type-id='63e171df' name='dst' filepath='iov.c' line='38' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_firstv' mangled-name='spdk_ioviter_firstv' filepath='iov.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_firstv'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='62' column='1'/>
      <parameter type-id='8f92235e' name='count' filepath='iov.c' line='63' column='1'/>
      <parameter type-id='5d3cb3f9' name='iov' filepath='iov.c' line='64' column='1'/>
      <parameter type-id='78c01427' name='iovcnt' filepath='iov.c' line='65' column='1'/>
      <parameter type-id='63e171df' name='out' filepath='iov.c' line='66' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_next' mangled-name='spdk_ioviter_next' filepath='iov.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_next'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='86' column='1'/>
      <parameter type-id='63e171df' name='src' filepath='iov.c' line='86' column='1'/>
      <parameter type-id='63e171df' name='dst' filepath='iov.c' line='86' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_nextv' mangled-name='spdk_ioviter_nextv' filepath='iov.c' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_nextv'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='102' column='1'/>
      <parameter type-id='63e171df' name='out' filepath='iov.c' line='102' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iovcpy' mangled-name='spdk_iovcpy' filepath='iov.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iovcpy'>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='144' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='144' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='144' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='144' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iovmove' mangled-name='spdk_iovmove' filepath='iov.c' line='162' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iovmove'>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='162' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='162' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='162' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='162' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_init' mangled-name='spdk_iov_xfer_init' filepath='iov.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_init'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='180' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='180' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='180' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_from_buf' mangled-name='spdk_iov_xfer_from_buf' filepath='iov.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_from_buf'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='228' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='228' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='228' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_to_buf' mangled-name='spdk_iov_xfer_to_buf' filepath='iov.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_to_buf'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='234' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='234' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='234' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_copy_iovs_to_buf' mangled-name='spdk_copy_iovs_to_buf' filepath='iov.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_iovs_to_buf'>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='240' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='240' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='240' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='240' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_copy_buf_to_iovs' mangled-name='spdk_copy_buf_to_iovs' filepath='iov.c' line='249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_buf_to_iovs'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='249' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='249' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='249' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='249' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pipe.c' language='LANG_C11'>
    <pointer-type-def type-id='ab2deffc' size-in-bits='64' id='cc32297a'/>
    <class-decl name='spdk_pipe' is-struct='yes' visibility='default' filepath='pipe.c' line='9' column='1' is-declaration-only='yes' id='ab2deffc'/>
    <function-decl name='spdk_pipe_create' mangled-name='spdk_pipe_create' filepath='pipe.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_create'>
      <parameter type-id='eaa32e2f' name='buf' filepath='pipe.c' line='19' column='1'/>
      <parameter type-id='8f92235e' name='sz' filepath='pipe.c' line='19' column='1'/>
      <return type-id='cc32297a'/>
    </function-decl>
    <function-decl name='spdk_pipe_destroy' mangled-name='spdk_pipe_destroy' filepath='pipe.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_destroy'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='35' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_get_buffer' mangled-name='spdk_pipe_writer_get_buffer' filepath='pipe.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_get_buffer'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='41' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='41' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='pipe.c' line='41' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_advance' mangled-name='spdk_pipe_writer_advance' filepath='pipe.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_advance'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='86' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='86' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_bytes_available' mangled-name='spdk_pipe_reader_bytes_available' filepath='pipe.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_bytes_available'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='132' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_get_buffer' mangled-name='spdk_pipe_reader_get_buffer' filepath='pipe.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_get_buffer'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='150' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='150' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='pipe.c' line='150' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_advance' mangled-name='spdk_pipe_reader_advance' filepath='pipe.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_advance'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='193' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='193' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strerror_tls.c' language='LANG_C11'>
    <function-decl name='spdk_strerror' mangled-name='spdk_strerror' filepath='strerror_tls.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror'>
      <parameter type-id='95e97e5e' name='errnum' filepath='strerror_tls.c' line='11' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='string.c' language='LANG_C11'>
    <type-decl name='long long int' size-in-bits='64' id='95e97e60'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <pointer-type-def type-id='c894953d' size-in-bits='64' id='d8e6b335'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <function-decl name='spdk_vsprintf_append_realloc' mangled-name='spdk_vsprintf_append_realloc' filepath='string.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_append_realloc'>
      <parameter type-id='26a90f95' name='buffer' filepath='string.c' line='12' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='12' column='1'/>
      <parameter type-id='b7f2d5e6' name='args' filepath='string.c' line='12' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_append_realloc' mangled-name='spdk_sprintf_append_realloc' filepath='string.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_append_realloc'>
      <parameter type-id='26a90f95' name='buffer' filepath='string.c' line='44' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='44' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_vsprintf_alloc' mangled-name='spdk_vsprintf_alloc' filepath='string.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_alloc'>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='57' column='1'/>
      <parameter type-id='b7f2d5e6' name='args' filepath='string.c' line='57' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_alloc' mangled-name='spdk_sprintf_alloc' filepath='string.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_alloc'>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='63' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strlwr' mangled-name='spdk_strlwr' filepath='string.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlwr'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='76' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strsepq' mangled-name='spdk_strsepq' filepath='string.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strsepq'>
      <parameter type-id='9b23c9ad' name='stringp' filepath='string.c' line='94' column='1'/>
      <parameter type-id='80f4b756' name='delim' filepath='string.c' line='94' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_str_trim' mangled-name='spdk_str_trim' filepath='string.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_trim'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='159' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strcpy_pad' mangled-name='spdk_strcpy_pad' filepath='string.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strcpy_pad'>
      <parameter type-id='eaa32e2f' name='dst' filepath='string.c' line='193' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='string.c' line='193' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='193' column='1'/>
      <parameter type-id='95e97e5e' name='pad' filepath='string.c' line='193' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_strlen_pad' mangled-name='spdk_strlen_pad' filepath='string.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlen_pad'>
      <parameter type-id='eaa32e2f' name='str' filepath='string.c' line='207' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='207' column='1'/>
      <parameter type-id='95e97e5e' name='pad' filepath='string.c' line='207' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_parse_ip_addr' mangled-name='spdk_parse_ip_addr' filepath='string.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_ip_addr'>
      <parameter type-id='26a90f95' name='ip' filepath='string.c' line='235' column='1'/>
      <parameter type-id='9b23c9ad' name='host' filepath='string.c' line='235' column='1'/>
      <parameter type-id='9b23c9ad' name='port' filepath='string.c' line='235' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_str_chomp' mangled-name='spdk_str_chomp' filepath='string.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_chomp'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='291' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_strerror_r' mangled-name='spdk_strerror_r' filepath='string.c' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror_r'>
      <parameter type-id='95e97e5e' name='errnum' filepath='string.c' line='310' column='1'/>
      <parameter type-id='26a90f95' name='buf' filepath='string.c' line='310' column='1'/>
      <parameter type-id='b59d7dce' name='buflen' filepath='string.c' line='310' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_parse_capacity' mangled-name='spdk_parse_capacity' filepath='string.c' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_capacity'>
      <parameter type-id='80f4b756' name='cap_str' filepath='string.c' line='335' column='1'/>
      <parameter type-id='5d6479ae' name='cap' filepath='string.c' line='335' column='1'/>
      <parameter type-id='d8e6b335' name='has_prefix' filepath='string.c' line='335' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_all_zero' mangled-name='spdk_mem_all_zero' filepath='string.c' line='381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_all_zero'>
      <parameter type-id='eaa32e2f' name='data' filepath='string.c' line='381' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='381' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_strtol' mangled-name='spdk_strtol' filepath='string.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtol'>
      <parameter type-id='80f4b756' name='nptr' filepath='string.c' line='395' column='1'/>
      <parameter type-id='95e97e5e' name='base' filepath='string.c' line='395' column='1'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='spdk_strtoll' mangled-name='spdk_strtoll' filepath='string.c' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtoll'>
      <parameter type-id='80f4b756' name='nptr' filepath='string.c' line='426' column='1'/>
      <parameter type-id='95e97e5e' name='base' filepath='string.c' line='426' column='1'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='spdk_strarray_free' mangled-name='spdk_strarray_free' filepath='string.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_free'>
      <parameter type-id='9b23c9ad' name='strarray' filepath='string.c' line='457' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_strarray_from_string' mangled-name='spdk_strarray_from_string' filepath='string.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_from_string'>
      <parameter type-id='80f4b756' name='str' filepath='string.c' line='472' column='1'/>
      <parameter type-id='80f4b756' name='delim' filepath='string.c' line='472' column='1'/>
      <return type-id='9b23c9ad'/>
    </function-decl>
    <function-decl name='spdk_strarray_dup' mangled-name='spdk_strarray_dup' filepath='string.c' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_dup'>
      <parameter type-id='7d3cd834' name='strarray' filepath='string.c' line='526' column='1'/>
      <return type-id='9b23c9ad'/>
    </function-decl>
    <function-decl name='spdk_strcpy_replace' mangled-name='spdk_strcpy_replace' filepath='string.c' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strcpy_replace'>
      <parameter type-id='26a90f95' name='dst' filepath='string.c' line='553' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='search' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='replace' filepath='string.c' line='554' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
  </abi-instr>
  <abi-instr address-size='64' path='uuid.c' language='LANG_C11'>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' filepath='uuid.h' line='21' column='1' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab596' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='uuid.h' line='22' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='429c70d3' size-in-bits='64' id='69a99433'/>
    <function-decl name='spdk_uuid_parse' mangled-name='spdk_uuid_parse' filepath='uuid.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_parse'>
      <parameter type-id='69a99433' name='uuid' filepath='uuid.c' line='21' column='1'/>
      <parameter type-id='80f4b756' name='uuid_str' filepath='uuid.c' line='21' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_fmt_lower' mangled-name='spdk_uuid_fmt_lower' filepath='uuid.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_fmt_lower'>
      <parameter type-id='26a90f95' name='uuid_str' filepath='uuid.c' line='27' column='1'/>
      <parameter type-id='b59d7dce' name='uuid_str_size' filepath='uuid.c' line='27' column='1'/>
      <parameter type-id='c2482856' name='uuid' filepath='uuid.c' line='27' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_compare' mangled-name='spdk_uuid_compare' filepath='uuid.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_compare'>
      <parameter type-id='c2482856' name='u1' filepath='uuid.c' line='38' column='1'/>
      <parameter type-id='c2482856' name='u2' filepath='uuid.c' line='38' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_generate' mangled-name='spdk_uuid_generate' filepath='uuid.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_generate'>
      <parameter type-id='69a99433' name='uuid' filepath='uuid.c' line='44' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_uuid_copy' mangled-name='spdk_uuid_copy' filepath='uuid.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_copy'>
      <parameter type-id='69a99433' name='dst' filepath='uuid.c' line='50' column='1'/>
      <parameter type-id='c2482856' name='src' filepath='uuid.c' line='50' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_uuid_is_null' mangled-name='spdk_uuid_is_null' filepath='uuid.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_is_null'>
      <parameter type-id='c2482856' name='uuid' filepath='uuid.c' line='56' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_uuid_set_null' mangled-name='spdk_uuid_set_null' filepath='uuid.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_set_null'>
      <parameter type-id='69a99433' name='uuid' filepath='uuid.c' line='62' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
