<abi-corpus version='2.2' soname='libspdk_blob_bdev.so.10.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_thread.so.9.0'/>
    <dependency name='libspdk_bdev.so.14.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_create_bs_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_create_bs_dev_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_update_bs_blockcnt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_bdev_claim' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='blob_bdev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='spdk_bdev_event_type' filepath='bdev.h' line='41' column='1' id='3add6f5a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_EVENT_REMOVE' value='0'/>
      <enumerator name='SPDK_BDEV_EVENT_RESIZE' value='1'/>
      <enumerator name='SPDK_BDEV_EVENT_MEDIA_MANAGEMENT' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='__bdev_module_internal_fields' size-in-bits='576' is-struct='yes' visibility='default' filepath='bdev_module.h' line='148' column='1' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='bdev_module.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default' filepath='bdev_module.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='quiesced_ranges' type-id='e7f43f72' visibility='default' filepath='bdev_module.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default' filepath='bdev_module.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_bs_dev_opts' size-in-bits='64' is-struct='yes' visibility='default' filepath='blob_bdev.h' line='25' column='1' id='03105d44'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob_bdev.h' line='32' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_module' size-in-bits='1216' is-struct='yes' visibility='default' filepath='bdev_module.h' line='39' column='1' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default' filepath='bdev_module.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='953b12f8' visibility='default' filepath='bdev_module.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='eb9d423e' visibility='default' filepath='bdev_module.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='bdev_module.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='1db260e5' visibility='default' filepath='bdev_module.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='f1f36be0' visibility='default' filepath='bdev_module.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='f1f36be0' visibility='default' filepath='bdev_module.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default' filepath='bdev_module.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default' filepath='bdev_module.h' line='169' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='blob.h' line='163' column='1' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' size-in-bits='1216' is-struct='yes' visibility='default' filepath='blob.h' line='175' column='1' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='d013fa97' visibility='default' filepath='blob.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='264c8cbd' visibility='default' filepath='blob.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='21f143ce' visibility='default' filepath='blob.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='be92dbcf' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='be92dbcf' visibility='default' filepath='blob.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='6edb6746' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='6edb6746' visibility='default' filepath='blob.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='2ce17223' visibility='default' filepath='blob.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='1b27772b' visibility='default' filepath='blob.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='1b27772b' visibility='default' filepath='blob.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4c29f0d0' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='e52281d8' visibility='default' filepath='blob.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='translate_lba' type-id='f51a5171' visibility='default' filepath='blob.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='copy' type-id='57452971' visibility='default' filepath='blob.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_degraded' type-id='995c0ad0' visibility='default' filepath='blob.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='blob.h' line='153' column='1' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' size-in-bits='256' is-struct='yes' visibility='default' filepath='thread.h' line='941' column='1' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='942' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='944' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='945' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='946' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='166' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default' filepath='bdev_module.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default' filepath='bdev_module.h' line='166' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev_module.h' line='168' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default' filepath='bdev_module.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default' filepath='bdev_module.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eec' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' filepath='pthreadtypes.h' line='103' column='1' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eec' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_event_cb_t' type-id='dfce451f' filepath='bdev.h' line='74' column='1' id='3de10a34'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='6e11a86a' filepath='blob.h' line='118' column='1' id='7683f572'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eec'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' id='995c0ad0'/>
    <pointer-type-def type-id='9790a036' size-in-bits='64' id='e52281d8'/>
    <pointer-type-def type-id='58eb2595' size-in-bits='64' id='f51a5171'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='276427e1' size-in-bits='64' id='1db260e5'/>
    <pointer-type-def type-id='ad11f404' size-in-bits='64' id='eb9d423e'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' id='4c29f0d0'/>
    <pointer-type-def type-id='03105d44' size-in-bits='64' id='c34853f2'/>
    <pointer-type-def type-id='3384ef92' size-in-bits='64' id='b509a840'/>
    <pointer-type-def type-id='b509a840' size-in-bits='64' id='68341ede'/>
    <pointer-type-def type-id='3a1587ff' size-in-bits='64' id='e79cd027'/>
    <pointer-type-def type-id='c7372297' size-in-bits='64' id='44388ddf'/>
    <pointer-type-def type-id='44388ddf' size-in-bits='64' id='5a0778af'/>
    <pointer-type-def type-id='c0d240d3' size-in-bits='64' id='d8768e33'/>
    <pointer-type-def type-id='5f1f8343' size-in-bits='64' id='d013fa97'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='e46f9253' size-in-bits='64' id='dfce451f'/>
    <pointer-type-def type-id='ce3367a6' size-in-bits='64' id='f1f36be0'/>
    <pointer-type-def type-id='faef6e24' size-in-bits='64' id='21f143ce'/>
    <pointer-type-def type-id='d8775801' size-in-bits='64' id='264c8cbd'/>
    <pointer-type-def type-id='4c04e704' size-in-bits='64' id='6edb6746'/>
    <pointer-type-def type-id='86c9124e' size-in-bits='64' id='ea4a2620'/>
    <pointer-type-def type-id='aa39dfd7' size-in-bits='64' id='2ce17223'/>
    <pointer-type-def type-id='3bb59b8f' size-in-bits='64' id='1b27772b'/>
    <pointer-type-def type-id='29a81e35' size-in-bits='64' id='57452971'/>
    <pointer-type-def type-id='0d1c8e73' size-in-bits='64' id='be92dbcf'/>
    <pointer-type-def type-id='72d56e00' size-in-bits='64' id='6e11a86a'/>
    <qualified-type-def type-id='95e97e5e' volatile='yes' id='e024ff18'/>
    <pointer-type-def type-id='55c06e10' size-in-bits='64' id='65b579a6'/>
    <pointer-type-def type-id='65b579a6' size-in-bits='64' id='a8ae5764'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='2e6655e1' size-in-bits='64' id='e7041c49'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <class-decl name='lba_range' is-struct='yes' visibility='default' is-declaration-only='yes' id='55c06e10'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_spinlock_internal' is-struct='yes' visibility='default' is-declaration-only='yes' id='2e6655e1'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <function-decl name='spdk_bs_bdev_claim' mangled-name='spdk_bs_bdev_claim' filepath='blob_bdev.c' line='329' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_bdev_claim'>
      <parameter type-id='44388ddf' name='bs_dev' filepath='blob_bdev.c' line='329' column='1'/>
      <parameter type-id='b509a840' name='module' filepath='blob_bdev.c' line='329' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_update_bs_blockcnt' mangled-name='spdk_bdev_update_bs_blockcnt' filepath='blob_bdev.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_update_bs_blockcnt'>
      <parameter type-id='44388ddf' name='bs_dev' filepath='blob_bdev.c' line='486' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_create_bs_dev' mangled-name='spdk_bdev_create_bs_dev' filepath='blob_bdev.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_create_bs_dev'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='blob_bdev.c' line='495' column='1'/>
      <parameter type-id='c894953d' name='write' filepath='blob_bdev.c' line='495' column='1'/>
      <parameter type-id='c34853f2' name='opts' filepath='blob_bdev.c' line='496' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='blob_bdev.c' line='496' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='blob_bdev.c' line='497' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='blob_bdev.c' line='497' column='1'/>
      <parameter type-id='5a0778af' name='bs_dev' filepath='blob_bdev.c' line='498' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_create_bs_dev_ext' mangled-name='spdk_bdev_create_bs_dev_ext' filepath='blob_bdev.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_create_bs_dev_ext'>
      <parameter type-id='80f4b756' name='bdev_name' filepath='blob_bdev.c' line='535' column='1'/>
      <parameter type-id='3de10a34' name='event_cb' filepath='blob_bdev.c' line='535' column='1'/>
      <parameter type-id='eaa32e2f' name='event_ctx' filepath='blob_bdev.c' line='536' column='1'/>
      <parameter type-id='5a0778af' name='bs_dev' filepath='blob_bdev.c' line='536' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' id='a3780f1e'>
      <parameter type-id='44388ddf'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='58eb2595'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='9790a036'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='276427e1'>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ad11f404'>
      <parameter type-id='b8e14bfe'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='7f5edace'>
      <parameter type-id='44388ddf'/>
      <return type-id='7b7cfb3d'/>
    </function-type>
    <function-type size-in-bits='64' id='5f1f8343'>
      <parameter type-id='44388ddf'/>
      <return type-id='a7e01876'/>
    </function-type>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='e46f9253'>
      <parameter type-id='3add6f5a'/>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='ce3367a6'>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='faef6e24'>
      <parameter type-id='44388ddf'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='d8775801'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='4c04e704'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='86c9124e'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <parameter type-id='e79cd027'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='aa39dfd7'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='3bb59b8f'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='29a81e35'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0d1c8e73'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='72d56e00'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
