<abi-corpus version='2.2' soname='libspdk_blob.so.10.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libspdk_util.so.8.0'/>
    <dependency name='libspdk_thread.so.9.0'/>
    <dependency name='libspdk_dma.so.3.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_blob_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_clones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_esnap_bs_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_esnap_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_next_allocated_io_unit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_next_unallocated_io_unit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_num_clusters' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_bs_create_blob_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_create_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_create_snapshot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_delete_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_free_cluster_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_free_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_get_bstype' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_get_cluster_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_get_io_unit_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_get_page_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_get_super' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_grow' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_grow_live' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_inflate_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_iter_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_open_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_open_blob_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_set_bstype' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_set_super' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_total_data_cluster_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bs_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xattr_names_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xattr_names_get_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xattr_names_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='blobstore.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' id='ac1fa8c0'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='blob_clear_method' filepath='blob.h' line='48' column='1' id='6486fbcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BLOB_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='BLOB_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='BLOB_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='BLOB_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='bs_clear_method' filepath='blob.h' line='55' column='1' id='10cabe8b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BS_CLEAR_WITH_UNMAP' value='0'/>
      <enumerator name='BS_CLEAR_WITH_WRITE_ZEROES' value='1'/>
      <enumerator name='BS_CLEAR_WITH_NONE' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='blob.h' line='163' column='1' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_open_opts' size-in-bits='192' is-struct='yes' visibility='default' filepath='blob.h' line='776' column='1' id='27e387a7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='blob.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='esnap_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='791' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_opts' size-in-bits='640' is-struct='yes' visibility='default' filepath='blob.h' line='542' column='1' id='212067a2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_clusters' type-id='9c313c2d' visibility='default' filepath='blob.h' line='543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thin_provision' type-id='c894953d' visibility='default' filepath='blob.h' line='544' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='blob.h' line='545' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xattrs' type-id='eaa06656' visibility='default' filepath='blob.h' line='546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_extent_table' type-id='c894953d' visibility='default' filepath='blob.h' line='549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='esnap_id' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='esnap_id_len' type-id='9c313c2d' visibility='default' filepath='blob.h' line='573' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_xattr_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='blob.h' line='530' column='1' id='eaa06656'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='b59d7dce' visibility='default' filepath='blob.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='names' type-id='9b23c9ad' visibility='default' filepath='blob.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='536' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_value' type-id='5275033f' visibility='default' filepath='blob.h' line='538' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' size-in-bits='1216' is-struct='yes' visibility='default' filepath='blob.h' line='175' column='1' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='d013fa97' visibility='default' filepath='blob.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='264c8cbd' visibility='default' filepath='blob.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='21f143ce' visibility='default' filepath='blob.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='be92dbcf' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='be92dbcf' visibility='default' filepath='blob.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='6edb6746' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='6edb6746' visibility='default' filepath='blob.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='ea4a2620' visibility='default' filepath='blob.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='2ce17223' visibility='default' filepath='blob.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='1b27772b' visibility='default' filepath='blob.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='1b27772b' visibility='default' filepath='blob.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4c29f0d0' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='e52281d8' visibility='default' filepath='blob.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='translate_lba' type-id='f51a5171' visibility='default' filepath='blob.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='copy' type-id='57452971' visibility='default' filepath='blob.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='is_degraded' type-id='995c0ad0' visibility='default' filepath='blob.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='250' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' size-in-bits='192' is-struct='yes' visibility='default' filepath='blob.h' line='153' column='1' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_opts' size-in-bits='704' is-struct='yes' visibility='default' filepath='blob.h' line='257' column='1' id='d5816d4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default' filepath='blob.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_md_pages' type-id='8f92235e' visibility='default' filepath='blob.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_md_ops' type-id='8f92235e' visibility='default' filepath='blob.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_channel_ops' type-id='8f92235e' visibility='default' filepath='blob.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='clear_method' type-id='10cabe8b' visibility='default' filepath='blob.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bstype' type-id='2b310a38' visibility='default' filepath='blob.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='reserved36' type-id='d351502e' visibility='default' filepath='blob.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iter_cb_fn' type-id='cb1c4f44' visibility='default' filepath='blob.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iter_cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='force_recover' type-id='9c313c2d' visibility='default' filepath='blob.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='blob.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='esnap_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_type' size-in-bits='128' is-struct='yes' visibility='default' filepath='blob.h' line='253' column='1' id='2b310a38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bstype' type-id='ac1fa8c0' visibility='default' filepath='blob.h' line='254' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' filepath='blob.h' line='43' column='1' id='533eb244'/>
    <typedef-decl name='spdk_blob_op_complete' type-id='1ed1e4cd' filepath='blob.h' line='91' column='1' id='6531ee70'/>
    <typedef-decl name='spdk_blob_op_with_handle_complete' type-id='ab570e7b' filepath='blob.h' line='109' column='1' id='cb1c4f44'/>
    <typedef-decl name='spdk_blob_op_with_id_complete' type-id='f8a85803' filepath='blob.h' line='100' column='1' id='d1133f51'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='6e11a86a' filepath='blob.h' line='118' column='1' id='7683f572'/>
    <typedef-decl name='spdk_bs_dump_print_xattr' type-id='cb59045c' filepath='blob.h' line='361' column='1' id='7b4a763b'/>
    <typedef-decl name='spdk_bs_esnap_dev_create' type-id='0a322735' filepath='blob.h' line='149' column='1' id='63c64b6d'/>
    <typedef-decl name='spdk_bs_op_complete' type-id='1ed1e4cd' filepath='blob.h' line='73' column='1' id='0955aa0c'/>
    <typedef-decl name='spdk_bs_op_with_handle_complete' type-id='b67ddfa1' filepath='blob.h' line='82' column='1' id='9214bc90'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' id='995c0ad0'/>
    <pointer-type-def type-id='9790a036' size-in-bits='64' id='e52281d8'/>
    <pointer-type-def type-id='58eb2595' size-in-bits='64' id='f51a5171'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
