<abi-corpus version='2.2' soname='libspdk_dma.so.3.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.6.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_memory_domain_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_context' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_dma_device_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_dma_device_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_get_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_memzero' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_pull_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_push_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_memzero' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_pull' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_push' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_set_translation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_memory_domain_translate_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dma.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='spdk_dma_device_type' filepath='dma.h' line='26' column='1' id='26ce2e0f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_RDMA' value='0'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_DMA' value='1'/>
      <enumerator name='SPDK_DMA_DEVICE_TYPE_ACCEL' value='2'/>
      <enumerator name='SPDK_DMA_DEVICE_VENDOR_SPECIFIC_TYPE_START' value='1000'/>
      <enumerator name='SPDK_DMA_DEVICE_VENDOR_SPECIFIC_TYPE_END' value='1999'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_ctx' size-in-bits='128' is-struct='yes' visibility='default' filepath='dma.h' line='165' column='1' id='baa327a6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='dma.h' line='171' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_translation_ctx' size-in-bits='128' is-struct='yes' visibility='default' filepath='dma.h' line='129' column='1' id='9a027dfa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_memory_domain_translation_result' size-in-bits='448' is-struct='yes' visibility='default' filepath='dma.h' line='108' column='1' id='02f29580'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dma.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_count' type-id='8f92235e' visibility='default' filepath='dma.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='dma.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='dma.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dst_domain' type-id='e5ecc906' visibility='default' filepath='dma.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='dma.h' line='122' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lkey' type-id='8f92235e' visibility='default' filepath='dma.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rkey' type-id='8f92235e' visibility='default' filepath='dma.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='dma.h' line='133' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ibv_qp' type-id='eaa32e2f' visibility='default' filepath='dma.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='size_t' type-id='f0981eec' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_dma_device_type_t' type-id='26ce2e0f' filepath='dma.c' line='134' column='1' id='a130b758'/>
    <typedef-decl name='spdk_memory_domain_data_cpl_cb' type-id='1ed1e4cd' filepath='dma.h' line='53' column='1' id='de59bad4'/>
    <typedef-decl name='spdk_memory_domain_memzero_cb' type-id='1f5825d2' filepath='dma.h' line='105' column='1' id='23f1d9ff'/>
    <typedef-decl name='spdk_memory_domain_pull_data_cb' type-id='8b000850' filepath='dma.h' line='70' column='1' id='e64189f6'/>
    <typedef-decl name='spdk_memory_domain_push_data_cb' type-id='8b000850' filepath='dma.h' line='89' column='1' id='8e19cbfd'/>
    <typedef-decl name='spdk_memory_domain_translate_memory_cb' type-id='99342909' filepath='dma.h' line='152' column='1' id='8054d482'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='dma.h' line='121' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='rdma' type-id='e7f43f72' visibility='default' filepath='dma.h' line='125' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='dma.h' line='132' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='rdma' type-id='e7f43f73' visibility='default' filepath='dma.h' line='136' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eec'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='8144021e' size-in-bits='64' id='8b000850'/>
    <pointer-type-def type-id='a78d43c8' size-in-bits='64' id='1f5825d2'/>
    <pointer-type-def type-id='314ee1dd' size-in-bits='64' id='99342909'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='baa327a6' size-in-bits='64' id='c39a030c'/>
    <pointer-type-def type-id='9a027dfa' size-in-bits='64' id='c2c04d78'/>
    <pointer-type-def type-id='02f29580' size-in-bits='64' id='00eab8b6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' filepath='dma.c' line='14' column='1' is-declaration-only='yes' id='3e1ba880'/>
    <function-decl name='spdk_memory_domain_create' mangled-name='spdk_memory_domain_create' filepath='dma.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_create'>
      <parameter type-id='1fc0b044' name='_domain' filepath='dma.c' line='26' column='1'/>
      <parameter type-id='26ce2e0f' name='type' filepath='dma.c' line='26' column='1'/>
      <parameter type-id='c39a030c' name='ctx' filepath='dma.c' line='27' column='1'/>
      <parameter type-id='80f4b756' name='id' filepath='dma.c' line='27' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_set_translation' mangled-name='spdk_memory_domain_set_translation' filepath='dma.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_set_translation'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='82' column='1'/>
      <parameter type-id='8054d482' name='translate_cb' filepath='dma.c' line='83' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_set_pull' mangled-name='spdk_memory_domain_set_pull' filepath='dma.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_set_pull'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='93' column='1'/>
      <parameter type-id='e64189f6' name='pull_cb' filepath='dma.c' line='94' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_set_push' mangled-name='spdk_memory_domain_set_push' filepath='dma.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_set_push'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='104' column='1'/>
      <parameter type-id='8e19cbfd' name='push_cb' filepath='dma.c' line='105' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_set_memzero' mangled-name='spdk_memory_domain_set_memzero' filepath='dma.c' line='115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_set_memzero'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='115' column='1'/>
      <parameter type-id='23f1d9ff' name='memzero_cb' filepath='dma.c' line='116' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_get_context' mangled-name='spdk_memory_domain_get_context' filepath='dma.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_get_context'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='126' column='1'/>
      <return type-id='c39a030c'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_get_dma_device_type' mangled-name='spdk_memory_domain_get_dma_device_type' filepath='dma.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_get_dma_device_type'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='137' column='1'/>
      <return type-id='a130b758'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_get_dma_device_id' mangled-name='spdk_memory_domain_get_dma_device_id' filepath='dma.c' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_get_dma_device_id'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='145' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_destroy' mangled-name='spdk_memory_domain_destroy' filepath='dma.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_destroy'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='153' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_pull_data' mangled-name='spdk_memory_domain_pull_data' filepath='dma.c' line='169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_pull_data'>
      <parameter type-id='e5ecc906' name='src_domain' filepath='dma.c' line='169' column='1'/>
      <parameter type-id='eaa32e2f' name='src_domain_ctx' filepath='dma.c' line='169' column='1'/>
      <parameter type-id='cc4b1be9' name='src_iov' filepath='dma.c' line='170' column='1'/>
      <parameter type-id='8f92235e' name='src_iov_cnt' filepath='dma.c' line='170' column='1'/>
      <parameter type-id='cc4b1be9' name='dst_iov' filepath='dma.c' line='170' column='1'/>
      <parameter type-id='8f92235e' name='dst_iov_cnt' filepath='dma.c' line='170' column='1'/>
      <parameter type-id='de59bad4' name='cpl_cb' filepath='dma.c' line='171' column='1'/>
      <parameter type-id='eaa32e2f' name='cpl_cb_arg' filepath='dma.c' line='171' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_push_data' mangled-name='spdk_memory_domain_push_data' filepath='dma.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_push_data'>
      <parameter type-id='e5ecc906' name='dst_domain' filepath='dma.c' line='186' column='1'/>
      <parameter type-id='eaa32e2f' name='dst_domain_ctx' filepath='dma.c' line='186' column='1'/>
      <parameter type-id='cc4b1be9' name='dst_iov' filepath='dma.c' line='187' column='1'/>
      <parameter type-id='8f92235e' name='dst_iovcnt' filepath='dma.c' line='187' column='1'/>
      <parameter type-id='cc4b1be9' name='src_iov' filepath='dma.c' line='187' column='1'/>
      <parameter type-id='8f92235e' name='src_iovcnt' filepath='dma.c' line='187' column='1'/>
      <parameter type-id='de59bad4' name='cpl_cb' filepath='dma.c' line='188' column='1'/>
      <parameter type-id='eaa32e2f' name='cpl_cb_arg' filepath='dma.c' line='188' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_translate_data' mangled-name='spdk_memory_domain_translate_data' filepath='dma.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_translate_data'>
      <parameter type-id='e5ecc906' name='src_domain' filepath='dma.c' line='203' column='1'/>
      <parameter type-id='eaa32e2f' name='src_domain_ctx' filepath='dma.c' line='203' column='1'/>
      <parameter type-id='e5ecc906' name='dst_domain' filepath='dma.c' line='204' column='1'/>
      <parameter type-id='c2c04d78' name='dst_domain_ctx' filepath='dma.c' line='204' column='1'/>
      <parameter type-id='eaa32e2f' name='addr' filepath='dma.c' line='205' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='dma.c' line='205' column='1'/>
      <parameter type-id='00eab8b6' name='result' filepath='dma.c' line='205' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_memzero' mangled-name='spdk_memory_domain_memzero' filepath='dma.c' line='220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_memzero'>
      <parameter type-id='e5ecc906' name='domain' filepath='dma.c' line='220' column='1'/>
      <parameter type-id='eaa32e2f' name='domain_ctx' filepath='dma.c' line='220' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='dma.c' line='220' column='1'/>
      <parameter type-id='8f92235e' name='iovcnt' filepath='dma.c' line='221' column='1'/>
      <parameter type-id='de59bad4' name='cpl_cb' filepath='dma.c' line='221' column='1'/>
      <parameter type-id='eaa32e2f' name='cpl_cb_arg' filepath='dma.c' line='221' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_get_first' mangled-name='spdk_memory_domain_get_first' filepath='dma.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_get_first'>
      <parameter type-id='80f4b756' name='id' filepath='dma.c' line='235' column='1'/>
      <return type-id='e5ecc906'/>
    </function-decl>
    <function-decl name='spdk_memory_domain_get_next' mangled-name='spdk_memory_domain_get_next' filepath='dma.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_memory_domain_get_next'>
      <parameter type-id='e5ecc906' name='prev' filepath='dma.c' line='259' column='1'/>
      <parameter type-id='80f4b756' name='id' filepath='dma.c' line='259' column='1'/>
      <return type-id='e5ecc906'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' id='8144021e'>
      <parameter type-id='e5ecc906' name='dst_domain'/>
      <parameter type-id='eaa32e2f' name='dst_domain_ctx'/>
      <parameter type-id='cc4b1be9' name='dst_iov'/>
      <parameter type-id='8f92235e' name='dst_iovcnt'/>
      <parameter type-id='cc4b1be9' name='src_iov'/>
      <parameter type-id='8f92235e' name='src_iovcnt'/>
      <parameter type-id='de59bad4' name='cpl_cb'/>
      <parameter type-id='eaa32e2f' name='cpl_cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='a78d43c8'>
      <parameter type-id='e5ecc906' name='domain'/>
      <parameter type-id='eaa32e2f' name='domain_ctx'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='8f92235e' name='iovcnt'/>
      <parameter type-id='de59bad4' name='cpl_cb'/>
      <parameter type-id='eaa32e2f' name='cpl_cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='314ee1dd'>
      <parameter type-id='e5ecc906' name='src_domain'/>
      <parameter type-id='eaa32e2f' name='src_domain_ctx'/>
      <parameter type-id='e5ecc906' name='dst_domain'/>
      <parameter type-id='c2c04d78' name='dst_domain_ctx'/>
      <parameter type-id='eaa32e2f' name='addr'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='00eab8b6' name='result'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
