<abi-corpus version='2.4' soname='libspdk_nvmf.so.19.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_accel.so.16.0'/>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_sock.so.10.0'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libspdk_nvme.so.14.0'/>
    <dependency name='libspdk_thread.so.10.1'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.6.0'/>
    <dependency name='libspdk_trace.so.11.0'/>
    <dependency name='libspdk_bdev.so.16.0'/>
    <dependency name='libspdk_keyring.so.2.0'/>
    <dependency name='libspdk_rdma_provider.so.6.0'/>
    <dependency name='libspdk_rdma_utils.so.1.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_abort_cmd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_ctrlr_abort_aer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='EVP_sha256' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_sha384' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='RAND_bytes' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_dma_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_core_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_register' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_unregister' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get_bulk' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_lookup' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_put_bulk' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='auth.c' language='LANG_C11'>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
  </abi-instr>
  <abi-instr address-size='64' path='ctrlr.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' hash='6ed507bb73d52e47' id='ca634421'>
      <subrange length='224' lower-bound='0' upper-bound='223' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='13efbde50778ea2c' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' hash='3e9fefcb964ef6b4' id='16dc656a'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' hash='4b216217eb2844ff' id='12da2087'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' hash='e7f9696e246a3049' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' size-in-bits='32' alignment-in-bits='32' filepath='json.h' line='21' column='1' hash='4b975249c4c2bd4a' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_ana_state' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='3755' column='1' hash='206935ea64ede22c' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_async_event_info_error' size-in-bits='32' alignment-in-bits='32' filepath='nvme_spec.h' line='3648' column='1' hash='fb4139a95f676e07' id='93b0ae67'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_WRITE_INVALID_DB' value='0'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_INVALID_DB_WRITE' value='1'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_DIAGNOSTIC_FAILURE' value='2'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_PERSISTENT_INTERNAL' value='3'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_TRANSIENT_INTERNAL' value='4'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_FW_IMAGE_LOAD' value='5'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' size-in-bits='32' alignment-in-bits='32' filepath='nvme.h' line='429' column='1' hash='a773cdff5c729a70' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' size-in-bits='32' alignment-in-bits='32' filepath='nvmf_spec.h' line='116' column='1' hash='26614543a63ed59a' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' hash='7f2e925fbbd5f331' id='d0740e9b'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' hash='061dc5075fa0153c' id='3a071e7d'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4224' hash='2f064e270e6f3367' id='8caeb6eb'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7263f41a68bc1ea3' id='6a5934df'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#4' id='95e97e60'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b39d579c' size-in-bits='8192' hash='d453f37ce7717a47' id='08ba5752'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' hash='58e6b55d0796a605' id='bf64ebc5'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' is-struct='yes' visibility='default' size-in-bits='320' filepath='bdev.h' line='1980' column='1' hash='35379864373f4bb6' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='1982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx' is-struct='yes' visibility='default' size-in-bits='512' filepath='dif.h' line='64' column='1' hash='3fa86a99bcca3589' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer' is-struct='yes' visibility='default' size-in-bits='64' filepath='thread.h' line='1071' column='1' hash='efb1fa163f7c7507' id='9321bf74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stailq' type-id='e7f43f73' visibility='default' filepath='thread.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer_stailq_t' is-struct='yes' naming-typedef-id='306e7691' visibility='default' size-in-bits='128' filepath='thread.h' line='1076' column='1' hash='ab07a5bcfa5575e1' id='79110b08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='136d6f32' visibility='default' filepath='thread.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ad45e2c8' visibility='default' filepath='thread.h' line='1076' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_channel' is-struct='yes' visibility='default' size-in-bits='1280' filepath='thread.h' line='1096' column='1' hash='3dfc7a299c67b7ad' id='e8e2ad7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small' type-id='88eba988' visibility='default' filepath='thread.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='large' type-id='88eba988' visibility='default' filepath='thread.h' line='1100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='parent' type-id='a7e01876' visibility='default' filepath='thread.h' line='1104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' is-struct='yes' visibility='default' size-in-bits='192' filepath='thread.h' line='1065' column='1' hash='3823418d95fd487d' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default' filepath='thread.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f74' visibility='default' filepath='thread.h' line='1068' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry_stailq_t' is-struct='yes' naming-typedef-id='da6a25d9' visibility='default' size-in-bits='128' filepath='thread.h' line='1075' column='1' hash='8b3084943765eb88' id='ce92b0c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='29210180' visibility='default' filepath='thread.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='68f59e9e' visibility='default' filepath='thread.h' line='1075' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool' is-struct='yes' visibility='default' size-in-bits='576' filepath='thread.h' line='1078' column='1' hash='e9ba5c1a880ba87a' id='88eba988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='b2192338' visibility='default' filepath='thread.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='306e7691' visibility='default' filepath='thread.h' line='1082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cache_count' type-id='8f92235e' visibility='default' filepath='thread.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache_size' type-id='8f92235e' visibility='default' filepath='thread.h' line='1086' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue' type-id='49599bfc' visibility='default' filepath='thread.h' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufsize' type-id='8f92235e' visibility='default' filepath='thread.h' line='1090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='stats' type-id='adee513c' visibility='default' filepath='thread.h' line='1092' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool_stats' is-struct='yes' visibility='default' size-in-bits='192' filepath='thread.h' line='1045' column='1' hash='10641058b4271617' id='adee513c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cache' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='main' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='retry' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1051' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' is-struct='yes' visibility='default' size-in-bits='128' filepath='json.h' line='36' column='1' hash='8563d681b49b84d7' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2196' column='1' hash='625bfd40fd7a4ce6' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' is-struct='yes' visibility='default' size-in-bits='2048' filepath='nvme_spec.h' line='2101' column='1' hash='8881fab07f5b51bb' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f75' visibility='default' filepath='nvme_spec.h' line='2116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f76' visibility='default' filepath='nvme_spec.h' line='2126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default' filepath='nvme_spec.h' line='2128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2159' column='1' hash='d44d55926a6dbf9e' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' is-struct='yes' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2201' column='1' hash='9636b79acb9332bc' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='2146' column='1' hash='689f98af8f67664b' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' is-struct='yes' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2132' column='1' hash='806ee8c5d272ff30' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2142' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvme_spec.h' line='1380' column='1' hash='5391b474785ed5b0' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab595' visibility='default' filepath='nvme_spec.h' line='1406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvme_spec.h' line='1447' column='1' hash='94b2f9e83d5892a3' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvme_spec.h' line='2299' column='1' hash='9acd0c5b6825c66b' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default' filepath='nvme_spec.h' line='2309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default' filepath='nvme_spec.h' line='2312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default' filepath='nvme_spec.h' line='2315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f77' visibility='default' filepath='nvme_spec.h' line='2330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default' filepath='nvme_spec.h' line='2339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default' filepath='nvme_spec.h' line='2348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='627055da' visibility='default' filepath='nvme_spec.h' line='2351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default' filepath='nvme_spec.h' line='2365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default' filepath='nvme_spec.h' line='2367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f78' visibility='default' filepath='nvme_spec.h' line='2378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f79' visibility='default' filepath='nvme_spec.h' line='2387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f7a' visibility='default' filepath='nvme_spec.h' line='2398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvme_spec.h' line='2403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f7b' visibility='default' filepath='nvme_spec.h' line='2426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f7c' visibility='default' filepath='nvme_spec.h' line='2445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f7d' visibility='default' filepath='nvme_spec.h' line='2459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f7e' visibility='default' filepath='nvme_spec.h' line='2467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f7f' visibility='default' filepath='nvme_spec.h' line='2500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab59b' visibility='default' filepath='nvme_spec.h' line='2514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab59c' visibility='default' filepath='nvme_spec.h' line='2540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab59d' visibility='default' filepath='nvme_spec.h' line='2557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f80' visibility='default' filepath='nvme_spec.h' line='2584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default' filepath='nvme_spec.h' line='2597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default' filepath='nvme_spec.h' line='2603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvme_spec.h' line='2625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvme_spec.h' line='2628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f82' visibility='default' filepath='nvme_spec.h' line='2636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f83' visibility='default' filepath='nvme_spec.h' line='2643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f84' visibility='default' filepath='nvme_spec.h' line='2664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvme_spec.h' line='2667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default' filepath='nvme_spec.h' line='2678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvme_spec.h' line='2680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default' filepath='nvme_spec.h' line='2682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvme_spec.h' line='2684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default' filepath='nvme_spec.h' line='2687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default' filepath='nvme_spec.h' line='2690' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvme_spec.h' line='2775' column='1' hash='05ea5e9110495e41' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f85' visibility='default' filepath='nvme_spec.h' line='2803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f86' visibility='default' filepath='nvme_spec.h' line='2816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='2828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43f88' visibility='default' filepath='nvme_spec.h' line='2846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='2858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='2864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab59e' visibility='default' filepath='nvme_spec.h' line='2894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='2899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59f' visibility='default' filepath='nvme_spec.h' line='2928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2967' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2976' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default' filepath='nvme_spec.h' line='2978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='2990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='3002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default' filepath='nvme_spec.h' line='3016' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default' filepath='nvme_spec.h' line='3018' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' is-struct='yes' visibility='default' size-in-bits='256' filepath='nvme_spec.h' line='1965' column='1' hash='d4b0ba5202a5b2ae' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1972' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1998' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2002' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvme_spec.h' line='614' column='1' hash='215b19d231463b5a' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' is-struct='yes' visibility='default' size-in-bits='16' filepath='nvme_spec.h' line='1434' column='1' hash='fc053e45d751913c' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1440' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_tcp_transport_specific_address_subtype' is-struct='yes' visibility='default' size-in-bits='2048' filepath='nvmf_spec.h' line='362' column='1' hash='8f176a4e026b28d6' id='6d63b4d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sectype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='629227c2' visibility='default' filepath='nvmf_spec.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' is-struct='yes' visibility='default' size-in-bits='4512' filepath='nvme.h' line='485' column='1' hash='ed30d5448f2f7c82' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='530' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_capsule_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='25' column='1' hash='dc85787814397ef9' id='8c27fb80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fabric_specific' type-id='014804d6' visibility='default' filepath='nvmf_spec.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_data' is-struct='yes' visibility='default' size-in-bits='2240' filepath='nvmf_transport.h' line='242' column='1' hash='0d8e7444ff612213' id='76e51992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvmf_transport.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvmf_transport.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvmf_transport.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvmf_transport.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvmf_transport.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvmf_transport.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_feat' is-struct='yes' visibility='default' size-in-bits='320' filepath='nvmf_transport.h' line='589' column='1' hash='dc1465fe1bf532fd' id='a2cb797e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arbitration' type-id='9f1a58c0' visibility='default' filepath='nvmf_transport.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='power_management' type-id='64feb306' visibility='default' filepath='nvmf_transport.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error_recovery' type-id='af85b2af' visibility='default' filepath='nvmf_transport.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvmf_transport.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='number_of_queues' type-id='59e17753' visibility='default' filepath='nvmf_transport.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvmf_transport.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvmf_transport.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvmf_transport.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='async_event_configuration' type-id='8a1225db' visibility='default' filepath='nvmf_transport.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='keep_alive_timer' type-id='47966266' visibility='default' filepath='nvmf_transport.h' line='599' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_migr_data' is-struct='yes' visibility='default' size-in-bits='32768' filepath='nvmf_transport.h' line='609' column='1' hash='5c319d4ac430ce71' id='2b5c05b2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='regs_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='feat_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='regs' type-id='d5e31df6' visibility='default' filepath='nvmf_transport.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='regs_reserved' type-id='af0d923d' visibility='default' filepath='nvmf_transport.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='feat' type-id='a2cb797e' visibility='default' filepath='nvmf_transport.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='feat_reserved' type-id='af0d923d' visibility='default' filepath='nvmf_transport.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='acre' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='num_aer_cids' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='num_async_events' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='async_events' type-id='08ba5752' visibility='default' filepath='nvmf_transport.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='aer_cids' type-id='453ce391' visibility='default' filepath='nvmf_transport.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='notice_aen_mask' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='unused' type-id='7d6f480a' visibility='default' filepath='nvmf_transport.h' line='636' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_dif_info' is-struct='yes' visibility='default' size-in-bits='576' filepath='nvmf_transport.h' line='62' column='1' hash='eb02f8e8b99ce899' id='1e55cf88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dif_ctx' type-id='6e011169' visibility='default' filepath='nvmf_transport.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='elba_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='orig_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page_entry' is-struct='yes' visibility='default' size-in-bits='8192' filepath='nvmf_spec.h' line='389' column='1' hash='0721d145d71fe3c1' id='6b40ccf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='adrfam' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='treq' type-id='e7f43f8d' visibility='default' filepath='nvmf_spec.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='portid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='asqsz' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='eflags' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved0' type-id='013f0a7a' visibility='default' filepath='nvmf_spec.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trsvcid' type-id='d0f1c0cb' visibility='default' filepath='nvmf_spec.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reserved1' type-id='f3fa1b1a' visibility='default' filepath='nvmf_spec.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='traddr' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='tsas' type-id='e874a69d' visibility='default' filepath='nvmf_spec.h' line='433' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_auth_recv_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='167' column='1' hash='59de9311d0df907e' id='9a628dfe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='spsp0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='spsp1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='secp' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='al' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_auth_send_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='183' column='1' hash='c6c109b14bbb2282' id='5cf82640'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='spsp0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='spsp1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='secp' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tl' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='209' column='1' hash='b911d16567191585' id='8fb0506b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recfmt' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='qid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='sqsize' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='cattr' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='376'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved4' type-id='fa8ef949' visibility='default' filepath='nvmf_spec.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_rsp' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvmf_spec.h' line='226' column='1' hash='09da4256da995670' id='c9fa5b46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status_code_specific' type-id='ac5ab5a1' visibility='default' filepath='nvmf_spec.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved0' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvmf_spec.h' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='258' column='1' hash='4585132183cd6930' id='7876bfd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f8e' visibility='default' filepath='nvmf_spec.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved3' type-id='d3490169' visibility='default' filepath='nvmf_spec.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_rsp' is-struct='yes' visibility='default' size-in-bits='128' filepath='nvmf_spec.h' line='274' column='1' hash='472326809fbfbf72' id='d0bd555e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='ac5ab5a2' visibility='default' filepath='nvmf_spec.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvmf_spec.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_set_cmd' is-struct='yes' visibility='default' size-in-bits='512' filepath='nvmf_spec.h' line='290' column='1' hash='55673ec181c6a9ca' id='fd1dedf7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved1' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f8e' visibility='default' filepath='nvmf_spec.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved2' type-id='d3490169' visibility='default' filepath='nvmf_spec.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='value' type-id='ac5ab5a2' visibility='default' filepath='nvmf_spec.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reserved4' type-id='13339fda' visibility='default' filepath='nvmf_spec.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listen_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='nvmf.h' line='116' column='1' hash='680cc548161022f1' id='ac930882'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvmf.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default' filepath='nvmf.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='secure_channel' type-id='c894953d' visibility='default' filepath='nvmf.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='reserved1' type-id='d3490169' visibility='default' filepath='nvmf.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ana_state' type-id='78649e32' visibility='default' filepath='nvmf.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sock_impl' type-id='26a90f95' visibility='default' filepath='nvmf.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listener' is-struct='yes' visibility='default' size-in-bits='4736' filepath='nvmf_transport.h' line='232' column='1' hash='1aadb4df97086c48' id='d5c9cd10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trid' type-id='8712472c' visibility='default' filepath='nvmf_transport.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='ref' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='sock_impl' type-id='26a90f95' visibility='default' filepath='nvmf_transport.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='link' type-id='e7f43f8f' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group' is-struct='yes' visibility='default' size-in-bits='1408' filepath='nvmf_transport.h' line='200' column='1' hash='a37b08efaaeb8803' id='5f432901'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='nvmf_transport.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='nvmf_transport.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tgroups' type-id='e7f43f90' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sgroups' type-id='ae6a5885' visibility='default' filepath='nvmf_transport.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_sgroups' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='current_unassociated_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='qpairs' type-id='e7f43f91' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stat' type-id='cb344050' visibility='default' filepath='nvmf_transport.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='destroy_cb_fn' type-id='c58e4e5b' visibility='default' filepath='nvmf_transport.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destroy_cb_arg' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default' filepath='nvmf_transport.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='link' type-id='e7f43f92' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='nvmf_transport.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group_stat' is-struct='yes' visibility='default' size-in-bits='256' filepath='nvmf.h' line='163' column='1' hash='d8276e7ba8527f79' id='cb344050'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='admin_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_admin_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='current_io_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_bdev_io' type-id='9c313c2d' visibility='default' filepath='nvmf.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='completed_nvme_io' type-id='9c313c2d' visibility='default' filepath='nvmf.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_qpair' is-struct='yes' visibility='default' size-in-bits='896' filepath='nvmf_transport.h' line='146' column='1' hash='ea0dd80826e16990' id='407d526b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sq_head' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='sq_head_max' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctrlr' type-id='ba88e9a1' visibility='default' filepath='nvmf_transport.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='group' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab5a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='outstanding' type-id='e7f43f93' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='e7f43f94' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='state_cb' type-id='bafe66ec' visibility='default' filepath='nvmf_transport.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='state_cb_arg' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='connect_received' type-id='c894953d' visibility='default' filepath='nvmf_transport.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='disconnect_started' type-id='c894953d' visibility='default' filepath='nvmf_transport.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='trace_id' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='queue_depth' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='auth' type-id='9db48478' visibility='default' filepath='nvmf_transport.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='numa' type-id='e7f43f95' visibility='default' filepath='nvmf_transport.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_rdma_transport_specific_address_subtype' is-struct='yes' visibility='default' size-in-bits='2048' filepath='nvmf_spec.h' line='329' column='1' hash='3a145889205ba3f8' id='210ab761'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdma_qptype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rdma_prtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rdma_cms' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved0' type-id='0f4ddd0b' visibility='default' filepath='nvmf_spec.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rdma_pkey' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved2' type-id='d05e5752' visibility='default' filepath='nvmf_spec.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_registers' is-struct='yes' visibility='default' size-in-bits='320' filepath='nvmf_transport.h' line='528' column='1' hash='a0011899cface1a6' id='d5e31df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cap' type-id='007005ee' visibility='default' filepath='nvmf_transport.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vs' type-id='900beaa3' visibility='default' filepath='nvmf_transport.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cc' type-id='f0fcbcb4' visibility='default' filepath='nvmf_transport.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='csts' type-id='f62d2dc3' visibility='default' filepath='nvmf_transport.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='aqa' type-id='d22b9869' visibility='default' filepath='nvmf_transport.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='asq' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acq' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='535' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_request' is-struct='yes' visibility='default' size-in-bits='6464' filepath='nvmf_transport.h' line='82' column='1' hash='3181c99bd5119006' id='5507fe79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qpair' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='xfer' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='' type-id='ac5ab5a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='zcopy_phase' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='iovcnt' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cmd' type-id='b520ce9e' visibility='default' filepath='nvmf_transport.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rsp' type-id='adfda87a' visibility='default' filepath='nvmf_transport.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='buf_link' type-id='e7f43f96' visibility='default' filepath='nvmf_transport.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f97' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='nvmf_transport.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default' filepath='nvmf_transport.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default' filepath='nvmf_transport.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='stripped_data' type-id='edc76902' visibility='default' filepath='nvmf_transport.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='dif' type-id='1e55cf88' visibility='default' filepath='nvmf_transport.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default' filepath='nvmf_transport.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='cmd_cb_fn' type-id='e4580111' visibility='default' filepath='nvmf_transport.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='req_to_abort' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='nvmf_transport.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='zcopy_bdev_io' type-id='378e9c1c' visibility='default' filepath='nvmf_transport.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='iobuf' type-id='e7f43f98' visibility='default' filepath='nvmf_transport.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_stripped_data' is-struct='yes' visibility='default' size-in-bits='4288' filepath='nvmf_transport.h' line='68' column='1' hash='77d9c7c537757337' id='b954fee4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default' filepath='nvmf_transport.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport' is-struct='yes' visibility='default' size-in-bits='1600' filepath='nvmf_transport.h' line='264' column='1' hash='29be71ea184b90b4' id='d59a222d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default' filepath='nvmf_transport.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='2d76de85' visibility='default' filepath='nvmf_transport.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts' type-id='72315d04' visibility='default' filepath='nvmf_transport.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='iobuf_name' type-id='36c46961' visibility='default' filepath='nvmf_transport.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='listeners' type-id='e7f43f99' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='link' type-id='e7f43f9a' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='nvmf_transport.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_ops' is-struct='yes' visibility='default' size-in-bits='2304' filepath='nvmf_transport.h' line='279' column='1' hash='1387738423f25efe' id='c0085c66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='16dc656a' visibility='default' filepath='nvmf_transport.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='type' type-id='8cd337c8' visibility='default' filepath='nvmf_transport.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='opts_init' type-id='96537ed2' visibility='default' filepath='nvmf_transport.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='7a2d5f30' visibility='default' filepath='nvmf_transport.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='create_async' type-id='d5787c4d' visibility='default' filepath='nvmf_transport.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dump_opts' type-id='65bdbcd8' visibility='default' filepath='nvmf_transport.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='destroy' type-id='7c6ba5b4' visibility='default' filepath='nvmf_transport.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='listen' type-id='a7e379cf' visibility='default' filepath='nvmf_transport.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='listen_dump_opts' type-id='2e12477a' visibility='default' filepath='nvmf_transport.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='stop_listen' type-id='6dc39a1f' visibility='default' filepath='nvmf_transport.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='listen_associate' type-id='cddbb3ef' visibility='default' filepath='nvmf_transport.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='subsystem_add_ns' type-id='63a3ddf5' visibility='default' filepath='nvmf_transport.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='subsystem_remove_ns' type-id='7eb7018e' visibility='default' filepath='nvmf_transport.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cdata_init' type-id='6b20267e' visibility='default' filepath='nvmf_transport.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listener_discover' type-id='b19d8c2b' visibility='default' filepath='nvmf_transport.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='poll_group_create' type-id='d3c3c297' visibility='default' filepath='nvmf_transport.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_optimal_poll_group' type-id='377e574f' visibility='default' filepath='nvmf_transport.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='poll_group_destroy' type-id='87356ebd' visibility='default' filepath='nvmf_transport.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='poll_group_add' type-id='80c28738' visibility='default' filepath='nvmf_transport.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='poll_group_remove' type-id='80c28738' visibility='default' filepath='nvmf_transport.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='poll_group_poll' type-id='256f01de' visibility='default' filepath='nvmf_transport.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='req_free' type-id='49c57a50' visibility='default' filepath='nvmf_transport.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='req_complete' type-id='49c57a50' visibility='default' filepath='nvmf_transport.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='req_get_buffers_done' type-id='9adf71f5' visibility='default' filepath='nvmf_transport.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='qpair_fini' type-id='7952c0d2' visibility='default' filepath='nvmf_transport.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='qpair_get_peer_trid' type-id='da81fdb7' visibility='default' filepath='nvmf_transport.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='qpair_get_local_trid' type-id='da81fdb7' visibility='default' filepath='nvmf_transport.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='qpair_get_listen_trid' type-id='da81fdb7' visibility='default' filepath='nvmf_transport.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='qpair_abort_request' type-id='0a92b98f' visibility='default' filepath='nvmf_transport.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='poll_group_dump_stat' type-id='e89eedcc' visibility='default' filepath='nvmf_transport.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='subsystem_add_host' type-id='4322b07a' visibility='default' filepath='nvmf_transport.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='subsystem_remove_host' type-id='b91d5909' visibility='default' filepath='nvmf_transport.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='subsystem_dump_host' type-id='17667570' visibility='default' filepath='nvmf_transport.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_opts' is-struct='yes' visibility='default' size-in-bits='576' filepath='nvmf.h' line='68' column='1' hash='25f0f37fee35f92b' id='72315d04'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_queue_depth' type-id='149c6638' visibility='default' filepath='nvmf.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_qpairs_per_ctrlr' type-id='149c6638' visibility='default' filepath='nvmf.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='in_capsule_data_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_io_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='io_unit_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_aq_depth' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_shared_buffers' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dif_insert_or_strip' type-id='c894953d' visibility='default' filepath='nvmf.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='disable_command_passthru' type-id='c894953d' visibility='default' filepath='nvmf.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='reserved30' type-id='0f4b9e74' visibility='default' filepath='nvmf.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='abort_timeout_sec' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='association_timeout' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default' filepath='nvmf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvmf.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='acceptor_poll_rate' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default' filepath='nvmf.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='reserved61' type-id='d3490169' visibility='default' filepath='nvmf.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ack_timeout' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='data_wr_pool_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_poll_group' is-struct='yes' visibility='default' size-in-bits='448' filepath='nvmf_transport.h' line='191' column='1' hash='c44d65a486406972' id='824683eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='transport' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_buf_queue' type-id='e7f43f9b' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache' type-id='f905ec5d' visibility='default' filepath='nvmf_transport.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='group' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f9c' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='bdev.h' line='1984' column='1' hash='1d6be5d923ee5c29#3' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='thread.h' line='1072' column='1' hash='847a447b977d48b2#4' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='136d6f32' visibility='default' filepath='thread.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='nvmf_transport.h' line='123' column='1' hash='8cf128f6d424492d#5' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='71e32ba2' visibility='default' filepath='nvmf_transport.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='remaining_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='thread.h' line='1068' column='1' hash='9d88403e96580dfc#6' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default' filepath='thread.h' line='1068' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='884' column='1' hash='c003390e9270da18#7' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='893' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='236' column='1' hash='d76fb449e18f666e#8' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='28c64746' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9c226f04' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='271' column='1' hash='301d74755739be9c#9' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='28c64746' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9c226f04' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='227' column='1' hash='e7d7f116f4dc8256#10' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='80aeb479' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='163' column='1' hash='a5ba57a55aa95a14#11' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8af4e883' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='217' column='1' hash='f18901b8981b19d1#12' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='8af4e883' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvmf_transport.h' line='99' column='1' hash='5fbf92503ed3d492#13' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='194' column='1' hash='f05e805ed43d2f1a#14' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__75' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='100' column='1' hash='ab48992780f79f22#15' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='162' column='1' hash='1f0a78b29bf1c775#16' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='272' column='1' hash='fed508a54550c2ba#17' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='bbd73f95' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='197' column='1' hash='9a6f2bc7f10dc2c2#18' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='264c437b' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9b0df883' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvmf_transport.h' line='204' column='1' hash='091894eb265ac5b7#19' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='264c437b' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9b0df883' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__71' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvmf_spec.h' line='228' column='1' hash='32bf3abd9f36184e#20' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='authreq' type-id='e7f43f9f' visibility='default' filepath='nvmf_spec.h' line='235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__97' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2661' column='1' hash='9767bffa0f8777ea#21' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2663' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2122' column='1' hash='b17c4aa2d8ef21ad#22' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvmf_spec.h' line='238' column='1' hash='bf097e5254e2496b#23' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipo' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iattr' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__72' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvmf_spec.h' line='230' column='1' hash='b85c42c82617d279#24' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='atr' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ascr' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='234' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__90' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2536' column='1' hash='0b48f1d97617debb#25' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2538' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='699' column='1' hash='548fe5eb1a049464#26' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='712' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__112' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='194' column='1' hash='3c2095b20150c470#27' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='asqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='acqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='203' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__113' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='3717' column='1' hash='ed4d5be0234c49af#28' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='async_event_type' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='async_event_info' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='log_page_identifier' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1092' column='1' hash='8feb1434fa7a9734#29' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1097' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__91' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2551' column='1' hash='785236a11693d5b2#30' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2555' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='856' column='1' hash='ad5db448c44eb1fb#31' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='860' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1249' column='1' hash='8199c8f4e6f677b2#32' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__66' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1370' column='1' hash='db2edd28cd5ec2c2#33' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dsm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1375' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1265' column='1' hash='fe2509516d8ecd30#34' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__110' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='129' column='1' hash='e03f6aa13d924c69#35' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1038' column='1' hash='3756f1ce18a8e2bd#36' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1041' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='992' column='1' hash='725513e69f184d20#37' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='996' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1051' column='1' hash='fb350fe9dce3eee7#38' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1057' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1082' column='1' hash='d7b5e6e248de3766#39' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1085' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1150' column='1' hash='239cebb925f40526#40' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1142' column='1' hash='7806a3c015202516#41' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__80' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2240' column='1' hash='73bab5495637871e#42' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2294' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvmf_transport.h' line='178' column='1' hash='09196fc492c86f85#43' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id_valid' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='id' type-id='3ff5601b' visibility='default' filepath='nvmf_transport.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1289' column='1' hash='66b466dc71d4538d#44' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='838' column='1' hash='ad35623b1f5cc13e#45' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='935' column='1' hash='ee77dca2c333c6ec#46' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='937' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='623' column='1' hash='a45795c19710272d#47' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1100' column='1' hash='279ac4d514f56a2a#48' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__70' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvmf_spec.h' line='277' column='1' hash='96168c205a79f4e1#49' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='low' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='high' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='279' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1208' column='1' hash='0af01c7b07646770#50' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__109' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='63' column='1' hash='90940cd50741059a#51' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='cmbs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__108' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='3005' column='1' hash='ad6873c62e1736a6#52' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3015' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43fbb' size-in-bits='2048' hash='198b5a7e4ddaacc3' id='93b898c4'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='b10be967'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__61' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1304' column='1' hash='95c154f9396afd9b#53' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1344' column='1' hash='6a6667d200647dbf#54' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='deac' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1323' column='1' hash='2eb288a02832e7b3#55' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1170' column='1' hash='9b10d28a122b47b8#56' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='806' column='1' hash='e79721de7c7902a8#57' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1118' column='1' hash='69d726b7e707ff5c#58' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='741' column='1' hash='6ca700154011a93f#59' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='745' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1258' column='1' hash='8fa8dd0dd6da05dd#60' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1221' column='1' hash='79f4ba2c78b21195#61' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1239' column='1' hash='060e7c2365604933#62' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1246' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1229' column='1' hash='30839990af78bd5b#63' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1067' column='1' hash='7c6ba9817ee43b85#64' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='724' column='1' hash='44d52284d00b720c#65' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1025' column='1' hash='472e59b041146dba#66' id='e7f43fc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1028' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1129' column='1' hash='1f720e9494b326d7#67' id='e7f43fca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1136' column='1' hash='c6400045f70b8a0d#68' id='e7f43fcb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1197' column='1' hash='a554a88dd14d33a5#69' id='e7f43fcc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__111' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='165' column='1' hash='6f81b8f60dce81bd#70' id='e7f43fcd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1006' column='1' hash='cfd0a567e075c925#72' id='e7f43fce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1014' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1176' column='1' hash='8647d62f3d0684a1#73' id='e7f43fcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1186' column='1' hash='b355179652e4699e#74' id='e7f43fd0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1158' column='1' hash='fc2ac53ee69a6ce7#75' id='e7f43fd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1111' column='1' hash='6c4054f7320227d6#76' id='e7f43fd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__79' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='210' column='1' hash='5f9ccc305444347b#77' id='e7f43fd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='821' column='1' hash='992874cbdd060d67#78' id='e7f43fd4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='775' column='1' hash='c497d77219075caf#79' id='e7f43fd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='755' column='1' hash='e261fc93549fb3a4#80' id='e7f43fd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='792' column='1' hash='aac10391fdd2048d#81' id='e7f43fd7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='630' column='1' hash='6c41b1621790411f#82' id='e7f43fd8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='634' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1400' column='1' hash='ba6fe5fc0b0982e5#83' id='e7f43fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__92' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2575' column='1' hash='789bb739e46bef15#86' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2583' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='868' column='1' hash='6a6041472ff1c837#87' id='e7f43fda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='874' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__103' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2861' column='1' hash='30b4a6364240ed1e#88' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2863' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2112' column='1' hash='6b85fcea99adfce3#89' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvmf_transport.h' line='88' column='1' hash='58f13fed5a8fa49a#90' id='e7f43fdb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_from_pool' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='dif_enabled' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='first_fused' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rsvd' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__100' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2819' column='1' hash='b8a4691d449aaa0d#91' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2827' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__99' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2809' column='1' hash='58bd387a5fee80fb#92' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__95' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2631' column='1' hash='ab73cb5f5cff5e86#93' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2635' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__93' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2608' column='1' hash='05d436016e8653a4#94' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__78' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2324' column='1' hash='558047c0c94b3f28#95' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__85' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2429' column='1' hash='9d2f75ab41d6cf8b#96' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2444' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__88' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2491' column='1' hash='e937dff58185f4fd#97' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2499' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__81' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2370' column='1' hash='8d09c5c84ddbd595#98' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2377' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__89' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2508' column='1' hash='ffb4a09ce9c4044a#100' id='e7f43fdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__105' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2896' column='1' hash='3c3312d54c61beb5#101' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2898' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__104' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2868' column='1' hash='70ae345752cf7e77#102' id='e7f43fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2891' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__101' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2831' column='1' hash='f978528019698af6#103' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__102' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2849' column='1' hash='7c5110f2bc87bbde#104' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2857' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__96' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2639' column='1' hash='c508a2d20acfeec2#105' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2642' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__106' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2904' column='1' hash='f28912e6d6efcdc7#106' id='e7f43fde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2926' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='617' column='1' hash='0ca125c4c4058b5d#107' id='e7f43fdf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvmf_spec.h' line='400' column='1' hash='7fc4d16f70ac36dc#108' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secure_channel' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__69' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvmf_spec.h' line='264' column='1' hash='cf3764903fcc761b#109' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='266' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__84' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2412' column='1' hash='3da67497a3287303#110' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__83' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2390' column='1' hash='b843dcadb9b50e2c#111' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2397' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__86' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2454' column='1' hash='4be39c871050f7c9#112' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2458' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__87' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2462' column='1' hash='0f2dc76781d19391#113' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2466' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__98' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2786' column='1' hash='d40cc61d5f8865a9#114' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2802' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__82' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2381' column='1' hash='26d11d28096cad73#115' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2386' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__107' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2986' column='1' hash='7e554c90841cac2e#116' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2989' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' size-in-bits='8' filepath='types.h' line='37' column='1' hash='3c595c3350588f18' id='2171a512'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' size-in-bits='128' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' size-in-bits='8' filepath='stdint-intn.h' line='24' column='1' hash='3c595c3350588f18' id='ee31ee44'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' size-in-bits='320' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='61359e15' size-in-bits='64' filepath='bdev.h' line='1975' column='1' hash='fd7a63c0c6c822c4' id='065af103'/>
    <typedef-decl name='spdk_iobuf_buffer_stailq_t' type-id='79110b08' size-in-bits='128' filepath='thread.h' line='1076' column='1' id='306e7691'/>
    <typedef-decl name='spdk_iobuf_entry_stailq_t' type-id='ce92b0c6' size-in-bits='128' filepath='thread.h' line='1075' column='1' id='da6a25d9'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='86c1c05e' size-in-bits='64' filepath='thread.h' line='1062' column='1' hash='fd7a63c0c6c822c4' id='8b006695'/>
    <typedef-decl name='spdk_nvmf_custom_cmd_hdlr' type-id='49c57a50' size-in-bits='64' filepath='nvmf_cmd.h' line='110' column='1' hash='fd7a63c0c6c822c4' id='04b256a8'/>
    <typedef-decl name='spdk_nvmf_nvme_passthru_cmd_cb' type-id='9adf71f5' size-in-bits='64' filepath='nvmf_cmd.h' line='139' column='1' hash='fd7a63c0c6c822c4' id='e4580111'/>
    <typedef-decl name='spdk_nvmf_poll_group_destroy_done_fn' type-id='82328a76' size-in-bits='64' filepath='nvmf.h' line='338' column='1' hash='fd7a63c0c6c822c4' id='c58e4e5b'/>
    <typedef-decl name='spdk_nvmf_state_change_done' type-id='82328a76' size-in-bits='64' filepath='nvmf_transport.h' line='142' column='1' hash='fd7a63c0c6c822c4' id='bafe66ec'/>
    <typedef-decl name='spdk_nvmf_transport_create_done_cb' type-id='c9474215' size-in-bits='64' filepath='nvmf.h' line='1297' column='1' hash='fd7a63c0c6c822c4' id='f5dcf84c'/>
    <typedef-decl name='spdk_nvmf_transport_destroy_done_cb' type-id='61359e15' size-in-bits='64' filepath='nvmf.h' line='1318' column='1' hash='fd7a63c0c6c822c4' id='4d534154'/>
    <typedef-decl name='spdk_nvmf_transport_qpair_fini_cb' type-id='61359e15' size-in-bits='64' filepath='nvmf_transport.h' line='277' column='1' hash='fd7a63c0c6c822c4' id='f3756df1'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' hash='2acba3b681188244' id='45439f56'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='64' hash='8707aef8854fa124' id='453ce391'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' hash='cedf16acf4bd1010' id='c1c22e6c'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' hash='56b33b5cd7037af7' id='25518ee9'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' hash='1ffdb83e6e1680f3' id='b68a110f'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='4e72a2f569b234f4' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' hash='00d2c90e49260374' id='1acf0601'>
      <subrange length='119' lower-bound='0' upper-bound='118' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='bfff208dfbbd4720' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' hash='63976325609d9c03' id='ba8c55f2'>
      <subrange length='11' lower-bound='0' upper-bound='10' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7d831a267d1aafe8' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='96' hash='31346be1b5e0a4ba' id='fa8ef949'>
      <subrange length='12' lower-bound='0' upper-bound='11' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='236058707b75e5fc' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1536' hash='8f05ab547ef8bc69' id='f3fa1b1a'>
      <subrange length='192' lower-bound='0' upper-bound='191' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='a3f0e81e3727b2ed' id='3fea28a9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='152' hash='8d06a13882bccc5c' id='ba78ce3a'>
      <subrange length='19' lower-bound='0' upper-bound='18' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7545b01b1bd22246' id='448ee30f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' hash='0b225993f94fc7d7' id='d8dd2858'>
      <subrange length='204' lower-bound='0' upper-bound='203' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='70023e1b992c93d1' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='160' hash='814d1b11e0ce8923' id='013f0a7a'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1728' hash='d44345ad38b5aa4e' id='af0d923d'>
      <subrange length='216' lower-bound='0' upper-bound='215' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='41ad770c08c29a52' id='83ad04be'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' hash='2b510ff88d82681e' id='90687fee'>
      <subrange length='242' lower-bound='0' upper-bound='241' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='adc3967ae8d6d19f' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1968' hash='ce90a03bb52efd2b' id='d05e5752'>
      <subrange length='246' lower-bound='0' upper-bound='245' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='27679925b63152ee' id='ca576a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' hash='37cfa4b2655e8904' id='014804d6'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='20128' hash='a82c44cb8502814c' id='7d6f480a'>
      <subrange length='2516' lower-bound='0' upper-bound='2515' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e1cd21a738b1b51' id='2e214a33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2040' hash='b677e72cafe08d9c' id='629227c2'>
      <subrange length='255' lower-bound='0' upper-bound='254' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='32d21d641e8f81a1' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' hash='e6dda4fc6d697382' id='62946659'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' hash='92399eb84731c3e2' id='0f4b9e74'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' hash='037c09e5626cce93' id='d0f1c0cb'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='280' hash='14a661b4de2993e2' id='d0ef8234'>
      <subrange length='35' lower-bound='0' upper-bound='34' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='81627a4365755e9e' id='6e6845b5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' hash='4c697ddd27f47a1b' id='74b3417b'>
      <subrange length='3712' lower-bound='0' upper-bound='3711' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eb20c0b5952f62d3' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' hash='87dcd7386226cc55' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' hash='43eeb328ea84a499' id='be0fa24b'>
      <subrange length='768' lower-bound='0' upper-bound='767' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='ee5e6385becf0897' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' hash='24c833a0e6bde8ce' id='13339fda'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' hash='f457ac50d169e89c' id='cf30f637'>
      <subrange length='9' lower-bound='0' upper-bound='8' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='34fc5cd709b37f15' id='12e4273c'/>
    </array-type-def>
    <union-decl name='nvmf_c2h_msg' visibility='default' size-in-bits='128' filepath='nvmf_transport.h' line='55' column='1' hash='47f1d2da771356d2' id='1727cb29'>
      <data-member access='public'>
        <var-decl name='nvme_cpl' type-id='72b49d60' visibility='default' filepath='nvmf_transport.h' line='56' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_rsp' type-id='d0bd555e' visibility='default' filepath='nvmf_transport.h' line='57' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_rsp' type-id='c9fa5b46' visibility='default' filepath='nvmf_transport.h' line='58' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='nvmf_h2c_msg' visibility='default' size-in-bits='512' filepath='nvmf_transport.h' line='44' column='1' hash='b816138986a49daa' id='b4148a2d'>
      <data-member access='public'>
        <var-decl name='nvmf_cmd' type-id='8c27fb80' visibility='default' filepath='nvmf_transport.h' line='45' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_cmd' type-id='a0e8c12d' visibility='default' filepath='nvmf_transport.h' line='46' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_set_cmd' type-id='fd1dedf7' visibility='default' filepath='nvmf_transport.h' line='47' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_cmd' type-id='7876bfd3' visibility='default' filepath='nvmf_transport.h' line='48' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_cmd' type-id='8fb0506b' visibility='default' filepath='nvmf_transport.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='auth_send_cmd' type-id='5cf82640' visibility='default' filepath='nvmf_transport.h' line='50' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='auth_recv_cmd' type-id='9a628dfe' visibility='default' filepath='nvmf_transport.h' line='51' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutex_t' naming-typedef-id='7a6844eb' visibility='default' size-in-bits='320' filepath='pthreadtypes.h' line='67' column='1' hash='8e3e5ddbcaed875f' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default' filepath='pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default' filepath='pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_aqa_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='192' column='1' hash='0b0f7a5968d1bb66' id='d22b9869'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='193' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='204' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_async_event_completion' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='3715' column='1' hash='d94f7476144c3d58' id='b39d579c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3716' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='3723' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' visibility='default' size-in-bits='64' filepath='nvme_spec.h' line='61' column='1' hash='f830796bf6587b35' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='62' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fba' visibility='default' filepath='nvme_spec.h' line='105' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='127' column='1' hash='5782f75ef646d15e' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='128' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fab' visibility='default' filepath='nvme_spec.h' line='154' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cdata_ctratt' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='2238' column='1' hash='4e25609f37a2bf75' id='627055da'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2239' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb2' visibility='default' filepath='nvme_spec.h' line='2295' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1090' column='1' hash='f729993487cda28e' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fb7' visibility='default' filepath='nvme_spec.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fd2' visibility='default' filepath='nvme_spec.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43fc1' visibility='default' filepath='nvme_spec.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fca' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fcb' visibility='default' filepath='nvme_spec.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fb0' visibility='default' filepath='nvme_spec.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fd1' visibility='default' filepath='nvme_spec.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fd1' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fbf' visibility='default' filepath='nvme_spec.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fcf' visibility='default' filepath='nvme_spec.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fd0' visibility='default' filepath='nvme_spec.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fcc' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fb9' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1218' column='1' hash='c6f24a4417ec38ae' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fc4' visibility='default' filepath='nvme_spec.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fc6' visibility='default' filepath='nvme_spec.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fc5' visibility='default' filepath='nvme_spec.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='1256' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fc3' visibility='default' filepath='nvme_spec.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1283' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1284' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1285' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default' filepath='nvme_spec.h' line='1287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fb3' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1301' column='1' hash='409f50359a910183' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fbc' visibility='default' filepath='nvme_spec.h' line='1321' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fbe' visibility='default' filepath='nvme_spec.h' line='1342' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write_zeroes' type-id='e7f43fbd' visibility='default' filepath='nvme_spec.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default' filepath='nvme_spec.h' line='1362' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default' filepath='nvme_spec.h' line='1363' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw13' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1367' column='1' hash='07c32d403035ba47' id='9683a609'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1368' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='1376' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' visibility='default' size-in-bits='8' filepath='nvme_spec.h' line='865' column='1' hash='b194772d5bf0827f' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fda' visibility='default' filepath='nvme_spec.h' line='875' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='163' column='1' hash='eb76e78dba1f81ca' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='164' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fcd' visibility='default' filepath='nvme_spec.h' line='182' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='697' column='1' hash='44475d80415793ca' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='713' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='882' column='1' hash='b02e6967552029f4' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='894' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='773' column='1' hash='f0de7008476a1512' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='774' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd5' visibility='default' filepath='nvme_spec.h' line='783' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1036' column='1' hash='c76756b07e5ea163' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fac' visibility='default' filepath='nvme_spec.h' line='1042' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1049' column='1' hash='42632b5a443edf37' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fae' visibility='default' filepath='nvme_spec.h' line='1058' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1065' column='1' hash='a6348cbe8cd5c862' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc7' visibility='default' filepath='nvme_spec.h' line='1073' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1080' column='1' hash='d0d5826be39cc841' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43faf' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='990' column='1' hash='418fe3865b0daf94' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fad' visibility='default' filepath='nvme_spec.h' line='997' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='819' column='1' hash='e2d9e57a46b61039' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='820' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd4' visibility='default' filepath='nvme_spec.h' line='829' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='836' column='1' hash='73897c16e3d2eec5' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb4' visibility='default' filepath='nvme_spec.h' line='846' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='933' column='1' hash='426ac8873573abb9' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='934' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb5' visibility='default' filepath='nvme_spec.h' line='938' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='739' column='1' hash='ccac3eb052b5bf75' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc2' visibility='default' filepath='nvme_spec.h' line='746' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='804' column='1' hash='21b1a862c233b552' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='805' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc0' visibility='default' filepath='nvme_spec.h' line='812' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='722' column='1' hash='91f449230aa78a07' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='723' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc8' visibility='default' filepath='nvme_spec.h' line='732' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1004' column='1' hash='e7d28a5a2732c962' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fce' visibility='default' filepath='nvme_spec.h' line='1015' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='1023' column='1' hash='f8eb99c82fc1cc49' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc9' visibility='default' filepath='nvme_spec.h' line='1029' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='753' column='1' hash='e07ef12254b4bb9e' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='754' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd6' visibility='default' filepath='nvme_spec.h' line='766' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='790' column='1' hash='cb8fe3c5aab3fa2d' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd7' visibility='default' filepath='nvme_spec.h' line='797' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='854' column='1' hash='fa2b0cbfb10fd99e' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' visibility='default' size-in-bits='32' filepath='nvme_spec.h' line='208' column='1' hash='090ac51562ff1f93' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='209' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd3' visibility='default' filepath='nvme_spec.h' line='217' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvmf_transport_specific_address_subtype' visibility='default' size-in-bits='2048' filepath='nvmf_spec.h' line='372' column='1' hash='62b2342c192045db' id='e874a69d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='373' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rdma' type-id='210ab761' visibility='default' filepath='nvmf_spec.h' line='376' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tcp' type-id='6d63b4d7' visibility='default' filepath='nvmf_spec.h' line='379' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvmf_transport.h' line='157' column='1' hash='fd4c9cc4a21cba4d#3' id='ac5ab5a3'>
      <data-member access='public'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='158' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='159' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__11' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvmf_spec.h' line='227' column='1' hash='8bfd4a2a6a3e91af#5' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='success' type-id='e7f43f9e' visibility='default' filepath='nvmf_spec.h' line='236' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='invalid' type-id='e7f43fa0' visibility='default' filepath='nvmf_spec.h' line='242' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='244' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='nvme_spec.h' line='1399' column='1' hash='816ecb30b0290a0d#7' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fd9' visibility='default' filepath='nvme_spec.h' line='1403' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1405' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__15' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2867' column='1' hash='598112b0049eeada#9' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43fdd' visibility='default' filepath='nvme_spec.h' line='2892' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2893' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvme_spec.h' line='616' column='1' hash='a4f7edd433d5d683#10' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fdf' visibility='default' filepath='nvme_spec.h' line='621' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43fb6' visibility='default' filepath='nvme_spec.h' line='628' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fd8' visibility='default' filepath='nvme_spec.h' line='635' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__13' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='2534' column='1' hash='9c977e8ef3c46b59#11' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2535' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='2539' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='nvme_spec.h' line='1460' column='1' hash='ff703b55c138757e#12' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='status_raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1461' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvme_spec.h' line='1462' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1409' column='1' hash='da1c95d1e3eef926#13' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default' filepath='nvme_spec.h' line='1411' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1414' column='1' hash='4a7be3dda6ac3828#14' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default' filepath='nvme_spec.h' line='1416' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1419' column='1' hash='2f03c919c9633549#15' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default' filepath='nvme_spec.h' line='1421' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='1424' column='1' hash='c676782a7293be7f#16' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1425' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw13_bits' type-id='9683a609' visibility='default' filepath='nvme_spec.h' line='1426' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__14' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='nvme_spec.h' line='2549' column='1' hash='9442f632bc6a6723#17' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2550' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='2556' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__10' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='nvmf_spec.h' line='275' column='1' hash='3af314e312cd07cf#18' id='ac5ab5a2'>
      <data-member access='public'>
        <var-decl name='u64' type-id='9c313c2d' visibility='default' filepath='nvmf_spec.h' line='276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='e7f43fb8' visibility='default' filepath='nvmf_spec.h' line='280' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvmf_transport.h' line='86' column='1' hash='2e6fff379a6f934c#19' id='ac5ab5a4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43fdb' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__12' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2506' column='1' hash='23da3d9c43787895#20' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2507' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdc' visibility='default' filepath='nvme_spec.h' line='2513' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__16' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='nvme_spec.h' line='2902' column='1' hash='23da3d9c43787895#21' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2903' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fde' visibility='default' filepath='nvme_spec.h' line='2927' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#4' id='f0981eed'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' hash='b83eb2deac70d470' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
