<abi-corpus version='2.2' soname='libspdk_nvmf.so.19.0'>
  <elf-needed>
    <dependency name='libibverbs.so.1'/>
    <dependency name='librdmacm.so.1'/>
    <dependency name='libvfio-user.so.0'/>
    <dependency name='libjson-c.so.5'/>
    <dependency name='libspdk_accel.so.16.0'/>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_sock.so.10.0'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libspdk_nvme.so.14.0'/>
    <dependency name='libspdk_thread.so.10.1'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.6.0'/>
    <dependency name='libspdk_trace.so.11.0'/>
    <dependency name='libspdk_bdev.so.16.0'/>
    <dependency name='libspdk_keyring.so.2.0'/>
    <dependency name='libspdk_rdma_provider.so.6.0'/>
    <dependency name='libspdk_rdma_utils.so.1.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_abort_cmd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_bdev_ctrlr_nvme_passthru_admin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_ctrlr_abort_aer' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_nvmf_tgt_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_find_subsystem' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_get_transport' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_listen_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_new_qpair' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_pause_polling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_remove_referral' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_resume_polling' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_stop_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_tgt_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_create_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_get_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_get_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_stop_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_nvmf_transport_stop_listen_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='ctrlr.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='1792' id='ca634421'>
      <subrange length='224' lower-bound='0' upper-bound='223' type-id='f0981eeb' id='3035a8c9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='264' id='12da2087'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' filepath='json.h' line='21' column='1' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_ana_state' filepath='nvme_spec.h' line='3755' column='1' id='78649e32'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ANA_OPTIMIZED_STATE' value='1'/>
      <enumerator name='SPDK_NVME_ANA_NON_OPTIMIZED_STATE' value='2'/>
      <enumerator name='SPDK_NVME_ANA_INACCESSIBLE_STATE' value='3'/>
      <enumerator name='SPDK_NVME_ANA_PERSISTENT_LOSS_STATE' value='4'/>
      <enumerator name='SPDK_NVME_ANA_CHANGE_STATE' value='15'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_async_event_info_error' filepath='nvme_spec.h' line='3648' column='1' id='93b0ae67'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_WRITE_INVALID_DB' value='0'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_INVALID_DB_WRITE' value='1'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_DIAGNOSTIC_FAILURE' value='2'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_PERSISTENT_INTERNAL' value='3'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_TRANSIENT_INTERNAL' value='4'/>
      <enumerator name='SPDK_NVME_ASYNC_EVENT_FW_IMAGE_LOAD' value='5'/>
    </enum-decl>
    <enum-decl name='spdk_nvme_transport_type' filepath='nvme.h' line='429' column='1' id='8cd337c8'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVME_TRANSPORT_PCIE' value='256'/>
      <enumerator name='SPDK_NVME_TRANSPORT_RDMA' value='1'/>
      <enumerator name='SPDK_NVME_TRANSPORT_FC' value='2'/>
      <enumerator name='SPDK_NVME_TRANSPORT_TCP' value='3'/>
      <enumerator name='SPDK_NVME_TRANSPORT_VFIOUSER' value='1024'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM' value='4096'/>
      <enumerator name='SPDK_NVME_TRANSPORT_CUSTOM_FABRICS' value='4097'/>
    </enum-decl>
    <enum-decl name='spdk_nvmf_adrfam' filepath='nvmf_spec.h' line='116' column='1' id='72aef3b2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV4' value='1'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IPV6' value='2'/>
      <enumerator name='SPDK_NVMF_ADRFAM_IB' value='3'/>
      <enumerator name='SPDK_NVMF_ADRFAM_FC' value='4'/>
      <enumerator name='SPDK_NVMF_ADRFAM_INTRA_HOST' value='254'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='160' id='d0740e9b'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ee31ee44' size-in-bits='320' id='3a071e7d'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4224' id='8caeb6eb'>
      <subrange length='33' lower-bound='0' upper-bound='32' type-id='f0981eeb' id='6a5934df'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' id='95e97e60'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='b39d579c' size-in-bits='8192' id='08ba5752'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b826bbde' size-in-bits='8192' id='bf64ebc5'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='thread-shared-types.h' line='51' column='1' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='struct_mutex.h' line='22' column='1' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='bdev.h' line='1980' column='1' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='1982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx' size-in-bits='512' is-struct='yes' visibility='default' filepath='dif.h' line='64' column='1' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer' size-in-bits='64' is-struct='yes' visibility='default' filepath='thread.h' line='1071' column='1' id='9321bf74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stailq' type-id='e7f43f73' visibility='default' filepath='thread.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='306e7691' visibility='default' filepath='thread.h' line='1076' column='1' id='79110b08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='136d6f32' visibility='default' filepath='thread.h' line='1076' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ad45e2c8' visibility='default' filepath='thread.h' line='1076' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_channel' size-in-bits='1280' is-struct='yes' visibility='default' filepath='thread.h' line='1096' column='1' id='e8e2ad7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small' type-id='88eba988' visibility='default' filepath='thread.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='large' type-id='88eba988' visibility='default' filepath='thread.h' line='1100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='parent' type-id='a7e01876' visibility='default' filepath='thread.h' line='1104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' size-in-bits='192' is-struct='yes' visibility='default' filepath='thread.h' line='1065' column='1' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default' filepath='thread.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1067' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f74' visibility='default' filepath='thread.h' line='1068' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='da6a25d9' visibility='default' filepath='thread.h' line='1075' column='1' id='ce92b0c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='29210180' visibility='default' filepath='thread.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='68f59e9e' visibility='default' filepath='thread.h' line='1075' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool' size-in-bits='576' is-struct='yes' visibility='default' filepath='thread.h' line='1078' column='1' id='88eba988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='b2192338' visibility='default' filepath='thread.h' line='1080' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='306e7691' visibility='default' filepath='thread.h' line='1082' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cache_count' type-id='8f92235e' visibility='default' filepath='thread.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache_size' type-id='8f92235e' visibility='default' filepath='thread.h' line='1086' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue' type-id='49599bfc' visibility='default' filepath='thread.h' line='1088' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufsize' type-id='8f92235e' visibility='default' filepath='thread.h' line='1090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='stats' type-id='adee513c' visibility='default' filepath='thread.h' line='1092' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool_stats' size-in-bits='192' is-struct='yes' visibility='default' filepath='thread.h' line='1045' column='1' id='adee513c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cache' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='main' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1049' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='retry' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1051' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' filepath='json.h' line='36' column='1' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_fuses' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2196' column='1' id='cb6cbccd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare_and_write' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2198' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_nvmf_specific' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2101' column='1' id='064027b7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ioccsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='iorcsz' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='icdoff' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='ctrattr' type-id='e7f43f75' visibility='default' filepath='nvme_spec.h' line='2116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='88'>
        <var-decl name='msdbd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ofcs' type-id='e7f43f76' visibility='default' filepath='nvme_spec.h' line='2126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='reserved' type-id='90687fee' visibility='default' filepath='nvme_spec.h' line='2128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oacs' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2159' column='1' id='38615ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='security' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='format' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='firmware' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ns_manage' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='device_self_test' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='directives' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='nvme_mi' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='virtualization_management' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='doorbell_buffer_config' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='get_lba_status' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='command_feature_lockdown' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='oacs_rsvd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oaes' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2201' column='1' id='2865bee5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attribute_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='pleal_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='lba_sia_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='egealp_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='nnvm_sse' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='27'>
        <var-decl name='zdes_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved4' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notices' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_oncs' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2146' column='1' id='fb45d0c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compare' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_unc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dsm' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zeroes' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='set_features_save' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reservations' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='timestamp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='verify' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='copy' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='reserved9' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cdata_sgls' size-in-bits='32' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2132' column='1' id='e03b6992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='keyed_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='bit_bucket_descriptor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='metadata_pointer' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18'>
        <var-decl name='oversized_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='metadata_address' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='sgl_offset' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='21'>
        <var-decl name='transport_sgl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2142' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1380' column='1' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab595' visibility='default' filepath='nvme_spec.h' line='1406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cpl' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1447' column='1' id='72b49d60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='cdw1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1455' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='sqid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ctrlr_data' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2299' column='1' id='514f4721'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sn' type-id='d0740e9b' visibility='default' filepath='nvme_spec.h' line='2309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='mn' type-id='3a071e7d' visibility='default' filepath='nvme_spec.h' line='2312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='fr' type-id='13339fda' visibility='default' filepath='nvme_spec.h' line='2315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='rab' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='cmic' type-id='e7f43f77' visibility='default' filepath='nvme_spec.h' line='2330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='616'>
        <var-decl name='mdts' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='624'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ver' type-id='900beaa3' visibility='default' filepath='nvme_spec.h' line='2339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='rtd3r' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='rtd3e' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='oaes' type-id='2865bee5' visibility='default' filepath='nvme_spec.h' line='2348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ctratt' type-id='627055da' visibility='default' filepath='nvme_spec.h' line='2351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='rrls' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='reserved_102' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='888'>
        <var-decl name='cntrltype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='fguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='crdt' type-id='45439f56' visibility='default' filepath='nvme_spec.h' line='2365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1072'>
        <var-decl name='reserved_134' type-id='1acf0601' visibility='default' filepath='nvme_spec.h' line='2367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2024'>
        <var-decl name='nvmsr' type-id='e7f43f78' visibility='default' filepath='nvme_spec.h' line='2378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2032'>
        <var-decl name='vwci' type-id='e7f43f79' visibility='default' filepath='nvme_spec.h' line='2387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2040'>
        <var-decl name='mec' type-id='e7f43f7a' visibility='default' filepath='nvme_spec.h' line='2398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvme_spec.h' line='2403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2064'>
        <var-decl name='acl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2072'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='frmw' type-id='e7f43f7b' visibility='default' filepath='nvme_spec.h' line='2426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2088'>
        <var-decl name='lpa' type-id='e7f43f7c' visibility='default' filepath='nvme_spec.h' line='2445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2096'>
        <var-decl name='elpe' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2104'>
        <var-decl name='npss' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='avscc' type-id='e7f43f7d' visibility='default' filepath='nvme_spec.h' line='2459' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2120'>
        <var-decl name='apsta' type-id='e7f43f7e' visibility='default' filepath='nvme_spec.h' line='2467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2128'>
        <var-decl name='wctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2470' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='cctemp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2160'>
        <var-decl name='mtfa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='hmpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='hmmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tnvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='rpmbs' type-id='e7f43f7f' visibility='default' filepath='nvme_spec.h' line='2500' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2528'>
        <var-decl name='edstt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2503' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2544'>
        <var-decl name='dsto' type-id='ac5ab59b' visibility='default' filepath='nvme_spec.h' line='2514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2552'>
        <var-decl name='fwug' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2576'>
        <var-decl name='hctma' type-id='ac5ab59c' visibility='default' filepath='nvme_spec.h' line='2540' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2592'>
        <var-decl name='mntmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2543' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2608'>
        <var-decl name='mxtmt' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2546' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='sanicap' type-id='ac5ab59d' visibility='default' filepath='nvme_spec.h' line='2557' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='hmminds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2560' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='hmmaxd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2704'>
        <var-decl name='nsetidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2566' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='endgidmax' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2736'>
        <var-decl name='anatt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2744'>
        <var-decl name='anacap' type-id='e7f43f80' visibility='default' filepath='nvme_spec.h' line='2584' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='anagrpmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2784'>
        <var-decl name='nanagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2848'>
        <var-decl name='domain_identifier' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2864'>
        <var-decl name='reserved3' type-id='b68a110f' visibility='default' filepath='nvme_spec.h' line='2597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='megcap' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2600' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='reserved384' type-id='c768f32d' visibility='default' filepath='nvme_spec.h' line='2603' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='sqes' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4104'>
        <var-decl name='cqes' type-id='e7f43f81' visibility='default' filepath='nvme_spec.h' line='2617' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4112'>
        <var-decl name='maxcmd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4128'>
        <var-decl name='nn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvme_spec.h' line='2625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4176'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvme_spec.h' line='2628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4192'>
        <var-decl name='fna' type-id='e7f43f82' visibility='default' filepath='nvme_spec.h' line='2636' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4200'>
        <var-decl name='vwc' type-id='e7f43f83' visibility='default' filepath='nvme_spec.h' line='2643' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4208'>
        <var-decl name='awun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2646' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='awupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='nvscc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='nwpc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2655' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='acwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2658' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4272'>
        <var-decl name='ocfs' type-id='e7f43f84' visibility='default' filepath='nvme_spec.h' line='2664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvme_spec.h' line='2667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4320'>
        <var-decl name='mnan' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2670' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='maxdna' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2673' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='maxcna' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='reserved4' type-id='d8dd2858' visibility='default' filepath='nvme_spec.h' line='2678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvme_spec.h' line='2680' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='reserved5' type-id='be0fa24b' visibility='default' filepath='nvme_spec.h' line='2682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14336'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvme_spec.h' line='2684' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='psd' type-id='bf64ebc5' visibility='default' filepath='nvme_spec.h' line='2687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24576'>
        <var-decl name='vs' type-id='25518ee9' visibility='default' filepath='nvme_spec.h' line='2690' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_ns_data' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='2775' column='1' id='4e56c4fd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsze' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ncap' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nuse' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='2783' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nsfeat' type-id='e7f43f85' visibility='default' filepath='nvme_spec.h' line='2803' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='nlbaf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='flbas' type-id='e7f43f86' visibility='default' filepath='nvme_spec.h' line='2816' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='mc' type-id='e7f43f87' visibility='default' filepath='nvme_spec.h' line='2828' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dpc' type-id='e7f43f88' visibility='default' filepath='nvme_spec.h' line='2846' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='dps' type-id='e7f43f89' visibility='default' filepath='nvme_spec.h' line='2858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='nmic' type-id='e7f43f8a' visibility='default' filepath='nvme_spec.h' line='2864' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='248'>
        <var-decl name='nsrescap' type-id='ac5ab59e' visibility='default' filepath='nvme_spec.h' line='2894' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fpi' type-id='e7f43f8b' visibility='default' filepath='nvme_spec.h' line='2899' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='dlfeat' type-id='ac5ab59f' visibility='default' filepath='nvme_spec.h' line='2928' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='nawun' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2931' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='nawupf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='nacwu' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2937' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nabsn' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2940' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='nabo' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2943' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='nabspf' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2946' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='noiob' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2949' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvmcap' type-id='c1c22e6c' visibility='default' filepath='nvme_spec.h' line='2952' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='npwg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2955' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='npwa' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2958' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='npdg' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2961' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='npda' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2964' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nows' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2967' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='mssrl' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mcl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2973' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msrc' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2976' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='reserved81' type-id='ba8c55f2' visibility='default' filepath='nvme_spec.h' line='2978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='anagrpid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='reserved96' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='2983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='792'>
        <var-decl name='nsattr' type-id='e7f43f8c' visibility='default' filepath='nvme_spec.h' line='2990' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='nvmsetid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2993' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='816'>
        <var-decl name='endgid' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nguid' type-id='fa9986a5' visibility='default' filepath='nvme_spec.h' line='2999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='eui64' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='3002' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='lbaf' type-id='93b898c4' visibility='default' filepath='nvme_spec.h' line='3016' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='vendor_specific' type-id='74b3417b' visibility='default' filepath='nvme_spec.h' line='3018' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_power_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1965' column='1' id='b826bbde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1966' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1968' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='mps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1970' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='nops' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1971' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1972' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='enlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1974' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='exlat' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1975' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rrt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1977' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='101'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1978' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='rrl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1980' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='109'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1981' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='rwt' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='117'>
        <var-decl name='reserved5' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rwl' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1986' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='125'>
        <var-decl name='reserved6' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1987' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idlp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1989' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='reserved7' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1991' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='150'>
        <var-decl name='ips' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1992' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='152'>
        <var-decl name='reserved8' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='actp' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1996' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='apw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1998' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='179'>
        <var-decl name='reserved9' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='1999' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='182'>
        <var-decl name='aps' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='184'>
        <var-decl name='reserved10' type-id='cf30f637' visibility='default' filepath='nvme_spec.h' line='2002' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='614' column='1' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='615' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_status' size-in-bits='16' is-struct='yes' visibility='default' filepath='nvme_spec.h' line='1434' column='1' id='38ef35c9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='p' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='sc' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='sct' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='crd' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='m' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='dnr' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1440' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_tcp_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='362' column='1' id='6d63b4d7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sectype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='629227c2' visibility='default' filepath='nvmf_spec.h' line='366' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_transport_id' size-in-bits='4512' is-struct='yes' visibility='default' filepath='nvme.h' line='485' column='1' id='8712472c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trstring' type-id='12da2087' visibility='default' filepath='nvme.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='trtype' type-id='8cd337c8' visibility='default' filepath='nvme.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='adrfam' type-id='72aef3b2' visibility='default' filepath='nvme.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='traddr' type-id='cd5f2f4f' visibility='default' filepath='nvme.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2408'>
        <var-decl name='trsvcid' type-id='12da2087' visibility='default' filepath='nvme.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2672'>
        <var-decl name='subnqn' type-id='ca634421' visibility='default' filepath='nvme.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4480'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='nvme.h' line='530' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_capsule_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='25' column='1' id='8c27fb80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='27' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='30' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fabric_specific' type-id='014804d6' visibility='default' filepath='nvmf_spec.h' line='31' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_data' size-in-bits='2240' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='242' column='1' id='76e51992'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='aerl' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='kas' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='ssvid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ieee' type-id='d3490169' visibility='default' filepath='nvmf_transport.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='oacs' type-id='38615ae7' visibility='default' filepath='nvmf_transport.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='oncs' type-id='fb45d0c2' visibility='default' filepath='nvmf_transport.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fuses' type-id='cb6cbccd' visibility='default' filepath='nvmf_transport.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='sgls' type-id='e03b6992' visibility='default' filepath='nvmf_transport.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvmf_specific' type-id='064027b7' visibility='default' filepath='nvmf_transport.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_feat' size-in-bits='320' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='589' column='1' id='a2cb797e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='arbitration' type-id='9f1a58c0' visibility='default' filepath='nvmf_transport.h' line='590' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='power_management' type-id='64feb306' visibility='default' filepath='nvmf_transport.h' line='591' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='error_recovery' type-id='af85b2af' visibility='default' filepath='nvmf_transport.h' line='592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvmf_transport.h' line='593' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='number_of_queues' type-id='59e17753' visibility='default' filepath='nvmf_transport.h' line='594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvmf_transport.h' line='595' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvmf_transport.h' line='596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvmf_transport.h' line='597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='async_event_configuration' type-id='8a1225db' visibility='default' filepath='nvmf_transport.h' line='598' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='keep_alive_timer' type-id='47966266' visibility='default' filepath='nvmf_transport.h' line='599' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_ctrlr_migr_data' size-in-bits='32768' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='609' column='1' id='2b5c05b2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='regs_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='616' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='feat_size' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='regs' type-id='d5e31df6' visibility='default' filepath='nvmf_transport.h' line='621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='regs_reserved' type-id='af0d923d' visibility='default' filepath='nvmf_transport.h' line='622' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='feat' type-id='a2cb797e' visibility='default' filepath='nvmf_transport.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='feat_reserved' type-id='af0d923d' visibility='default' filepath='nvmf_transport.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4240'>
        <var-decl name='acre' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4248'>
        <var-decl name='num_aer_cids' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='629' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4256'>
        <var-decl name='num_async_events' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4288'>
        <var-decl name='async_events' type-id='08ba5752' visibility='default' filepath='nvmf_transport.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='aer_cids' type-id='453ce391' visibility='default' filepath='nvmf_transport.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12544'>
        <var-decl name='notice_aen_mask' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12608'>
        <var-decl name='unused' type-id='7d6f480a' visibility='default' filepath='nvmf_transport.h' line='636' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_dif_info' size-in-bits='576' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='62' column='1' id='1e55cf88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dif_ctx' type-id='6e011169' visibility='default' filepath='nvmf_transport.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='elba_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='orig_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_discovery_log_page_entry' size-in-bits='8192' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='389' column='1' id='6b40ccf0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='adrfam' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='397' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='treq' type-id='e7f43f8d' visibility='default' filepath='nvmf_spec.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='portid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='asqsz' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='eflags' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='reserved0' type-id='013f0a7a' visibility='default' filepath='nvmf_spec.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='trsvcid' type-id='d0f1c0cb' visibility='default' filepath='nvmf_spec.h' line='422' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='reserved1' type-id='f3fa1b1a' visibility='default' filepath='nvmf_spec.h' line='424' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='subnqn' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4096'>
        <var-decl name='traddr' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='tsas' type-id='e874a69d' visibility='default' filepath='nvmf_spec.h' line='433' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_auth_recv_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='167' column='1' id='9a628dfe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='spsp0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='spsp1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='secp' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='al' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_auth_send_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='183' column='1' id='5cf82640'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='spsp0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='spsp1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='344'>
        <var-decl name='secp' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='tl' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='209' column='1' id='8fb0506b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='ba78ce3a' visibility='default' filepath='nvmf_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvmf_spec.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recfmt' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='qid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='sqsize' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='cattr' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='376'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved4' type-id='fa8ef949' visibility='default' filepath='nvmf_spec.h' line='222' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_connect_rsp' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='226' column='1' id='c9fa5b46'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status_code_specific' type-id='ac5ab5a1' visibility='default' filepath='nvmf_spec.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved0' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvmf_spec.h' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='258' column='1' id='7876bfd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved2' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f8e' visibility='default' filepath='nvmf_spec.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved3' type-id='d3490169' visibility='default' filepath='nvmf_spec.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved4' type-id='fa9986a5' visibility='default' filepath='nvmf_spec.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_get_rsp' size-in-bits='128' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='274' column='1' id='d0bd555e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='ac5ab5a2' visibility='default' filepath='nvmf_spec.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sqhd' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved0' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvmf_spec.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_fabric_prop_set_cmd' size-in-bits='512' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='290' column='1' id='fd1dedf7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opcode' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved0' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fctype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='reserved1' type-id='d0ef8234' visibility='default' filepath='nvmf_spec.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attrib' type-id='e7f43f8e' visibility='default' filepath='nvmf_spec.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='328'>
        <var-decl name='reserved2' type-id='d3490169' visibility='default' filepath='nvmf_spec.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='ofst' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='value' type-id='ac5ab5a2' visibility='default' filepath='nvmf_spec.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='reserved4' type-id='13339fda' visibility='default' filepath='nvmf_spec.h' line='311' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listen_opts' size-in-bits='256' is-struct='yes' visibility='default' filepath='nvmf.h' line='116' column='1' id='ac930882'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvmf.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default' filepath='nvmf.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='secure_channel' type-id='c894953d' visibility='default' filepath='nvmf.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='reserved1' type-id='d3490169' visibility='default' filepath='nvmf.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='ana_state' type-id='78649e32' visibility='default' filepath='nvmf.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sock_impl' type-id='26a90f95' visibility='default' filepath='nvmf.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_listener' size-in-bits='4736' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='232' column='1' id='d5c9cd10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='trid' type-id='8712472c' visibility='default' filepath='nvmf_transport.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4512'>
        <var-decl name='ref' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4544'>
        <var-decl name='sock_impl' type-id='26a90f95' visibility='default' filepath='nvmf_transport.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4608'>
        <var-decl name='link' type-id='e7f43f8f' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group' size-in-bits='1408' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='200' column='1' id='5f432901'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='nvmf_transport.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='nvmf_transport.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tgroups' type-id='e7f43f90' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sgroups' type-id='ae6a5885' visibility='default' filepath='nvmf_transport.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_sgroups' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='current_unassociated_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='qpairs' type-id='e7f43f91' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stat' type-id='cb344050' visibility='default' filepath='nvmf_transport.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='destroy_cb_fn' type-id='c58e4e5b' visibility='default' filepath='nvmf_transport.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='destroy_cb_arg' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default' filepath='nvmf_transport.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='link' type-id='e7f43f92' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='nvmf_transport.h' line='229' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_poll_group_stat' size-in-bits='256' is-struct='yes' visibility='default' filepath='nvmf.h' line='163' column='1' id='cb344050'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='admin_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='io_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='current_admin_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='current_io_qpairs' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_bdev_io' type-id='9c313c2d' visibility='default' filepath='nvmf.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='completed_nvme_io' type-id='9c313c2d' visibility='default' filepath='nvmf.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_qpair' size-in-bits='896' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='146' column='1' id='407d526b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qid' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sq_head' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='sq_head_max' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='transport' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctrlr' type-id='ba88e9a1' visibility='default' filepath='nvmf_transport.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='group' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab5a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='outstanding' type-id='e7f43f93' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='e7f43f94' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='state_cb' type-id='bafe66ec' visibility='default' filepath='nvmf_transport.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='state_cb_arg' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='connect_received' type-id='c894953d' visibility='default' filepath='nvmf_transport.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='712'>
        <var-decl name='disconnect_started' type-id='c894953d' visibility='default' filepath='nvmf_transport.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='720'>
        <var-decl name='trace_id' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='queue_depth' type-id='149c6638' visibility='default' filepath='nvmf_transport.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='auth' type-id='9db48478' visibility='default' filepath='nvmf_transport.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='numa' type-id='e7f43f95' visibility='default' filepath='nvmf_transport.h' line='182' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_rdma_transport_specific_address_subtype' size-in-bits='2048' is-struct='yes' visibility='default' filepath='nvmf_spec.h' line='329' column='1' id='210ab761'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdma_qptype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rdma_prtype' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rdma_cms' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved0' type-id='0f4ddd0b' visibility='default' filepath='nvmf_spec.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rdma_pkey' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='reserved2' type-id='d05e5752' visibility='default' filepath='nvmf_spec.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_registers' size-in-bits='320' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='528' column='1' id='d5e31df6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cap' type-id='007005ee' visibility='default' filepath='nvmf_transport.h' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vs' type-id='900beaa3' visibility='default' filepath='nvmf_transport.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cc' type-id='f0fcbcb4' visibility='default' filepath='nvmf_transport.h' line='531' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='csts' type-id='f62d2dc3' visibility='default' filepath='nvmf_transport.h' line='532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='aqa' type-id='d22b9869' visibility='default' filepath='nvmf_transport.h' line='533' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='asq' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='acq' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='535' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_request' size-in-bits='6464' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='82' column='1' id='5507fe79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qpair' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='xfer' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='' type-id='ac5ab5a4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='zcopy_phase' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='iovcnt' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cmd' type-id='b520ce9e' visibility='default' filepath='nvmf_transport.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rsp' type-id='adfda87a' visibility='default' filepath='nvmf_transport.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='buf_link' type-id='e7f43f96' visibility='default' filepath='nvmf_transport.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f97' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='nvmf_transport.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='nvmf_transport.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='accel_sequence' type-id='d4aefa7e' visibility='default' filepath='nvmf_transport.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default' filepath='nvmf_transport.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4864'>
        <var-decl name='stripped_data' type-id='edc76902' visibility='default' filepath='nvmf_transport.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='dif' type-id='1e55cf88' visibility='default' filepath='nvmf_transport.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default' filepath='nvmf_transport.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5824'>
        <var-decl name='cmd_cb_fn' type-id='e4580111' visibility='default' filepath='nvmf_transport.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5888'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='req_to_abort' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6016'>
        <var-decl name='poller' type-id='bf13de54' visibility='default' filepath='nvmf_transport.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6080'>
        <var-decl name='zcopy_bdev_io' type-id='378e9c1c' visibility='default' filepath='nvmf_transport.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6144'>
        <var-decl name='iobuf' type-id='e7f43f98' visibility='default' filepath='nvmf_transport.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6400'>
        <var-decl name='timeout_tsc' type-id='9c313c2d' visibility='default' filepath='nvmf_transport.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_stripped_data' size-in-bits='4288' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='68' column='1' id='b954fee4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov' type-id='8caeb6eb' visibility='default' filepath='nvmf_transport.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport' size-in-bits='1600' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='264' column='1' id='d59a222d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tgt' type-id='690b38cf' visibility='default' filepath='nvmf_transport.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ops' type-id='2d76de85' visibility='default' filepath='nvmf_transport.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts' type-id='72315d04' visibility='default' filepath='nvmf_transport.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='iobuf_name' type-id='36c46961' visibility='default' filepath='nvmf_transport.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='listeners' type-id='e7f43f99' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='link' type-id='e7f43f9a' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default' filepath='nvmf_transport.h' line='274' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_ops' size-in-bits='2304' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='279' column='1' id='c0085c66'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='16dc656a' visibility='default' filepath='nvmf_transport.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='type' type-id='8cd337c8' visibility='default' filepath='nvmf_transport.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='opts_init' type-id='f222e253' visibility='default' filepath='nvmf_transport.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='create' type-id='3dde76d9' visibility='default' filepath='nvmf_transport.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='create_async' type-id='12bf7de7' visibility='default' filepath='nvmf_transport.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dump_opts' type-id='7922c62f' visibility='default' filepath='nvmf_transport.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='destroy' type-id='ceef4cae' visibility='default' filepath='nvmf_transport.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='listen' type-id='f01c8a66' visibility='default' filepath='nvmf_transport.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='listen_dump_opts' type-id='8ccb9707' visibility='default' filepath='nvmf_transport.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='stop_listen' type-id='b8ede514' visibility='default' filepath='nvmf_transport.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='listen_associate' type-id='77cfe0ca' visibility='default' filepath='nvmf_transport.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='subsystem_add_ns' type-id='530e6910' visibility='default' filepath='nvmf_transport.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='subsystem_remove_ns' type-id='22c3e229' visibility='default' filepath='nvmf_transport.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='cdata_init' type-id='fd2aed57' visibility='default' filepath='nvmf_transport.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='listener_discover' type-id='342be2de' visibility='default' filepath='nvmf_transport.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='poll_group_create' type-id='d694a330' visibility='default' filepath='nvmf_transport.h' line='377' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_optimal_poll_group' type-id='5c292582' visibility='default' filepath='nvmf_transport.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='poll_group_destroy' type-id='001bdd7a' visibility='default' filepath='nvmf_transport.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='poll_group_add' type-id='dff5464f' visibility='default' filepath='nvmf_transport.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='poll_group_remove' type-id='dff5464f' visibility='default' filepath='nvmf_transport.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='poll_group_poll' type-id='37da45cd' visibility='default' filepath='nvmf_transport.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='req_free' type-id='6e317635' visibility='default' filepath='nvmf_transport.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='req_complete' type-id='6e317635' visibility='default' filepath='nvmf_transport.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='req_get_buffers_done' type-id='195c95d4' visibility='default' filepath='nvmf_transport.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='qpair_fini' type-id='75e71b91' visibility='default' filepath='nvmf_transport.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='qpair_get_peer_trid' type-id='0b42b28e' visibility='default' filepath='nvmf_transport.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='qpair_get_local_trid' type-id='0b42b28e' visibility='default' filepath='nvmf_transport.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='qpair_get_listen_trid' type-id='0b42b28e' visibility='default' filepath='nvmf_transport.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='qpair_abort_request' type-id='954ab8fe' visibility='default' filepath='nvmf_transport.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='poll_group_dump_stat' type-id='d83cf1e9' visibility='default' filepath='nvmf_transport.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='subsystem_add_host' type-id='74fade65' visibility='default' filepath='nvmf_transport.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='subsystem_remove_host' type-id='63e99c4a' visibility='default' filepath='nvmf_transport.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='subsystem_dump_host' type-id='48ad2459' visibility='default' filepath='nvmf_transport.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_opts' size-in-bits='576' is-struct='yes' visibility='default' filepath='nvmf.h' line='68' column='1' id='72315d04'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max_queue_depth' type-id='149c6638' visibility='default' filepath='nvmf.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='max_qpairs_per_ctrlr' type-id='149c6638' visibility='default' filepath='nvmf.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='in_capsule_data_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_io_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='io_unit_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='max_aq_depth' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_shared_buffers' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dif_insert_or_strip' type-id='c894953d' visibility='default' filepath='nvmf.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='disable_command_passthru' type-id='c894953d' visibility='default' filepath='nvmf.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='reserved30' type-id='0f4b9e74' visibility='default' filepath='nvmf.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='abort_timeout_sec' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='association_timeout' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='transport_specific' type-id='3ee1fff1' visibility='default' filepath='nvmf.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='nvmf.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='acceptor_poll_rate' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default' filepath='nvmf.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='488'>
        <var-decl name='reserved61' type-id='d3490169' visibility='default' filepath='nvmf.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='ack_timeout' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='data_wr_pool_size' type-id='8f92235e' visibility='default' filepath='nvmf.h' line='112' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvmf_transport_poll_group' size-in-bits='448' is-struct='yes' visibility='default' filepath='nvmf_transport.h' line='191' column='1' id='824683eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='transport' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pending_buf_queue' type-id='e7f43f9b' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='buf_cache' type-id='f905ec5d' visibility='default' filepath='nvmf_transport.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='group' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f9c' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__76' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev.h' line='1984' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='1984' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='thread.h' line='1072' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='136d6f32' visibility='default' filepath='thread.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__77' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='123' column='1' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entry' type-id='71e32ba2' visibility='default' filepath='nvmf_transport.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='remaining_length' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='thread.h' line='1068' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default' filepath='thread.h' line='1068' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='884' column='1' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default' filepath='nvme_spec.h' line='885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='886' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='887' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='889' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='890' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='891' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='893' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='236' column='1' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='28c64746' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9c226f04' visibility='default' filepath='nvmf_transport.h' line='236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='271' column='1' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='28c64746' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9c226f04' visibility='default' filepath='nvmf_transport.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='227' column='1' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='58736969' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='80aeb479' visibility='default' filepath='nvmf_transport.h' line='227' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='163' column='1' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8af4e883' visibility='default' filepath='nvmf_transport.h' line='163' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='217' column='1' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='fedf937b' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='8af4e883' visibility='default' filepath='nvmf_transport.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__74' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='99' column='1' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='194' column='1' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__75' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='100' column='1' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='162' column='1' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c2edea11' visibility='default' filepath='nvmf_transport.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='272' column='1' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='8003131d' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='bbd73f95' visibility='default' filepath='nvmf_transport.h' line='272' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='197' column='1' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='264c437b' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9b0df883' visibility='default' filepath='nvmf_transport.h' line='197' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='204' column='1' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='264c437b' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9b0df883' visibility='default' filepath='nvmf_transport.h' line='204' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__71' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='228' column='1' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cntlid' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='authreq' type-id='e7f43f9f' visibility='default' filepath='nvmf_spec.h' line='235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__97' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2661' column='1' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='copy_format0' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2663' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2122' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='disconnect' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__73' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='238' column='1' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipo' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iattr' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__72' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='230' column='1' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='atr' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ascr' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default' filepath='nvmf_spec.h' line='234' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__90' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2536' column='1' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2537' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2538' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='699' column='1' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='706' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='709' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='712' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__112' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='194' column='1' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='asqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='acqs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='28'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='203' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__113' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='3717' column='1' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='async_event_type' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3718' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3719' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='async_event_info' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='log_page_identifier' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3721' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3722' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1092' column='1' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1097' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__91' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2551' column='1' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crypto_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2552' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='block_erase' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2553' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='overwrite' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2555' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='856' column='1' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='858' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='860' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1249' column='1' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__66' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1370' column='1' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dsm' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1375' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1265' column='1' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1268' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__110' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='129' column='1' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='en' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='mps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='shn' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iosqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='iocqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='153' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1038' column='1' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endgid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1040' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1041' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='992' column='1' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='994' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='996' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__64' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1051' column='1' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1053' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1054' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fdpci' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1056' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1057' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1082' column='1' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fdpee' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1084' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1085' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1150' column='1' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1142' column='1' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__80' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2240' column='1' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='host_id_exhid_supported' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='non_operational_power_state_permissive_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvm_sets' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_recovery_levels' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='endurance_groups' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='predictable_latency_mode' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='tbkas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='namespace_granularity' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sq_associations' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='uuid_list' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='mds' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='fixed_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='variable_capacity_management' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='13'>
        <var-decl name='delete_endurance_group' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='delete_nvm_set' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='elbas' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='fdps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2294' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='178' column='1' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id_valid' type-id='8f92235e' visibility='default' filepath='nvmf_transport.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='id' type-id='3ff5601b' visibility='default' filepath='nvmf_transport.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__60' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1289' column='1' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1296' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='838' column='1' id='e7f43fb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='840' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='843' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='935' column='1' id='e7f43fb5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='937' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='623' column='1' id='e7f43fb6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='624' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default' filepath='nvme_spec.h' line='625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='627' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1100' column='1' id='e7f43fb7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__68' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='305' column='1' id='e7f43fb8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='low' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='high' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='307' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1208' column='1' id='e7f43fb9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mo' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mos' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__109' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='63' column='1' id='e7f43fba'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mqes' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='ams' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='19'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='to' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dstrd' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='36'>
        <var-decl name='nssrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='37'>
        <var-decl name='css' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='45'>
        <var-decl name='bps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='46'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='mpsmin' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='52'>
        <var-decl name='mpsmax' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='pmrs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='57'>
        <var-decl name='cmbs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='58'>
        <var-decl name='reserved3' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='104' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__108' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='3005' column='1' id='e7f43fbb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ms' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lbads' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3010' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='reserved6' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3015' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43fbb' size-in-bits='2048' id='93b898c4'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' id='b10be967'/>
    </array-type-def>
    <class-decl name='__anonymous_struct__61' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1304' column='1' id='e7f43fbc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1320' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1344' column='1' id='e7f43fbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nlb' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='deac' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prchk' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='29'>
        <var-decl name='pract' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1359' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__62' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1323' column='1' id='e7f43fbe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='df' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='prinfor' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='stcw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1334' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='25'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1335' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='26'>
        <var-decl name='prinfow' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='fua' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='lr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1170' column='1' id='e7f43fbf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='806' column='1' id='e7f43fc0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='808' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1118' column='1' id='e7f43fc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1126' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='741' column='1' id='e7f43fc2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='745' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1258' column='1' id='e7f43fc3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1221' column='1' id='e7f43fc4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1239' column='1' id='e7f43fc5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1246' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1229' column='1' id='e7f43fc6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1236' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1067' column='1' id='e7f43fc7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='phndl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='noet' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1072' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='724' column='1' id='e7f43fc8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='726' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='731' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1025' column='1' id='e7f43fc9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1027' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1028' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1129' column='1' id='e7f43fca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1136' column='1' id='e7f43fcb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1139' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1197' column='1' id='e7f43fcc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1205' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__111' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='165' column='1' id='e7f43fcd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rdy' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='cfs' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='shst' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='nssro' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='pp' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1006' column='1' id='e7f43fce'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1007' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1009' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1011' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1013' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1014' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1176' column='1' id='e7f43fcf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1186' column='1' id='e7f43fd0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1158' column='1' id='e7f43fd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1161' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1111' column='1' id='e7f43fd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__79' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='210' column='1' id='e7f43fd3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ter' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='mnr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mjr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='216' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='821' column='1' id='e7f43fd4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='823' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='826' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='828' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='775' column='1' id='e7f43fd5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='782' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='755' column='1' id='e7f43fd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='763' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='765' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='792' column='1' id='e7f43fd7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='796' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='630' column='1' id='e7f43fd8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='631' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='634' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1400' column='1' id='e7f43fd9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='1402' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__92' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2575' column='1' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ana_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ana_non_optimized_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ana_inaccessible_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_persistent_loss_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2579' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='ana_change_state' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2581' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='no_change_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2582' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='non_zero_anagrpid' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2583' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='868' column='1' id='e7f43fda'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='869' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='872' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='874' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__103' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2861' column='1' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='can_share' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2862' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2863' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2112' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctrlr_model' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2115' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='88' column='1' id='e7f43fdb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_from_pool' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='dif_enabled' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='first_fused' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='rsvd' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__100' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2819' column='1' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2821' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pointer' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2824' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2827' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__99' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2809' column='1' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2811' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='extended' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2812' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='msb_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2814' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2815' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__95' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2631' column='1' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='format_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='erase_all_ns' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2633' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='crypto_erase_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2635' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__93' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2608' column='1' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='min' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2609' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='max' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__78' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2324' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='multi_port' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='multi_ctrlr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='sr_iov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='ana_reporting' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__85' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2429' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ns_smart' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='celp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='edlp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='pelp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='lplp' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='da4_telemetry' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='lpa_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2444' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__88' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2491' column='1' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_rpmb_units' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='auth_method' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='total_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='access_size' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2499' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__81' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2370' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmesd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='nvmee' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='nvmsr_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2377' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__89' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2508' column='1' id='e7f43fdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='one_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2510' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2512' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__105' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2896' column='1' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='percentage_remaining' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2897' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='fpi_supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2898' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__104' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2868' column='1' id='e7f43fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='persist' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2870' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='write_exclusive' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2873' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='exclusive_access' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2876' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_exclusive_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='exclusive_access_reg_only' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2882' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='write_exclusive_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2885' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='exclusive_access_all_reg' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2888' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='ignore_existing_key' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2891' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__101' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2831' column='1' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2833' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pit2' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2836' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='pit3' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2839' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2842' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='md_end' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2845' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__102' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2849' column='1' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2851' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='md_start' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2855' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved4' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2857' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__96' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2639' column='1' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='present' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='flush_broadcast' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2642' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__106' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2904' column='1' id='e7f43fde'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2914' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='write_zero_deallocate' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2917' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='guard_value' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2924' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2926' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='617' column='1' id='e7f43fdf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default' filepath='nvme_spec.h' line='618' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='620' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='400' column='1' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secure_channel' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__67' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='296' column='1' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvmf_spec.h' line='298' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__84' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2412' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slot1_ro' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='num_slots' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='activation_without_reset' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='multiple_update_detection' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='frmw_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__83' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2390' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='smbusme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='pcieme' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='mec_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2397' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__86' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2454' column='1' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spec_format' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2456' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='avscc_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2458' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__87' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2462' column='1' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='supported' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='apsta_rsvd' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2466' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__98' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2786' column='1' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thin_prov' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ns_atomic_write_unit' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2791' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='dealloc_or_unwritten_error' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2794' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='guid_never_reused' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2797' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='optperf' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2800' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2802' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__82' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2381' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vwcr' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='vwcrv' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2386' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__107' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2986' column='1' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_protected' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2988' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2989' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='types.h' line='41' column='1' id='33f57a65'/>
    <typedef-decl name='__int8_t' type-id='28577a57' filepath='types.h' line='37' column='1' id='2171a512'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='stdint-intn.h' line='26' column='1' id='3ff5601b'/>
    <typedef-decl name='int8_t' type-id='2171a512' filepath='stdint-intn.h' line='24' column='1' id='ee31ee44'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' filepath='bdev.h' line='1975' column='1' id='065af103'/>
    <typedef-decl name='spdk_iobuf_buffer_stailq_t' type-id='79110b08' filepath='thread.h' line='1076' column='1' id='306e7691'/>
    <typedef-decl name='spdk_iobuf_entry_stailq_t' type-id='ce92b0c6' filepath='thread.h' line='1075' column='1' id='da6a25d9'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='fa35b1b9' filepath='thread.h' line='1062' column='1' id='8b006695'/>
    <typedef-decl name='spdk_nvmf_custom_cmd_hdlr' type-id='6e317635' filepath='nvmf_cmd.h' line='110' column='1' id='04b256a8'/>
    <typedef-decl name='spdk_nvmf_nvme_passthru_cmd_cb' type-id='195c95d4' filepath='nvmf_cmd.h' line='139' column='1' id='e4580111'/>
    <typedef-decl name='spdk_nvmf_poll_group_destroy_done_fn' type-id='1ed1e4cd' filepath='nvmf.h' line='338' column='1' id='c58e4e5b'/>
    <typedef-decl name='spdk_nvmf_state_change_done' type-id='1ed1e4cd' filepath='nvmf_transport.h' line='142' column='1' id='bafe66ec'/>
    <typedef-decl name='spdk_nvmf_transport_create_done_cb' type-id='b3aa21a2' filepath='nvmf.h' line='1297' column='1' id='f5dcf84c'/>
    <typedef-decl name='spdk_nvmf_transport_destroy_done_cb' type-id='b7f9d8e6' filepath='nvmf.h' line='1318' column='1' id='4d534154'/>
    <typedef-decl name='spdk_nvmf_transport_qpair_fini_cb' type-id='b7f9d8e6' filepath='nvmf_transport.h' line='277' column='1' id='f3756df1'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='48' id='45439f56'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='64' id='453ce391'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='128' id='c1c22e6c'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8192' id='25518ee9'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='80' id='b68a110f'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='f0981eeb' id='487da03a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='952' id='1acf0601'>
      <subrange length='119' lower-bound='0' upper-bound='118' type-id='f0981eeb' id='17d80942'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='88' id='ba8c55f2'>
      <subrange length='11' lower-bound='0' upper-bound='10' type-id='f0981eeb' id='847bc017'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='96' id='fa8ef949'>
      <subrange length='12' lower-bound='0' upper-bound='11' type-id='f0981eeb' id='84827bdc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1536' id='f3fa1b1a'>
      <subrange length='192' lower-bound='0' upper-bound='191' type-id='f0981eeb' id='3fea28a9'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='152' id='ba78ce3a'>
      <subrange length='19' lower-bound='0' upper-bound='18' type-id='f0981eeb' id='448ee30f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1632' id='d8dd2858'>
      <subrange length='204' lower-bound='0' upper-bound='203' type-id='f0981eeb' id='531a968b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='160' id='013f0a7a'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1728' id='af0d923d'>
      <subrange length='216' lower-bound='0' upper-bound='215' type-id='f0981eeb' id='83ad04be'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1936' id='90687fee'>
      <subrange length='242' lower-bound='0' upper-bound='241' type-id='f0981eeb' id='ca61f7dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1968' id='d05e5752'>
      <subrange length='246' lower-bound='0' upper-bound='245' type-id='f0981eeb' id='ca576a81'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' id='014804d6'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='20128' id='7d6f480a'>
      <subrange length='2516' lower-bound='0' upper-bound='2515' type-id='f0981eeb' id='2e214a33'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2040' id='629227c2'>
      <subrange length='255' lower-bound='0' upper-bound='254' type-id='f0981eeb' id='36e7f891'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' id='0f4b9e74'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eeb' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='280' id='d0ef8234'>
      <subrange length='35' lower-bound='0' upper-bound='34' type-id='f0981eeb' id='6e6845b5'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='29696' id='74b3417b'>
      <subrange length='3712' lower-bound='0' upper-bound='3711' type-id='f0981eeb' id='c2f2132e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eeb' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='6144' id='be0fa24b'>
      <subrange length='768' lower-bound='0' upper-bound='767' type-id='f0981eeb' id='61a7fc14'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='72' id='cf30f637'>
      <subrange length='9' lower-bound='0' upper-bound='8' type-id='f0981eeb' id='12e4273c'/>
    </array-type-def>
    <union-decl name='nvmf_c2h_msg' size-in-bits='128' visibility='default' filepath='nvmf_transport.h' line='55' column='1' id='1727cb29'>
      <data-member access='public'>
        <var-decl name='nvme_cpl' type-id='72b49d60' visibility='default' filepath='nvmf_transport.h' line='56' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_rsp' type-id='d0bd555e' visibility='default' filepath='nvmf_transport.h' line='57' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_rsp' type-id='c9fa5b46' visibility='default' filepath='nvmf_transport.h' line='58' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='nvmf_h2c_msg' size-in-bits='512' visibility='default' filepath='nvmf_transport.h' line='44' column='1' id='b4148a2d'>
      <data-member access='public'>
        <var-decl name='nvmf_cmd' type-id='8c27fb80' visibility='default' filepath='nvmf_transport.h' line='45' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_cmd' type-id='a0e8c12d' visibility='default' filepath='nvmf_transport.h' line='46' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_set_cmd' type-id='fd1dedf7' visibility='default' filepath='nvmf_transport.h' line='47' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='prop_get_cmd' type-id='7876bfd3' visibility='default' filepath='nvmf_transport.h' line='48' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_cmd' type-id='8fb0506b' visibility='default' filepath='nvmf_transport.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='auth_send_cmd' type-id='5cf82640' visibility='default' filepath='nvmf_transport.h' line='50' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='auth_recv_cmd' type-id='9a628dfe' visibility='default' filepath='nvmf_transport.h' line='51' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' filepath='pthreadtypes.h' line='67' column='1' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default' filepath='pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default' filepath='pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='95e97e5f' visibility='default' filepath='pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_aqa_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='192' column='1' id='d22b9869'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='193' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa3' visibility='default' filepath='nvme_spec.h' line='204' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_async_event_completion' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='3715' column='1' id='b39d579c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='3716' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa4' visibility='default' filepath='nvme_spec.h' line='3723' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cap_register' size-in-bits='64' visibility='default' filepath='nvme_spec.h' line='61' column='1' id='007005ee'>
      <data-member access='public'>
        <var-decl name='raw' type-id='9c313c2d' visibility='default' filepath='nvme_spec.h' line='62' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fba' visibility='default' filepath='nvme_spec.h' line='105' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cc_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='127' column='1' id='f0fcbcb4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='128' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fab' visibility='default' filepath='nvme_spec.h' line='154' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cdata_ctratt' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='2238' column='1' id='627055da'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2239' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb2' visibility='default' filepath='nvme_spec.h' line='2295' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1090' column='1' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fa5' visibility='default' filepath='nvme_spec.h' line='1098' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fb7' visibility='default' filepath='nvme_spec.h' line='1109' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43fd2' visibility='default' filepath='nvme_spec.h' line='1116' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43fc1' visibility='default' filepath='nvme_spec.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43fca' visibility='default' filepath='nvme_spec.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43fcb' visibility='default' filepath='nvme_spec.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43fb1' visibility='default' filepath='nvme_spec.h' line='1148' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43fb0' visibility='default' filepath='nvme_spec.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43fd1' visibility='default' filepath='nvme_spec.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43fd1' visibility='default' filepath='nvme_spec.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fbf' visibility='default' filepath='nvme_spec.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fcf' visibility='default' filepath='nvme_spec.h' line='1184' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fd0' visibility='default' filepath='nvme_spec.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fcc' visibility='default' filepath='nvme_spec.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mgmt_send_recv' type-id='e7f43fb9' visibility='default' filepath='nvme_spec.h' line='1214' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1218' column='1' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fc4' visibility='default' filepath='nvme_spec.h' line='1227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fc6' visibility='default' filepath='nvme_spec.h' line='1237' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fc5' visibility='default' filepath='nvme_spec.h' line='1247' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43fa8' visibility='default' filepath='nvme_spec.h' line='1256' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fc3' visibility='default' filepath='nvme_spec.h' line='1263' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43faa' visibility='default' filepath='nvme_spec.h' line='1269' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default' filepath='nvme_spec.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default' filepath='nvme_spec.h' line='1272' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default' filepath='nvme_spec.h' line='1273' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default' filepath='nvme_spec.h' line='1274' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default' filepath='nvme_spec.h' line='1275' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default' filepath='nvme_spec.h' line='1276' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default' filepath='nvme_spec.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default' filepath='nvme_spec.h' line='1278' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default' filepath='nvme_spec.h' line='1279' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default' filepath='nvme_spec.h' line='1280' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default' filepath='nvme_spec.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default' filepath='nvme_spec.h' line='1282' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default' filepath='nvme_spec.h' line='1283' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default' filepath='nvme_spec.h' line='1284' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default' filepath='nvme_spec.h' line='1285' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw11' type-id='6e30c3b6' visibility='default' filepath='nvme_spec.h' line='1286' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw11' type-id='9e0ac804' visibility='default' filepath='nvme_spec.h' line='1287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fb3' visibility='default' filepath='nvme_spec.h' line='1297' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1301' column='1' id='9583a476'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1302' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fbc' visibility='default' filepath='nvme_spec.h' line='1321' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='copy' type-id='e7f43fbe' visibility='default' filepath='nvme_spec.h' line='1342' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write_zeroes' type-id='e7f43fbd' visibility='default' filepath='nvme_spec.h' line='1360' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_cdw12' type-id='6d30c223' visibility='default' filepath='nvme_spec.h' line='1362' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_fdp_events_cdw12' type-id='a10accbd' visibility='default' filepath='nvme_spec.h' line='1363' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_cmd_cdw13' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1367' column='1' id='9683a609'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1368' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='write' type-id='e7f43fa9' visibility='default' filepath='nvme_spec.h' line='1376' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' filepath='nvme_spec.h' line='865' column='1' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='866' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fda' visibility='default' filepath='nvme_spec.h' line='875' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_csts_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='163' column='1' id='f62d2dc3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='164' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fcd' visibility='default' filepath='nvme_spec.h' line='182' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='697' column='1' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='698' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa2' visibility='default' filepath='nvme_spec.h' line='713' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='882' column='1' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='883' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f9d' visibility='default' filepath='nvme_spec.h' line='894' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='773' column='1' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='774' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd5' visibility='default' filepath='nvme_spec.h' line='783' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1036' column='1' id='6e30c3b6'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1037' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fac' visibility='default' filepath='nvme_spec.h' line='1042' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1049' column='1' id='6d30c223'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1050' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fae' visibility='default' filepath='nvme_spec.h' line='1058' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw11' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1065' column='1' id='9e0ac804'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1066' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc7' visibility='default' filepath='nvme_spec.h' line='1073' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_fdp_events_cdw12' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1080' column='1' id='a10accbd'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1081' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43faf' visibility='default' filepath='nvme_spec.h' line='1086' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='990' column='1' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='991' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fad' visibility='default' filepath='nvme_spec.h' line='997' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='819' column='1' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='820' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd4' visibility='default' filepath='nvme_spec.h' line='829' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='836' column='1' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='837' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb4' visibility='default' filepath='nvme_spec.h' line='846' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='933' column='1' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='934' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fb5' visibility='default' filepath='nvme_spec.h' line='938' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='739' column='1' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='740' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc2' visibility='default' filepath='nvme_spec.h' line='746' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='804' column='1' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='805' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc0' visibility='default' filepath='nvme_spec.h' line='812' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='722' column='1' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='723' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc8' visibility='default' filepath='nvme_spec.h' line='732' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1004' column='1' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1005' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fce' visibility='default' filepath='nvme_spec.h' line='1015' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='1023' column='1' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1024' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fc9' visibility='default' filepath='nvme_spec.h' line='1029' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='753' column='1' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='754' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd6' visibility='default' filepath='nvme_spec.h' line='766' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='790' column='1' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='791' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd7' visibility='default' filepath='nvme_spec.h' line='797' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='854' column='1' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='855' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa7' visibility='default' filepath='nvme_spec.h' line='861' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvme_vs_register' size-in-bits='32' visibility='default' filepath='nvme_spec.h' line='208' column='1' id='900beaa3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='209' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fd3' visibility='default' filepath='nvme_spec.h' line='217' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='spdk_nvmf_transport_specific_address_subtype' size-in-bits='2048' visibility='default' filepath='nvmf_spec.h' line='372' column='1' id='e874a69d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='62946659' visibility='default' filepath='nvmf_spec.h' line='373' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='rdma' type-id='210ab761' visibility='default' filepath='nvmf_spec.h' line='376' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tcp' type-id='6d63b4d7' visibility='default' filepath='nvmf_spec.h' line='379' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='157' column='1' id='ac5ab5a3'>
      <data-member access='public'>
        <var-decl name='first_fused_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='158' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='connect_req' type-id='5f953c61' visibility='default' filepath='nvmf_transport.h' line='159' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__11' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='227' column='1' id='ac5ab5a1'>
      <data-member access='public'>
        <var-decl name='success' type-id='e7f43f9e' visibility='default' filepath='nvmf_spec.h' line='236' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='invalid' type-id='e7f43fa0' visibility='default' filepath='nvmf_spec.h' line='242' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvmf_spec.h' line='244' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1399' column='1' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43fd9' visibility='default' filepath='nvme_spec.h' line='1403' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default' filepath='nvme_spec.h' line='1405' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__15' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2867' column='1' id='ac5ab59e'>
      <data-member access='public'>
        <var-decl name='rescap' type-id='e7f43fdd' visibility='default' filepath='nvme_spec.h' line='2892' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2893' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='616' column='1' id='ac5ab5a0'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43fdf' visibility='default' filepath='nvme_spec.h' line='621' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43fb6' visibility='default' filepath='nvme_spec.h' line='628' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43fd8' visibility='default' filepath='nvme_spec.h' line='635' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__13' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2534' column='1' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='2535' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa1' visibility='default' filepath='nvme_spec.h' line='2539' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__9' size-in-bits='16' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1460' column='1' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='status_raw' type-id='149c6638' visibility='default' filepath='nvme_spec.h' line='1461' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='status' type-id='38ef35c9' visibility='default' filepath='nvme_spec.h' line='1462' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1409' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1410' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default' filepath='nvme_spec.h' line='1411' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1414' column='1' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default' filepath='nvme_spec.h' line='1416' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1419' column='1' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1420' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw12_bits' type-id='9583a476' visibility='default' filepath='nvme_spec.h' line='1421' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='1424' column='1' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='1425' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw13_bits' type-id='9683a609' visibility='default' filepath='nvme_spec.h' line='1426' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__14' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2549' column='1' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default' filepath='nvme_spec.h' line='2550' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fa6' visibility='default' filepath='nvme_spec.h' line='2556' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='nvmf_spec.h' line='303' column='1' id='ac5ab5a2'>
      <data-member access='public'>
        <var-decl name='u64' type-id='9c313c2d' visibility='default' filepath='nvmf_spec.h' line='304' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='e7f43fb8' visibility='default' filepath='nvmf_spec.h' line='308' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvmf_transport.h' line='86' column='1' id='ac5ab5a4'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvmf_transport.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43fdb' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__12' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2506' column='1' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2507' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fdc' visibility='default' filepath='nvme_spec.h' line='2513' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__16' size-in-bits='8' is-anonymous='yes' visibility='default' filepath='nvme_spec.h' line='2902' column='1' id='ac5ab59f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default' filepath='nvme_spec.h' line='2903' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43fde' visibility='default' filepath='nvme_spec.h' line='2927' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eed'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <qualified-type-def type-id='8712472c' const='yes' id='ee6bba01'/>
    <pointer-type-def type-id='ee6bba01' size-in-bits='64' id='7e9611b1'/>
    <qualified-type-def type-id='2b5c05b2' const='yes' id='04246875'/>
    <pointer-type-def type-id='04246875' size-in-bits='64' id='e4504d8d'/>
    <qualified-type-def type-id='d5e31df6' const='yes' id='eae0cbf5'/>
    <pointer-type-def type-id='eae0cbf5' size-in-bits='64' id='9ee0f00d'/>
    <qualified-type-def type-id='c0085c66' const='yes' id='3c200ead'/>
    <pointer-type-def type-id='3c200ead' size-in-bits='64' id='2d76de85'/>
    <pointer-type-def type-id='4489eba4' size-in-bits='64' id='0b42b28e'/>
    <pointer-type-def type-id='a42c4329' size-in-bits='64' id='6e317635'/>
    <pointer-type-def type-id='9987fa2c' size-in-bits='64' id='f01c8a66'/>
    <pointer-type-def type-id='a5fa6261' size-in-bits='64' id='74fade65'/>
    <pointer-type-def type-id='779235a8' size-in-bits='64' id='77cfe0ca'/>
    <pointer-type-def type-id='cc261e8e' size-in-bits='64' id='530e6910'/>
    <pointer-type-def type-id='cd1f57d4' size-in-bits='64' id='ceef4cae'/>
    <pointer-type-def type-id='b2f184bb' size-in-bits='64' id='12bf7de7'/>
    <pointer-type-def type-id='3af3b929' size-in-bits='64' id='37da45cd'/>
    <pointer-type-def type-id='f089fe53' size-in-bits='64' id='dff5464f'/>
    <pointer-type-def type-id='1727cb29' size-in-bits='64' id='adfda87a'/>
    <pointer-type-def type-id='b4148a2d' size-in-bits='64' id='b520ce9e'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <pointer-type-def type-id='9321bf74' size-in-bits='64' id='136d6f32'/>
    <pointer-type-def type-id='136d6f32' size-in-bits='64' id='ad45e2c8'/>
    <pointer-type-def type-id='e8e2ad7d' size-in-bits='64' id='f905ec5d'/>
    <pointer-type-def type-id='71e32ba2' size-in-bits='64' id='29210180'/>
    <pointer-type-def type-id='29210180' size-in-bits='64' id='68f59e9e'/>
    <pointer-type-def type-id='da6a25d9' size-in-bits='64' id='49599bfc'/>
    <pointer-type-def type-id='a0e8c12d' size-in-bits='64' id='538b928d'/>
    <pointer-type-def type-id='72b49d60' size-in-bits='64' id='25e0c706'/>
    <pointer-type-def type-id='514f4721' size-in-bits='64' id='259d0299'/>
    <pointer-type-def type-id='4e56c4fd' size-in-bits='64' id='4b4afe0d'/>
    <pointer-type-def type-id='8712472c' size-in-bits='64' id='6f56757a'/>
    <pointer-type-def type-id='76e51992' size-in-bits='64' id='0e5061b0'/>
    <pointer-type-def type-id='2b5c05b2' size-in-bits='64' id='c80b4130'/>
    <pointer-type-def type-id='6b40ccf0' size-in-bits='64' id='11f30736'/>
    <pointer-type-def type-id='ac930882' size-in-bits='64' id='320252e0'/>
    <pointer-type-def type-id='d5c9cd10' size-in-bits='64' id='28c64746'/>
    <pointer-type-def type-id='28c64746' size-in-bits='64' id='9c226f04'/>
    <pointer-type-def type-id='5f432901' size-in-bits='64' id='58736969'/>
    <pointer-type-def type-id='58736969' size-in-bits='64' id='80aeb479'/>
    <pointer-type-def type-id='407d526b' size-in-bits='64' id='fedf937b'/>
    <pointer-type-def type-id='fedf937b' size-in-bits='64' id='8af4e883'/>
    <pointer-type-def type-id='5507fe79' size-in-bits='64' id='5f953c61'/>
    <pointer-type-def type-id='5f953c61' size-in-bits='64' id='c2edea11'/>
    <pointer-type-def type-id='b954fee4' size-in-bits='64' id='edc76902'/>
    <pointer-type-def type-id='d59a222d' size-in-bits='64' id='8003131d'/>
    <pointer-type-def type-id='97c33c25' size-in-bits='64' id='3dde76d9'/>
    <pointer-type-def type-id='8003131d' size-in-bits='64' id='bbd73f95'/>
    <pointer-type-def type-id='72315d04' size-in-bits='64' id='a30dfc92'/>
    <pointer-type-def type-id='824683eb' size-in-bits='64' id='264c437b'/>
    <pointer-type-def type-id='3c502a10' size-in-bits='64' id='5c292582'/>
    <pointer-type-def type-id='4c09e60e' size-in-bits='64' id='d694a330'/>
    <pointer-type-def type-id='264c437b' size-in-bits='64' id='9b0df883'/>
    <pointer-type-def type-id='84d13285' size-in-bits='64' id='fa35b1b9'/>
    <pointer-type-def type-id='b8ccea9c' size-in-bits='64' id='954ab8fe'/>
    <pointer-type-def type-id='fac56635' size-in-bits='64' id='75e71b91'/>
    <pointer-type-def type-id='77325d92' size-in-bits='64' id='195c95d4'/>
    <pointer-type-def type-id='43668d52' size-in-bits='64' id='b8ede514'/>
    <pointer-type-def type-id='d1f2ad9b' size-in-bits='64' id='8ccb9707'/>
    <pointer-type-def type-id='83beada0' size-in-bits='64' id='63e99c4a'/>
    <pointer-type-def type-id='1bddb57d' size-in-bits='64' id='48ad2459'/>
    <pointer-type-def type-id='8fc2c135' size-in-bits='64' id='22c3e229'/>
    <pointer-type-def type-id='f3304d63' size-in-bits='64' id='7922c62f'/>
    <pointer-type-def type-id='ff4798b4' size-in-bits='64' id='342be2de'/>
    <pointer-type-def type-id='7bc19663' size-in-bits='64' id='fd2aed57'/>
    <pointer-type-def type-id='5850dc77' size-in-bits='64' id='f222e253'/>
    <pointer-type-def type-id='daea9dd8' size-in-bits='64' id='001bdd7a'/>
    <pointer-type-def type-id='b937ef65' size-in-bits='64' id='d83cf1e9'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='10befee0' size-in-bits='64' id='b3aa21a2'/>
    <qualified-type-def type-id='16ee3ce3' const='yes' id='ffac22f8'/>
    <pointer-type-def type-id='ffac22f8' size-in-bits='64' id='4dfad096'/>
    <pointer-type-def type-id='e2580b88' size-in-bits='64' id='d4aefa7e'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7b7cfb3d' size-in-bits='64' id='7cbf4535'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='0094857f' size-in-bits='64' id='3ecde4cf'/>
    <pointer-type-def type-id='68ee9836' size-in-bits='64' id='378e9c1c'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='a7e01876' size-in-bits='64' id='a1c658d4'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='dde78329' size-in-bits='64' id='ba88e9a1'/>
    <pointer-type-def type-id='9ebe04f3' size-in-bits='64' id='53eb2933'/>
    <pointer-type-def type-id='3d201e4a' size-in-bits='64' id='9db48478'/>
    <pointer-type-def type-id='16ee3ce3' size-in-bits='64' id='777df243'/>
    <pointer-type-def type-id='e1824565' size-in-bits='64' id='ae6a5885'/>
    <pointer-type-def type-id='d37dc7a7' size-in-bits='64' id='690b38cf'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <class-decl name='spdk_accel_sequence' is-struct='yes' visibility='default' is-declaration-only='yes' id='e2580b88'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_bdev_desc' is-struct='yes' visibility='default' is-declaration-only='yes' id='43454627'/>
    <class-decl name='spdk_bdev_io' is-struct='yes' visibility='default' is-declaration-only='yes' id='68ee9836'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_nvmf_qpair_auth' is-struct='yes' visibility='default' is-declaration-only='yes' id='3d201e4a'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <function-decl name='spdk_nvmf_ctrlr_connect' mangled-name='spdk_nvmf_ctrlr_connect' filepath='ctrlr.c' line='970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_connect'>
      <parameter type-id='5f953c61' name='req' filepath='ctrlr.c' line='970' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_get_regs' mangled-name='spdk_nvmf_ctrlr_get_regs' filepath='ctrlr.c' line='1197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_get_regs'>
      <parameter type-id='ba88e9a1' name='ctrlr' filepath='ctrlr.c' line='1197' column='1'/>
      <return type-id='9ee0f00d'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_save_migr_data' mangled-name='spdk_nvmf_ctrlr_save_migr_data' filepath='ctrlr.c' line='2120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_save_migr_data'>
      <parameter type-id='ba88e9a1' name='ctrlr' filepath='ctrlr.c' line='2120' column='1'/>
      <parameter type-id='c80b4130' name='data' filepath='ctrlr.c' line='2121' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_restore_migr_data' mangled-name='spdk_nvmf_ctrlr_restore_migr_data' filepath='ctrlr.c' line='2161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_restore_migr_data'>
      <parameter type-id='ba88e9a1' name='ctrlr' filepath='ctrlr.c' line='2161' column='1'/>
      <parameter type-id='e4504d8d' name='data' filepath='ctrlr.c' line='2162' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_identify_ns' mangled-name='spdk_nvmf_ctrlr_identify_ns' filepath='ctrlr.c' line='2818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_identify_ns'>
      <parameter type-id='ba88e9a1' name='ctrlr' filepath='ctrlr.c' line='2818' column='1'/>
      <parameter type-id='538b928d' name='cmd' filepath='ctrlr.c' line='2819' column='1'/>
      <parameter type-id='25e0c706' name='rsp' filepath='ctrlr.c' line='2820' column='1'/>
      <parameter type-id='4b4afe0d' name='nsdata' filepath='ctrlr.c' line='2821' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_nvmf_ctrlr_identify_ns_ext' mangled-name='spdk_nvmf_ctrlr_identify_ns_ext' filepath='ctrlr.c' line='2869' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_nvmf_ctrlr_identify_ns_ext'>
