<abi-corpus version='2.2' soname='libspdk_fsdev.so.1.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_thread.so.10.1'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.6.0'/>
    <dependency name='libspdk_notify.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_fsdev_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_copy_file_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_desc_get_fsdev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_destruct_done' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_fallocate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_fsdev_module_list_find' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_opendir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_read' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_readdir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_readlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_release' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_releasedir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_removexattr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_rename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_rmdir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_set_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_setattr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_setxattr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_statfs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_subsystem_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_symlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_unregister_by_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='fsdev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <enum-decl name='spdk_fsdev_event_type' filepath='fsdev.h' line='29' column='1' id='2766c765'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_EVENT_REMOVE' value='0'/>
    </enum-decl>
    <enum-decl name='spdk_fsdev_io_type' filepath='fsdev_module.h' line='190' column='1' id='12c1ab69'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_IO_LOOKUP' value='0'/>
      <enumerator name='SPDK_FSDEV_IO_FORGET' value='1'/>
      <enumerator name='SPDK_FSDEV_IO_GETATTR' value='2'/>
      <enumerator name='SPDK_FSDEV_IO_SETATTR' value='3'/>
      <enumerator name='SPDK_FSDEV_IO_READLINK' value='4'/>
      <enumerator name='SPDK_FSDEV_IO_SYMLINK' value='5'/>
      <enumerator name='SPDK_FSDEV_IO_MKNOD' value='6'/>
      <enumerator name='SPDK_FSDEV_IO_MKDIR' value='7'/>
      <enumerator name='SPDK_FSDEV_IO_UNLINK' value='8'/>
      <enumerator name='SPDK_FSDEV_IO_RMDIR' value='9'/>
      <enumerator name='SPDK_FSDEV_IO_RENAME' value='10'/>
      <enumerator name='SPDK_FSDEV_IO_LINK' value='11'/>
      <enumerator name='SPDK_FSDEV_IO_OPEN' value='12'/>
      <enumerator name='SPDK_FSDEV_IO_READ' value='13'/>
      <enumerator name='SPDK_FSDEV_IO_WRITE' value='14'/>
      <enumerator name='SPDK_FSDEV_IO_STATFS' value='15'/>
      <enumerator name='SPDK_FSDEV_IO_RELEASE' value='16'/>
      <enumerator name='SPDK_FSDEV_IO_FSYNC' value='17'/>
      <enumerator name='SPDK_FSDEV_IO_SETXATTR' value='18'/>
      <enumerator name='SPDK_FSDEV_IO_GETXATTR' value='19'/>
      <enumerator name='SPDK_FSDEV_IO_LISTXATTR' value='20'/>
      <enumerator name='SPDK_FSDEV_IO_REMOVEXATTR' value='21'/>
      <enumerator name='SPDK_FSDEV_IO_FLUSH' value='22'/>
      <enumerator name='SPDK_FSDEV_IO_OPENDIR' value='23'/>
      <enumerator name='SPDK_FSDEV_IO_READDIR' value='24'/>
      <enumerator name='SPDK_FSDEV_IO_RELEASEDIR' value='25'/>
      <enumerator name='SPDK_FSDEV_IO_FSYNCDIR' value='26'/>
      <enumerator name='SPDK_FSDEV_IO_FLOCK' value='27'/>
      <enumerator name='SPDK_FSDEV_IO_CREATE' value='28'/>
      <enumerator name='SPDK_FSDEV_IO_ABORT' value='29'/>
      <enumerator name='SPDK_FSDEV_IO_FALLOCATE' value='30'/>
      <enumerator name='SPDK_FSDEV_IO_COPY_FILE_RANGE' value='31'/>
      <enumerator name='__SPDK_FSDEV_IO_LAST' value='32'/>
    </enum-decl>
    <enum-decl name='spdk_fsdev_status' filepath='fsdev.h' line='48' column='1' id='476c061a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_FSDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_FSDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_FSDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <class-decl name='__fsdev_internal_fields' size-in-bits='1024' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='167' column='1' id='d5f22443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='fsdev_module.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='476c061a' visibility='default' filepath='fsdev_module.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unregister_cb' type-id='7bff2ab2' visibility='default' filepath='fsdev_module.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='open_descs' type-id='e7f43f72' visibility='default' filepath='fsdev_module.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='fsdev_module.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fsdev_name' type-id='60db09f4' visibility='default' filepath='fsdev_module.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__fsdev_io_internal_fields' size-in-bits='896' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='490' column='1' id='2eacca64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='7f460d6c' visibility='default' filepath='fsdev_module.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='f0f65670' visibility='default' filepath='fsdev_module.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fn' type-id='e975e7e9' visibility='default' filepath='fsdev_module.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='501' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='in_submit_request' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='509' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='type' type-id='12c1ab69' visibility='default' filepath='fsdev_module.h' line='512' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unique' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='515' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='usr_cb_fn' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='518' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='usr_cb_arg' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='521' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='status' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='524' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='fsdev_module.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='buf_link' type-id='e7f43f75' visibility='default' filepath='fsdev_module.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ch_link' type-id='e7f43f74' visibility='default' filepath='fsdev_module.h' line='533' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__fsdev_module_internal_fields' size-in-bits='128' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='73' column='1' id='8ad91680'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f76' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev' size-in-bits='1408' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='146' column='1' id='08bb5c12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='module' type-id='aad364e3' visibility='default' filepath='fsdev_module.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fn_table' type-id='e6cae10f' visibility='default' filepath='fsdev_module.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='opts' type-id='f97d08fa' visibility='default' filepath='fsdev_module.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='internal' type-id='d5f22443' visibility='default' filepath='fsdev_module.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_file_attr' size-in-bits='704' is-struct='yes' visibility='default' filepath='fsdev.h' line='279' column='1' id='b3665c31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ino' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='atime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mtime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ctime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='atimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mtimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mode' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nlink' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='uid' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gid' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='rdev' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='blksize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='valid_ms' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='295' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_file_statfs' size-in-bits='448' is-struct='yes' visibility='default' filepath='fsdev.h' line='298' column='1' id='e618950b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bfree' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bavail' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='files' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ffree' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bsize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='namelen' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='frsize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='306' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_fn_table' size-in-bits='384' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='86' column='1' id='e473dbdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='b9b212f5' visibility='default' filepath='fsdev_module.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='76b7e369' visibility='default' filepath='fsdev_module.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_io_channel' type-id='ddc2673d' visibility='default' filepath='fsdev_module.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='negotiate_opts' type-id='55f9fe32' visibility='default' filepath='fsdev_module.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_config_json' type-id='518fd49e' visibility='default' filepath='fsdev_module.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_memory_domains' type-id='19c4f5a3' visibility='default' filepath='fsdev_module.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_io' size-in-bits='2944' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='226' column='1' id='88fbe88f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fsdev' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='fsdev_module.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='fsdev_module.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u_in' type-id='ac5ab595' visibility='default' filepath='fsdev_module.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='u_out' type-id='ac5ab596' visibility='default' filepath='fsdev_module.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='internal' type-id='2eacca64' visibility='default' filepath='fsdev_module.h' line='534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default' filepath='fsdev_module.h' line='539' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_io_opts' size-in-bits='192' is-struct='yes' visibility='default' filepath='fsdev.h' line='108' column='1' id='22c5338e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='fsdev.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='fsdev.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_module' size-in-bits='448' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='27' column='1' id='3ac83ed3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default' filepath='fsdev_module.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module_fini' type-id='953b12f8' visibility='default' filepath='fsdev_module.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='config_json' type-id='eb9d423e' visibility='default' filepath='fsdev_module.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='fsdev_module.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_ctx_size' type-id='1db260e5' visibility='default' filepath='fsdev_module.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='internal' type-id='8ad91680' visibility='default' filepath='fsdev_module.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_name' size-in-bits='320' is-struct='yes' visibility='default' filepath='fsdev_module.h' line='130' column='1' id='60db09f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fsdev' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f77' visibility='default' filepath='fsdev_module.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_open_opts' size-in-bits='72' is-struct='yes' visibility='default' filepath='fsdev.h' line='76' column='1' id='f97d08fa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_write' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='writeback_cache_enabled' type-id='b96825af' visibility='default' filepath='fsdev.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_opts' size-in-bits='96' is-struct='yes' visibility='default' filepath='fsdev.h' line='56' column='1' id='c6726725'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fsdev_io_pool_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fsdev_io_cache_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' size-in-bits='256' is-struct='yes' visibility='default' filepath='thread.h' line='981' column='1' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='982' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='983' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='984' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='985' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='986' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='429' column='1' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='linkname' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='430' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='896' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='470' column='1' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='fsdev_module.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='offset' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='474' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='463' column='1' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size_only' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='465' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='481' column='1' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='482' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='460' column='1' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='461' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='183' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='55e0801e' visibility='default' filepath='fsdev_module.h' line='183' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='181' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f0f65670' visibility='default' filepath='fsdev_module.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='adc9efae' visibility='default' filepath='fsdev_module.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='704' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='423' column='1' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='424' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='448' column='1' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='449' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='349' column='1' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffer' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='352' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='336' column='1' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='341' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='343' column='1' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='346' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='347' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='354' column='1' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='356' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='419' column='1' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='421' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='331' column='1' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='datasync' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='399' column='1' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='length' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='404' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='382' column='1' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='operation' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='385' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='304' column='1' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offs' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default' filepath='fsdev_module.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts' type-id='d69566d4' visibility='default' filepath='fsdev_module.h' line='312' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='314' column='1' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offs' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iov' type-id='2c556848' visibility='default' filepath='fsdev_module.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts' type-id='d69566d4' visibility='default' filepath='fsdev_module.h' line='322' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='896' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='249' column='1' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='to_set' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='832' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='476' column='1' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='479' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='366' column='1' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='367' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='368' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entry_cb_fn' type-id='1cc9a68b' visibility='default' filepath='fsdev_module.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='usr_entry_cb_fn' type-id='18bd2393' visibility='default' filepath='fsdev_module.h' line='371' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='245' column='1' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='247' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='295' column='1' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='new_parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='298' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='300' column='1' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='302' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='241' column='1' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nlookup' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='243' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='255' column='1' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='406' column='1' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject_in' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle_in' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='off_in' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fobject_out' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fhandle_out' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='off_out' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='265' column='1' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rdev' type-id='8504f260' visibility='default' filepath='fsdev_module.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='273' column='1' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='278' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='387' column='1' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='391' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='umask' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='394' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='288' column='1' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='new_parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='new_name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='293' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='237' column='1' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='258' column='1' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='target' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='linkpath' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='263' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='457' column='1' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='statfs' type-id='e618950b' visibility='default' filepath='fsdev_module.h' line='458' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='530' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='ebe2c337' visibility='default' filepath='fsdev_module.h' line='530' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='527' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ebe2c337' visibility='default' filepath='fsdev_module.h' line='527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='72f926a7' visibility='default' filepath='fsdev_module.h' line='527' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='74' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='aad364e3' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b3c7a86b' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='133' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='451' column='1' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='452' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='396' column='1' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unique_to_abort' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='397' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='f0981eeb' filepath='types.h' line='145' column='1' id='35ed8932'/>
    <typedef-decl name='__gid_t' type-id='f0981eec' filepath='types.h' line='147' column='1' id='d94ec6d9'/>
    <typedef-decl name='__mode_t' type-id='f0981eec' filepath='types.h' line='150' column='1' id='e1c52942'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='__uid_t' type-id='f0981eec' filepath='types.h' line='146' column='1' id='cc5fcceb'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='dev_t' type-id='35ed8932' filepath='types.h' line='59' column='1' id='8504f260'/>
    <typedef-decl name='gid_t' type-id='d94ec6d9' filepath='types.h' line='64' column='1' id='2bb2b96f'/>
    <typedef-decl name='mode_t' type-id='e1c52942' filepath='types.h' line='69' column='1' id='d50d396c'/>
    <typedef-decl name='off_t' type-id='79989e9c' filepath='stdio.h' line='63' column='1' id='ad707ada'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' filepath='pthreadtypes.h' line='103' column='1' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_fsdev_event_cb_t' type-id='51592245' filepath='fsdev.h' line='40' column='1' id='f5bf2e9f'/>
    <typedef-decl name='spdk_fsdev_fini_cb' type-id='b7f9d8e6' filepath='fsdev.h' line='140' column='1' id='c17a5d68'/>
    <typedef-decl name='spdk_fsdev_init_cb' type-id='1ed1e4cd' filepath='fsdev.h' line='133' column='1' id='94168d2e'/>
    <typedef-decl name='spdk_fsdev_io_completion_cb' type-id='8a2af2bc' filepath='fsdev_module.h' line='128' column='1' id='e975e7e9'/>
    <typedef-decl name='spdk_fsdev_readdir_entry_cb' type-id='62951185' filepath='fsdev.h' line='1164' column='1' id='fee029bc'/>
    <typedef-decl name='spdk_fsdev_unregister_cb' type-id='1ed1e4cd' filepath='fsdev_module.h' line='78' column='1' id='7bff2ab2'/>
    <typedef-decl name='uid_t' type-id='cc5fcceb' filepath='types.h' line='79' column='1' id='354978ed'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='-1' type-id='f0981eeb' id='031f2035'/>
    </array-type-def>
    <union-decl name='__anonymous_union__1' size-in-bits='896' is-anonymous='yes' visibility='default' filepath='fsdev_module.h' line='418' column='1' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='lookup' type-id='e7f43f83' visibility='default' filepath='fsdev_module.h' line='422' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='getattr' type-id='e7f43f7d' visibility='default' filepath='fsdev_module.h' line='425' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='setattr' type-id='e7f43f7d' visibility='default' filepath='fsdev_module.h' line='428' column='1'/>
      </data-member>
      <data-member access='public'>
