<abi-corpus version='2.4' soname='libspdk_vmd.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vmd_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_get_led_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_hotplug_monitor' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_pci_device_list' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_remove_device' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_rescan' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vmd_set_led_state' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <undefined-elf-function-symbols>
    <elf-symbol name='__assert_fail' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__cxa_finalize' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__stack_chk_fail' version='GLIBC_2.4' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='calloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_delay_us' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_compare' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_fmt' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_read32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_cfg_write32' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_detach' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_numa_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_get_type' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_device_map_bar' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_enumerate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_hook_device' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_nvme_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_register_device_provider' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_unhook_device' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_vmd_get_driver' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='led.c' language='LANG_C11'>
    <enum-decl name='spdk_vmd_led_state' size-in-bits='32' alignment-in-bits='32' filepath='vmd.h' line='47' column='1' hash='07d5420aab1123a9' id='bf22a0ae'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_VMD_LED_STATE_OFF' value='0'/>
      <enumerator name='SPDK_VMD_LED_STATE_IDENTIFY' value='1'/>
      <enumerator name='SPDK_VMD_LED_STATE_FAULT' value='2'/>
      <enumerator name='SPDK_VMD_LED_STATE_REBUILD' value='3'/>
      <enumerator name='SPDK_VMD_LED_STATE_UNKNOWN' value='4'/>
    </enum-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <pointer-type-def type-id='bf22a0ae' size-in-bits='64' hash='b2566587d8e37da7' id='ca881af7'/>
    <function-decl name='spdk_vmd_set_led_state' mangled-name='spdk_vmd_set_led_state' filepath='led.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_set_led_state' hash='8e401ff204b5436f'>
      <parameter type-id='efc5406b' name='pci_device' filepath='led.c' line='106' column='1'/>
      <parameter type-id='bf22a0ae' name='state' filepath='led.c' line='106' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_get_led_state' mangled-name='spdk_vmd_get_led_state' filepath='led.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_get_led_state' hash='a0c01b423de4de43'>
      <parameter type-id='efc5406b' name='pci_device' filepath='led.c' line='126' column='1'/>
      <parameter type-id='ca881af7' name='state' filepath='led.c' line='126' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vmd.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='_spdk_pci_device_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='env.h' line='776' column='1' hash='38fc92e059e2dd5b' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default' filepath='env.h' line='777' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default' filepath='env.h' line='778' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default' filepath='env.h' line='780' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default' filepath='env.h' line='781' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default' filepath='env.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' is-struct='yes' visibility='default' size-in-bits='960' filepath='env.h' line='756' column='1' hash='f69b0a5b42882896' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default' filepath='env.h' line='757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default' filepath='env.h' line='758' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default' filepath='env.h' line='759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default' filepath='env.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default' filepath='env.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='1b5ad344' visibility='default' filepath='env.h' line='767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='50305372' visibility='default' filepath='env.h' line='769' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='e25894ac' visibility='default' filepath='env.h' line='771' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='e25894ac' visibility='default' filepath='env.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default' filepath='env.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' is-struct='yes' visibility='default' size-in-bits='96' filepath='env.h' line='741' column='1' hash='12edc1ed2493e379' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default' filepath='env.h' line='742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='743' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default' filepath='env.h' line='744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default' filepath='env.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default' filepath='env.h' line='746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='env.h' line='788' column='1' hash='75df1d70e5e3877c' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default' filepath='env.h' line='788' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='env.h' line='761' column='1' hash='dc65722026032fd3' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='numa_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='762' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default' filepath='env.h' line='763' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='ec72f59a' const='yes' hash='8cb57170cfd4e37e' id='e81a0cd5'/>
    <pointer-type-def type-id='e81a0cd5' size-in-bits='64' hash='932c19ff3f78ba32' id='6002756d'/>
    <pointer-type-def type-id='d8ef6f95' size-in-bits='64' hash='fd7a63c0c6c822c4' id='50305372'/>
    <pointer-type-def type-id='fa9ac61d' size-in-bits='64' hash='fd7a63c0c6c822c4' id='1b5ad344'/>
    <pointer-type-def type-id='e704d407' size-in-bits='64' hash='fd7a63c0c6c822c4' id='e25894ac'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' hash='4670fa82230db99b' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' hash='8bc7219f41f400e9' id='b4842653'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <function-decl name='spdk_vmd_pci_device_list' mangled-name='spdk_vmd_pci_device_list' filepath='vmd.c' line='1328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_pci_device_list' hash='4413e9ea99d2f810'>
      <parameter type-id='ec72f59a' name='vmd_addr' filepath='vmd.c' line='1328' column='1'/>
      <parameter type-id='efc5406b' name='nvme_list' filepath='vmd.c' line='1328' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_hotplug_monitor' mangled-name='spdk_vmd_hotplug_monitor' filepath='vmd.c' line='1415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_hotplug_monitor' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_remove_device' mangled-name='spdk_vmd_remove_device' filepath='vmd.c' line='1452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_remove_device' hash='c5128a7c8af1bf3f'>
      <parameter type-id='6002756d' name='addr' filepath='vmd.c' line='1452' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_rescan' mangled-name='spdk_vmd_rescan' filepath='vmd.c' line='1468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_rescan' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_init' mangled-name='spdk_vmd_init' filepath='vmd.c' line='1552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_init' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vmd_fini' mangled-name='spdk_vmd_fini' filepath='vmd.c' line='1558' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vmd_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='35f9072fdd1fcb6c' id='d8ef6f95'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='05b34402ba93ca54' id='fa9ac61d'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='5d6479ae'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='62d730029a69659a' id='e704d407'>
      <parameter type-id='efc5406b'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
</abi-corpus>
