<abi-corpus version='2.4' soname='libspdk_event.so.14.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libspdk_thread.so.10.1'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.6.0'/>
    <dependency name='libspdk_trace.so.11.0'/>
    <dependency name='libspdk_init.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_app_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_get_core_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_get_shm_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_parse_args' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_parse_core_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_app_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='optarg' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_fini' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_core_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_current_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_first_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_last_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_next_core' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_init' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_opts_init' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_thread_launch_pinned' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_thread_wait_all' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_tid' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_put_bulk' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_pci_addr_parse' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_dequeue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_enqueue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='app.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' hash='99641d293d1da856' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_app_parse_args_rvals' size-in-bits='32' alignment-in-bits='32' filepath='event.h' line='296' column='1' hash='7ac24e1a8ddb24e7' id='306d7417'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_APP_PARSE_ARGS_HELP' value='0'/>
      <enumerator name='SPDK_APP_PARSE_ARGS_SUCCESS' value='1'/>
      <enumerator name='SPDK_APP_PARSE_ARGS_FAIL' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_log_level' size-in-bits='32' alignment-in-bits='32' filepath='log.h' line='52' column='1' hash='f54503d906878e62' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eed' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='option' is-struct='yes' visibility='default' size-in-bits='256' filepath='getopt_ext.h' line='50' column='1' hash='33a89ab7bdb41ee9' id='c2fcfcfc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='getopt_ext.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='has_arg' type-id='95e97e5e' visibility='default' filepath='getopt_ext.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flag' type-id='7292109c' visibility='default' filepath='getopt_ext.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='val' type-id='95e97e5e' visibility='default' filepath='getopt_ext.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_app_opts' is-struct='yes' visibility='default' size-in-bits='2024' filepath='event.h' line='63' column='1' hash='cc606a8e6f8b2b8a' id='5a40a4ca'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='event.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='json_config_file' type-id='80f4b756' visibility='default' filepath='event.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='json_config_ignore_errors' type-id='c894953d' visibility='default' filepath='event.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='reserved17' type-id='d3538ec5' visibility='default' filepath='event.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rpc_addr' type-id='80f4b756' visibility='default' filepath='event.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='reactor_mask' type-id='80f4b756' visibility='default' filepath='event.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tpoint_group_mask' type-id='80f4b756' visibility='default' filepath='event.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shm_id' type-id='95e97e5e' visibility='default' filepath='event.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='reserved52' type-id='d351502e' visibility='default' filepath='event.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='shutdown_cb' type-id='87a01893' visibility='default' filepath='event.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='enable_coredump' type-id='c894953d' visibility='default' filepath='event.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='reserved65' type-id='d3490169' visibility='default' filepath='event.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='mem_channel' type-id='95e97e5e' visibility='default' filepath='event.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='main_core' type-id='95e97e5e' visibility='default' filepath='event.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='mem_size' type-id='95e97e5e' visibility='default' filepath='event.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='no_pci' type-id='c894953d' visibility='default' filepath='event.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='648'>
        <var-decl name='hugepage_single_segments' type-id='c894953d' visibility='default' filepath='event.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='unlink_hugepage' type-id='c894953d' visibility='default' filepath='event.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='664'>
        <var-decl name='no_huge' type-id='c894953d' visibility='default' filepath='event.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='reserved84' type-id='d351502e' visibility='default' filepath='event.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='hugedir' type-id='80f4b756' visibility='default' filepath='event.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_level' type-id='4271cbce' visibility='default' filepath='event.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reserved100' type-id='d351502e' visibility='default' filepath='event.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='num_pci_addr' type-id='b59d7dce' visibility='default' filepath='event.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='pci_blocked' type-id='a714fad8' visibility='default' filepath='event.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='pci_allowed' type-id='a714fad8' visibility='default' filepath='event.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='iova_mode' type-id='80f4b756' visibility='default' filepath='event.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='delay_subsystem_init' type-id='c894953d' visibility='default' filepath='event.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1096'>
        <var-decl name='reserved137' type-id='d3538ec5' visibility='default' filepath='event.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='num_entries' type-id='9c313c2d' visibility='default' filepath='event.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='env_context' type-id='eaa32e2f' visibility='default' filepath='event.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='log' type-id='c7712a73' visibility='default' filepath='event.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='base_virtaddr' type-id='9c313c2d' visibility='default' filepath='event.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='event.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='disable_signal_handlers' type-id='c894953d' visibility='default' filepath='event.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1480'>
        <var-decl name='interrupt_mode' type-id='c894953d' visibility='default' filepath='event.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1488'>
        <var-decl name='enforce_numa' type-id='c894953d' visibility='default' filepath='event.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1496'>
        <var-decl name='reserved187' type-id='0f4ddd0b' visibility='default' filepath='event.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='msg_mempool_size' type-id='b59d7dce' visibility='default' filepath='event.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='rpc_allowlist' type-id='7d3cd834' visibility='default' filepath='event.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='vf_token' type-id='80f4b756' visibility='default' filepath='event.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='lcore_map' type-id='80f4b756' visibility='default' filepath='event.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='rpc_log_level' type-id='4271cbce' visibility='default' filepath='event.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1824'>
        <var-decl name='rpc_log_file' type-id='822cd80b' visibility='default' filepath='event.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1888'>
        <var-decl name='json_data' type-id='eaa32e2f' visibility='default' filepath='event.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1952'>
        <var-decl name='json_data_size' type-id='b59d7dce' visibility='default' filepath='event.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='disable_cpumask_locks' type-id='c894953d' visibility='default' filepath='event.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_addr' is-struct='yes' visibility='default' size-in-bits='64' filepath='env.h' line='734' column='1' hash='bd84e20dec7b7e10' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default' filepath='env.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default' filepath='env.h' line='736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default' filepath='env.h' line='737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default' filepath='env.h' line='738' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='logfunc' type-id='bba1f737' size-in-bits='64' filepath='log.h' line='32' column='1' id='049770e8'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_app_parse_args_rvals_t' type-id='306d7417' size-in-bits='32' alignment-in-bits='32' filepath='event.h' line='301' column='1' hash='7ac24e1a8ddb24e7' id='cffec760'/>
    <typedef-decl name='spdk_app_shutdown_cb' type-id='c640490b' size-in-bits='64' filepath='event.h' line='51' column='1' hash='fd7a63c0c6c822c4' id='87a01893'/>
    <typedef-decl name='spdk_msg_fn' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='90' column='1' hash='fd7a63c0c6c822c4' id='de128c99'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' hash='87dcd7386226cc55' id='0f4ddd0b'>
      <subrange length='5' lower-bound='0' upper-bound='4' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5aa5cef1e1be46c9' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' hash='39fc40d7ba4ca689' id='b7f2d5e6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' hash='a93039fe023ed77b' id='9b23c9ad'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' hash='cea1d4b0943594a3' id='7d3cd834'/>
    <qualified-type-def type-id='95e97e5e' const='yes' hash='8cef8df4b6728924' id='2448a865'/>
    <qualified-type-def type-id='c2fcfcfc' const='yes' hash='8107e242a683c4b2' id='c6b5b625'/>
    <pointer-type-def type-id='c6b5b625' size-in-bits='64' hash='ff2b4f8f70cdde2a' id='df0d999d'/>
    <pointer-type-def type-id='2c8a387a' size-in-bits='64' hash='fd7a63c0c6c822c4' id='f5cf97af'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='7292109c'/>
    <pointer-type-def type-id='049770e8' size-in-bits='64' hash='cf7ed5dbfbbab1cb' id='c7712a73'/>
    <pointer-type-def type-id='5a40a4ca' size-in-bits='64' hash='72522e7242f36037' id='94aede68'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' hash='699a45d446346234' id='a714fad8'/>
    <pointer-type-def type-id='30a82da4' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c640490b'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='61359e15'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <var-decl name='g_scheduling_in_progress' type-id='c894953d' visibility='default' filepath='event.h' line='99' column='1'/>
    <function-decl name='spdk_app_get_shm_id' mangled-name='spdk_app_get_shm_id' filepath='app.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_get_shm_id' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_app_start_shutdown' mangled-name='spdk_app_start_shutdown' filepath='app.c' line='241' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_start_shutdown' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_app_opts_init' mangled-name='spdk_app_opts_init' filepath='app.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_opts_init' hash='971d02aa29675c98'>
      <parameter type-id='94aede68' name='opts' filepath='app.c' line='293' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='app.c' line='293' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_app_start' mangled-name='spdk_app_start' filepath='app.c' line='806' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_start' hash='848b69f8868417c0'>
      <parameter type-id='94aede68' name='opts_user' filepath='app.c' line='806' column='1'/>
      <parameter type-id='de128c99' name='start_fn' filepath='app.c' line='806' column='1'/>
      <parameter type-id='eaa32e2f' name='arg1' filepath='app.c' line='807' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_app_fini' mangled-name='spdk_app_fini' filepath='app.c' line='996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_fini' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_app_stop' mangled-name='spdk_app_stop' filepath='app.c' line='1058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_stop' hash='388da3fa973fde78'>
      <parameter type-id='95e97e5e' name='rc' filepath='app.c' line='1058' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_app_parse_args' mangled-name='spdk_app_parse_args' filepath='app.c' line='1157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_parse_args' hash='6453315a5f1a1836'>
      <parameter type-id='95e97e5e' name='argc' filepath='app.c' line='1157' column='1'/>
      <parameter type-id='9b23c9ad' name='argv' filepath='app.c' line='1157' column='1'/>
      <parameter type-id='94aede68' name='opts' filepath='app.c' line='1157' column='1'/>
      <parameter type-id='80f4b756' name='app_getopt_str' filepath='app.c' line='1158' column='1'/>
      <parameter type-id='df0d999d' name='app_long_opts' filepath='app.c' line='1158' column='1'/>
      <parameter type-id='f5cf97af' name='app_parse' filepath='app.c' line='1159' column='1'/>
      <parameter type-id='c640490b' name='app_usage' filepath='app.c' line='1160' column='1'/>
      <return type-id='cffec760'/>
    </function-decl>
    <function-decl name='spdk_app_usage' mangled-name='spdk_app_usage' filepath='app.c' line='1485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_app_usage' hash='7f32ffea222edbe7'>
      <return type-id='48b5725f'/>
    </function-decl>
    <var-decl name='optarg' type-id='26a90f95' visibility='default' filepath='getopt_core.h' line='36' column='1' elf-symbol-id='optarg'/>
    <var-decl name='stdout' type-id='822cd80b' visibility='default' filepath='stdio.h' line='150' column='1' elf-symbol-id='stdout'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='302b1c359411de9b' id='2c8a387a'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='26a90f95'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='28648b863d4bd105' id='bba1f737'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2448a865'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='30a82da4'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='b39d85cf'>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='reactor.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' size-in-bits='32' alignment-in-bits='32' filepath='json.h' line='21' column='1' hash='4b975249c4c2bd4a' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='rusage' is-struct='yes' visibility='default' size-in-bits='1152' filepath='struct_rusage.h' line='33' column='1' hash='2d923068be2002f7' id='d638a840'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ru_utime' type-id='2a693ac3' visibility='default' filepath='struct_rusage.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ru_stime' type-id='2a693ac3' visibility='default' filepath='struct_rusage.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='' type-id='ac5ab59e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='' type-id='ac5ab59f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='' type-id='ac5ab5a0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='' type-id='ac5ab5a1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='' type-id='ac5ab5a2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_cpuset' is-struct='yes' visibility='default' size-in-bits='3080' filepath='cpuset.h' line='25' column='1' hash='c4979574ded471d6' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_event' is-struct='yes' visibility='default' size-in-bits='256' filepath='event.h' line='20' column='1' hash='8a9cff3dfddcb8c7' id='6dfc2c68'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lcore' type-id='8f92235e' visibility='default' filepath='event.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fn' type-id='10517ed6' visibility='default' filepath='event.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='arg1' type-id='eaa32e2f' visibility='default' filepath='event.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='arg2' type-id='eaa32e2f' visibility='default' filepath='event.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_governor' is-struct='yes' visibility='default' size-in-bits='832' filepath='scheduler.h' line='34' column='1' hash='49b89c3062f94687' id='a0f82e92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='scheduler.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get_core_avail_freqs' type-id='5c21b3b1' visibility='default' filepath='scheduler.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_core_curr_freq' type-id='62bb02b3' visibility='default' filepath='scheduler.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='core_freq_up' type-id='24f28d92' visibility='default' filepath='scheduler.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='core_freq_down' type-id='24f28d92' visibility='default' filepath='scheduler.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_core_freq_max' type-id='24f28d92' visibility='default' filepath='scheduler.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='set_core_freq_min' type-id='24f28d92' visibility='default' filepath='scheduler.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_core_capabilities' type-id='ed7097fe' visibility='default' filepath='scheduler.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dump_info_json' type-id='494cdc6d' visibility='default' filepath='scheduler.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='init' type-id='65e3965a' visibility='default' filepath='scheduler.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='deinit' type-id='c640490b' visibility='default' filepath='scheduler.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='scheduler.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_governor_capabilities' is-struct='yes' visibility='default' size-in-bits='8' filepath='scheduler.h' line='25' column='1' hash='1a57f55f33ab729d' id='63a1fe5d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='priority' type-id='c894953d' visibility='default' filepath='scheduler.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' is-struct='yes' visibility='default' size-in-bits='128' filepath='json.h' line='36' column='1' hash='8563d681b49b84d7' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lw_thread' is-struct='yes' visibility='default' size-in-bits='512' filepath='event.h' line='35' column='1' hash='3627a70488ff551c' id='69d037f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='event.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tsc_start' type-id='9c313c2d' visibility='default' filepath='event.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lcore' type-id='8f92235e' visibility='default' filepath='event.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='resched' type-id='c894953d' visibility='default' filepath='event.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='total_stats' type-id='06899014' visibility='default' filepath='event.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='current_stats' type-id='06899014' visibility='default' filepath='event.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reactor' is-struct='yes' visibility='default' size-in-bits='5632' filepath='event.h' line='53' column='1' hash='a166257b75c81250' id='31ac3ab6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='threads' type-id='e7f43f74' visibility='default' filepath='event.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread_count' type-id='8f92235e' visibility='default' filepath='event.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='lcore' type-id='8f92235e' visibility='default' filepath='event.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='e7f43f75' visibility='default' filepath='event.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tsc_last' type-id='9c313c2d' visibility='default' filepath='event.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='events' type-id='b2192338' visibility='default' filepath='event.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='events_fd' type-id='95e97e5e' visibility='default' filepath='event.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='rusage' type-id='d638a840' visibility='default' filepath='event.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='last_rusage' type-id='9c313c2d' visibility='default' filepath='event.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='busy_tsc' type-id='9c313c2d' visibility='default' filepath='event.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='idle_tsc' type-id='9c313c2d' visibility='default' filepath='event.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='notify_cpuset' type-id='aec5215a' visibility='default' filepath='event.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4872'>
        <var-decl name='in_interrupt' type-id='c894953d' visibility='default' filepath='event.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4880'>
        <var-decl name='set_interrupt_mode_in_progress' type-id='c894953d' visibility='default' filepath='event.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4888'>
        <var-decl name='new_in_interrupt' type-id='c894953d' visibility='default' filepath='event.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4928'>
        <var-decl name='set_interrupt_mode_cb_fn' type-id='472c805e' visibility='default' filepath='event.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4992'>
        <var-decl name='set_interrupt_mode_cb_arg' type-id='eaa32e2f' visibility='default' filepath='event.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='fgrp' type-id='eb7a8954' visibility='default' filepath='event.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5120'>
        <var-decl name='resched_fd' type-id='95e97e5e' visibility='default' filepath='event.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scheduler' is-struct='yes' visibility='default' size-in-bits='512' filepath='scheduler.h' line='202' column='1' hash='8ab527edc32a00c7' id='7b3bb32d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='scheduler.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='65e3965a' visibility='default' filepath='scheduler.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='deinit' type-id='c640490b' visibility='default' filepath='scheduler.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='balance' type-id='42ef8d62' visibility='default' filepath='scheduler.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='set_opts' type-id='51610000' visibility='default' filepath='scheduler.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='get_opts' type-id='46bc0678' visibility='default' filepath='scheduler.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='link' type-id='e7f43f76' visibility='default' filepath='scheduler.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scheduler_core_info' is-struct='yes' visibility='default' size-in-bits='512' filepath='scheduler.h' line='183' column='1' hash='2dd7e90ae4d6ae77' id='5cbe6f5a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='total_idle_tsc' type-id='9c313c2d' visibility='default' filepath='scheduler.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='total_busy_tsc' type-id='9c313c2d' visibility='default' filepath='scheduler.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current_idle_tsc' type-id='9c313c2d' visibility='default' filepath='scheduler.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='current_busy_tsc' type-id='9c313c2d' visibility='default' filepath='scheduler.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lcore' type-id='8f92235e' visibility='default' filepath='scheduler.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='threads_count' type-id='8f92235e' visibility='default' filepath='scheduler.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='interrupt_mode' type-id='c894953d' visibility='default' filepath='scheduler.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='thread_infos' type-id='85292a93' visibility='default' filepath='scheduler.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='isolated' type-id='c894953d' visibility='default' filepath='scheduler.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scheduler_thread_info' is-struct='yes' visibility='default' size-in-bits='384' filepath='scheduler.h' line='171' column='1' hash='713e4e8eb1144ee8' id='6f51cdb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lcore' type-id='8f92235e' visibility='default' filepath='scheduler.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread_id' type-id='9c313c2d' visibility='default' filepath='scheduler.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='total_stats' type-id='06899014' visibility='default' filepath='scheduler.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='current_stats' type-id='06899014' visibility='default' filepath='scheduler.h' line='177' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_thread_stats' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread.h' line='478' column='1' hash='2aa08a1a07e79c20' id='06899014'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='busy_tsc' type-id='9c313c2d' visibility='default' filepath='thread.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idle_tsc' type-id='9c313c2d' visibility='default' filepath='thread.h' line='480' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timeval' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_timeval.h' line='8' column='1' hash='bc6c194f1d75b24d' id='2a693ac3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='65eda9c0' visibility='default' filepath='struct_timeval.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_usec' type-id='5b102a54' visibility='default' filepath='struct_timeval.h' line='15' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='scheduler.h' line='125' column='1' hash='1dccebcfafb55c41' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='c8ac65e0' visibility='default' filepath='scheduler.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b1643cfe' visibility='default' filepath='scheduler.h' line='125' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='event.h' line='36' column='1' hash='33c1a6825c148f3d#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='82e1fcbc' visibility='default' filepath='event.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='9fc0a022' visibility='default' filepath='event.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='event.h' line='55' column='1' hash='32cb290fb6740a24#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='82e1fcbc' visibility='default' filepath='event.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='9fc0a022' visibility='default' filepath='event.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='scheduler.h' line='241' column='1' hash='8a5ea28e3120058e#4' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='c4221ffd' visibility='default' filepath='scheduler.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='98b81f75' visibility='default' filepath='scheduler.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='event.h' line='61' column='1' hash='4f54be34dc72e06f#5' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='is_valid' type-id='8f92235e' visibility='default' filepath='event.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default' filepath='event.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__suseconds_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='162' column='1' hash='b119fe0931d2ee10' id='5b102a54'/>
    <typedef-decl name='__syscall_slong_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='197' column='1' hash='b119fe0931d2ee10' id='03085adc'/>
    <typedef-decl name='__time_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='160' column='1' hash='b119fe0931d2ee10' id='65eda9c0'/>
    <typedef-decl name='spdk_event_fn' type-id='30f9af41' size-in-bits='64' filepath='event.h' line='36' column='1' hash='fd7a63c0c6c822c4' id='10517ed6'/>
    <typedef-decl name='spdk_reactor_set_interrupt_mode_cb' type-id='30f9af41' size-in-bits='64' filepath='event.h' line='51' column='1' hash='fd7a63c0c6c822c4' id='472c805e'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <union-decl name='__anonymous_union__2' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='struct_rusage.h' line='53' column='1' hash='30f8b1aeec09f052' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='ru_idrss' type-id='95e97e5f' visibility='default' filepath='struct_rusage.h' line='55' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_idrss_word' type-id='03085adc' visibility='default' filepath='struct_rusage.h' line='56' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='struct_rusage.h' line='85' column='1' hash='8fdea732b2ceb7be#2' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='ru_inblock' type-id='95e97e5f' visibility='default' filepath='struct_rusage.h' line='87' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_inblock_word' type-id='03085adc' visibility='default' filepath='struct_rusage.h' line='88' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='struct_rusage.h' line='59' column='1' hash='fa7da6a7c6845457#3' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='ru_isrss' type-id='95e97e5f' visibility='default' filepath='struct_rusage.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_isrss_word' type-id='03085adc' visibility='default' filepath='struct_rusage.h' line='62' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='struct_rusage.h' line='47' column='1' hash='53f8047455cae5f7#4' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='ru_ixrss' type-id='95e97e5f' visibility='default' filepath='struct_rusage.h' line='49' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__ru_ixrss_word' type-id='03085adc' visibility='default' filepath='struct_rusage.h' line='50' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='struct_rusage.h' line='72' column='1' hash='dce760d6aa160f26#5' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='ru_majflt' type-id='95e97e5f' visibility='default' filepath='struct_rusage.h' line='74' column='1'/>
      </data-member>
