<abi-corpus version='2.2' soname='libspdk_ut_mock.so.6.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <abi-instr address-size='64' path='mock.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <class-decl name='ut_mqe_calloc' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='146' column='1' id='8730c7b5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='eaa32e2f' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqe_pthread_mutex_init' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='148' column='1' id='6cd39edc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='95e97e5e' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqe_pthread_mutexattr_init' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='151' column='1' id='f0b6b5e9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='95e97e5e' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqe_recvmsg' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='154' column='1' id='68cf04f8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='79a0948f' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f75' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqe_sendmsg' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='156' column='1' id='abfb0ad2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='79a0948f' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f76' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqe_writev' size-in-bits='192' is-struct='yes' visibility='default' filepath='mock.h' line='158' column='1' id='fa994560'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='val' type-id='79a0948f' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='link' type-id='e7f43f77' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_calloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='146' column='1' id='1b7abefc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='47574c75' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ad6d398d' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_pthread_mutex_init' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='148' column='1' id='7ffaf2e5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='d1301e9a' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='fec04f10' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_pthread_mutexattr_init' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='151' column='1' id='0d7ddfb4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f9913cd1' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='daa2ff21' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_recvmsg' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='154' column='1' id='6cf032e7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='d511658e' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='0e63012c' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_sendmsg' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='156' column='1' id='27b5b1bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='d7ecc0f0' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c3b3972e' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ut_mqh_writev' size-in-bits='128' is-struct='yes' visibility='default' filepath='mock.h' line='158' column='1' id='767203dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='bbc77b46' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='07074b04' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='146' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='47574c75' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ad6d398d' visibility='default' filepath='mock.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='148' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='d1301e9a' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fec04f10' visibility='default' filepath='mock.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='151' column='1' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f9913cd1' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='daa2ff21' visibility='default' filepath='mock.h' line='151' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='154' column='1' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='d511658e' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='0e63012c' visibility='default' filepath='mock.h' line='154' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='156' column='1' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='d7ecc0f0' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c3b3972e' visibility='default' filepath='mock.h' line='156' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='mock.h' line='158' column='1' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='bbc77b46' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='07074b04' visibility='default' filepath='mock.h' line='158' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' filepath='types.h' line='194' column='1' id='41060289'/>
    <typedef-decl name='ssize_t' type-id='41060289' filepath='stdio.h' line='77' column='1' id='79a0948f'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='8730c7b5' size-in-bits='64' id='47574c75'/>
    <pointer-type-def type-id='47574c75' size-in-bits='64' id='ad6d398d'/>
    <pointer-type-def type-id='6cd39edc' size-in-bits='64' id='d1301e9a'/>
    <pointer-type-def type-id='d1301e9a' size-in-bits='64' id='fec04f10'/>
    <pointer-type-def type-id='f0b6b5e9' size-in-bits='64' id='f9913cd1'/>
    <pointer-type-def type-id='f9913cd1' size-in-bits='64' id='daa2ff21'/>
    <pointer-type-def type-id='68cf04f8' size-in-bits='64' id='d511658e'/>
    <pointer-type-def type-id='d511658e' size-in-bits='64' id='0e63012c'/>
    <pointer-type-def type-id='abfb0ad2' size-in-bits='64' id='d7ecc0f0'/>
    <pointer-type-def type-id='d7ecc0f0' size-in-bits='64' id='c3b3972e'/>
    <pointer-type-def type-id='fa994560' size-in-bits='64' id='bbc77b46'/>
    <pointer-type-def type-id='bbc77b46' size-in-bits='64' id='07074b04'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <var-decl name='ut_calloc_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='146' column='1'/>
    <var-decl name='ut_mqh_calloc' type-id='1b7abefc' visibility='default' filepath='mock.h' line='146' column='1'/>
    <var-decl name='ut_pthread_mutex_init_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='148' column='1'/>
    <var-decl name='ut_pthread_mutex_init' type-id='95e97e5e' visibility='default' filepath='mock.h' line='148' column='1'/>
    <var-decl name='ut_mqh_pthread_mutex_init' type-id='7ffaf2e5' visibility='default' filepath='mock.h' line='148' column='1'/>
    <var-decl name='ut_pthread_mutexattr_init_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='151' column='1'/>
    <var-decl name='ut_pthread_mutexattr_init' type-id='95e97e5e' visibility='default' filepath='mock.h' line='151' column='1'/>
    <var-decl name='ut_mqh_pthread_mutexattr_init' type-id='0d7ddfb4' visibility='default' filepath='mock.h' line='151' column='1'/>
    <var-decl name='ut_recvmsg_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='154' column='1'/>
    <var-decl name='ut_recvmsg' type-id='79a0948f' visibility='default' filepath='mock.h' line='154' column='1'/>
    <var-decl name='ut_mqh_recvmsg' type-id='6cf032e7' visibility='default' filepath='mock.h' line='154' column='1'/>
    <var-decl name='ut_sendmsg_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='156' column='1'/>
    <var-decl name='ut_sendmsg' type-id='79a0948f' visibility='default' filepath='mock.h' line='156' column='1'/>
    <var-decl name='ut_mqh_sendmsg' type-id='27b5b1bd' visibility='default' filepath='mock.h' line='156' column='1'/>
    <var-decl name='ut_writev_mocked' type-id='c894953d' visibility='default' filepath='mock.h' line='158' column='1'/>
    <var-decl name='ut_writev' type-id='79a0948f' visibility='default' filepath='mock.h' line='158' column='1'/>
    <var-decl name='ut_mqh_writev' type-id='767203dd' visibility='default' filepath='mock.h' line='158' column='1'/>
    <var-decl name='g_unlink_path' type-id='26a90f95' visibility='default' filepath='mock.h' line='161' column='1'/>
    <type-decl name='void' id='48b5725f'/>
    <var-decl name='g_unlink_callback' type-id='953b12f8' visibility='default' filepath='mock.h' line='162' column='1'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <var-decl name='ut_calloc' type-id='eaa32e2f' visibility='default' filepath='mock.h' line='146' column='1'/>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
