<abi-corpus version='2.4' soname='libspdk_lvol.so.10.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_util.so.10.0'/>
    <dependency name='libspdk_blob.so.11.0'/>
    <dependency name='libspdk_thread.so.10.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_lvol_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_esnap_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_snapshot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_decouple_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_deletable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_bs_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_iter_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_open_blob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_open_blob_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_set_super' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_bs_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_is_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_uuid_set_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strnlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='lvol.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='296' hash='b19eb571bf2f8fa1' id='12e4ade3'>
      <subrange length='37' lower-bound='0' upper-bound='36' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6b8954b69042919f' id='aa6426fb'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='464' hash='0aeeb371a757b00f' id='64ad9dae'>
      <subrange length='58' lower-bound='0' upper-bound='57' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='d77a1ef5e3b46862' id='fc047456'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' hash='ea93b43678875247' id='59daf3ef'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='b10be967'/>
    </array-type-def>
    <enum-decl name='blob_clear_method' size-in-bits='32' alignment-in-bits='32' filepath='blob.h' line='48' column='1' hash='37e93404c044de31' id='6486fbcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BLOB_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='BLOB_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='BLOB_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='BLOB_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='lvol_clear_method' size-in-bits='32' alignment-in-bits='32' filepath='lvol.h' line='26' column='1' hash='fc0fde8cfaef87f0' id='78195891'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVOL_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='LVOL_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='LVOL_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='LVOL_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='lvs_clear_method' size-in-bits='32' alignment-in-bits='32' filepath='lvol.h' line='33' column='1' hash='34e5109285d99c58' id='b9d2071b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVS_CLEAR_WITH_UNMAP' value='0'/>
      <enumerator name='LVS_CLEAR_WITH_WRITE_ZEROES' value='1'/>
      <enumerator name='LVS_CLEAR_WITH_NONE' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <class-decl name='degraded_lvol_sets_tree' is-struct='yes' visibility='default' size-in-bits='64' filepath='lvolstore.h' line='105' column='1' hash='2c090f57620c6c2a' id='36dfe51c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='a16313d5' visibility='default' filepath='lvolstore.h' line='105' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='blob.h' line='171' column='1' hash='d17a330c630e0141' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' is-struct='yes' visibility='default' size-in-bits='1280' filepath='blob.h' line='183' column='1' hash='b02bcb6b9a8ca64d' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='ebc27c62' visibility='default' filepath='blob.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='0c87adc6' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='7a375257' visibility='default' filepath='blob.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='ec0088fb' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='ec0088fb' visibility='default' filepath='blob.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='9a3d0978' visibility='default' filepath='blob.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='9a3d0978' visibility='default' filepath='blob.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='23168c30' visibility='default' filepath='blob.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='311fca94' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='311fca94' visibility='default' filepath='blob.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4a9ec7e9' visibility='default' filepath='blob.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='afcde08d' visibility='default' filepath='blob.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='is_range_valid' type-id='afcde08d' visibility='default' filepath='blob.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='translate_lba' type-id='05114f47' visibility='default' filepath='blob.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy' type-id='9a6dafa7' visibility='default' filepath='blob.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_degraded' type-id='088f71e9' visibility='default' filepath='blob.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='262' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' is-struct='yes' visibility='default' size-in-bits='192' filepath='blob.h' line='161' column='1' hash='66b11ce90ae11b3c' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvol' is-struct='yes' visibility='default' size-in-bits='2112' filepath='lvolstore.h' line='109' column='1' hash='d61bde20b5a19d36' id='7b976e75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lvol_store' type-id='4c655657' visibility='default' filepath='lvolstore.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blob' type-id='89e1f283' visibility='default' filepath='lvolstore.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blob_id' type-id='533eb244' visibility='default' filepath='lvolstore.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='unique_id' type-id='64ad9dae' visibility='default' filepath='lvolstore.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='lvolstore.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1296'>
        <var-decl name='uuid_str' type-id='12e4ade3' visibility='default' filepath='lvolstore.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='lvolstore.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ref_count' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='action_in_progress' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='lvolstore.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='lvolstore.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='degraded_set' type-id='a16313d5' visibility='default' filepath='lvolstore.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='degraded_link' type-id='e7f43f72' visibility='default' filepath='lvolstore.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvol_store' is-struct='yes' visibility='default' size-in-bits='2240' filepath='lvolstore.h' line='88' column='1' hash='8b315063bc277542' id='78ce766f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bs_dev' type-id='44388ddf' visibility='default' filepath='lvolstore.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blobstore' type-id='07fd40b5' visibility='default' filepath='lvolstore.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='super_blob' type-id='89e1f283' visibility='default' filepath='lvolstore.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='super_blob_id' type-id='533eb244' visibility='default' filepath='lvolstore.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default' filepath='lvolstore.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lvol_count' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvols_opened' type-id='95e97e5e' visibility='default' filepath='lvolstore.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pending_lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='retry_open_lvols' type-id='e7f43f73' visibility='default' filepath='lvolstore.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='load_esnaps' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='840'>
        <var-decl name='on_list' type-id='c894953d' visibility='default' filepath='lvolstore.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='lvolstore.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='new_name' type-id='59daf3ef' visibility='default' filepath='lvolstore.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='lvolstore.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='degraded_lvol_sets_tree' type-id='36dfe51c' visibility='default' filepath='lvolstore.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='lvolstore.h' line='106' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvs_opts' is-struct='yes' visibility='default' size-in-bits='704' filepath='lvol.h' line='46' column='1' hash='3c9764615cbf1376' id='3543c05e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default' filepath='lvol.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='clear_method' type-id='b9d2071b' visibility='default' filepath='lvol.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='59daf3ef' visibility='default' filepath='lvol.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='num_md_pages_per_cluster_ratio' type-id='8f92235e' visibility='default' filepath='lvol.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='lvol.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='lvol.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' is-struct='yes' visibility='default' size-in-bits='128' filepath='uuid.h' line='21' column='1' hash='ad18e2956698a415' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='lvolstore.h' line='121' column='1' hash='c28e89109ab4d527' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b1c2c545' visibility='default' filepath='lvolstore.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='449ccdbd' visibility='default' filepath='lvolstore.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='lvolstore.h' line='96' column='1' hash='94b36cba648426c1#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='b1c2c545' visibility='default' filepath='lvolstore.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='449ccdbd' visibility='default' filepath='lvolstore.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='lvolstore.h' line='101' column='1' hash='5de7dfdf4d5caef9#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='4c655657' visibility='default' filepath='lvolstore.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c08726c7' visibility='default' filepath='lvolstore.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='214' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' size-in-bits='64' filepath='blob.h' line='43' column='1' hash='8fdc5eea2983a729' id='533eb244'/>
    <typedef-decl name='spdk_blob_shallow_copy_status' type-id='f76b72b0' size-in-bits='64' filepath='blob.h' line='159' column='1' hash='fd7a63c0c6c822c4' id='8d6c4ea0'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='03ca1b4b' size-in-bits='64' filepath='blob.h' line='118' column='1' hash='fd7a63c0c6c822c4' id='7683f572'/>
    <typedef-decl name='spdk_bs_esnap_dev_create' type-id='3e82def8' size-in-bits='64' filepath='blob.h' line='149' column='1' hash='fd7a63c0c6c822c4' id='63c64b6d'/>
    <typedef-decl name='spdk_lvol_iter_cb' type-id='6084c096' size-in-bits='64' filepath='lvol.h' line='126' column='1' hash='fd7a63c0c6c822c4' id='892e12ff'/>
    <typedef-decl name='spdk_lvol_op_complete' type-id='82328a76' size-in-bits='64' filepath='lvol.h' line='117' column='1' hash='fd7a63c0c6c822c4' id='d6a4099a'/>
    <typedef-decl name='spdk_lvol_op_with_handle_complete' type-id='450dc3ce' size-in-bits='64' filepath='lvol.h' line='108' column='1' hash='fd7a63c0c6c822c4' id='7c4e9e6e'/>
    <typedef-decl name='spdk_lvs_op_complete' type-id='82328a76' size-in-bits='64' filepath='lvol.h' line='98' column='1' hash='fd7a63c0c6c822c4' id='1405f9e6'/>
    <typedef-decl name='spdk_lvs_op_with_handle_complete' type-id='2e3bca88' size-in-bits='64' filepath='lvol.h' line='89' column='1' hash='fd7a63c0c6c822c4' id='5d9bdc8a'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='uuid.h' line='22' column='1' hash='83563518080289b9' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='088f71e9'/>
