<abi-corpus version='2.0' soname='libspdk_idxd.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libspdk_util.so.5.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_idxd_detach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_get_socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_probe' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_process_events' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_put_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_set_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_copy_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_dualcast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_idxd_submit_raw_desc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='idxd.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='9152' id='5d23843f'>
      <subrange length='286' type-id='7359adad' id='eefcdfbd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='64' id='337c1cdd'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='960' id='fc89bb16'>
      <subrange length='30' type-id='7359adad' id='6a6183a4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='160' id='736fb5aa'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='256' id='85c64d26'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='104' id='b6925fd4'>
      <subrange length='13' type-id='7359adad' id='487fded1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='192' id='014804d6'>
      <subrange length='24' type-id='7359adad' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2048' id='62946659'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_id' size-in-bits='96' is-struct='yes' visibility='default' id='a41463d8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='class_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='vendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='device_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='subvendor_id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='subdevice_id' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_pci_device' size-in-bits='960' is-struct='yes' visibility='default' id='86ef9a2b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev_handle' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='addr' type-id='ec72f59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='id' type-id='a41463d8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='socket_id' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='type' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='map_bar' type-id='0bfed558' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unmap_bar' type-id='d4b79756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cfg_read' type-id='13cdbdab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cfg_write' type-id='13cdbdab' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='bcacb5f6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='_spdk_pci_device_internal' size-in-bits='320' is-struct='yes' visibility='default' id='bcacb5f6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='a10bedff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attached' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='claim_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pending_removal' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='removed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='efc5406b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b4842653' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_idxd_req_cb' type-id='1ed1e4cd' id='576652af'/>
    <typedef-decl name='spdk_idxd_attach_cb' type-id='dd80c2c9' id='6bdef912'/>
    <typedef-decl name='spdk_idxd_probe_cb' type-id='d6185de6' id='ba2310ed'/>
    <class-decl name='idxd_hw_desc' size-in-bits='512' is-struct='yes' visibility='default' id='7f046df4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pasid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='priv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='opcode' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='completion_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='int_handle' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='304'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='src_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='src1_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='readback_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='pattern' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='desc_list_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='dst_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='readback_addr2' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='src2_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='comp_pattern' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='src1_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='xfer_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='desc_count' type-id='8f92235e' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='16' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='compr_flags' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='decompr_flags' type-id='149c6638' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='192' is-anonymous='yes' visibility='default' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='iaa' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='expected_res' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delta' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delta_rec_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dest2' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='crc32c' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_chk' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_ins' type-id='e7f43f77' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_upd' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='op_specific' type-id='014804d6' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src2_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_dst_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src2_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='filter_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_inputs' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_size' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rsvd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rsvd1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flag' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd2' type-id='b6925fd4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref_tag_seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='app_tag_seed' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dest_flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='rsvd' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='src_ref_tag_seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='src_app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='src_app_tag_seed' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dest_ref_tag_seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dest_app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='dest_app_tag_seed' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='dsa_hw_comp_record' size-in-bits='256' is-struct='yes' visibility='default' id='1c1f2957'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='84ff7d66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rsvd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bytes_completed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fault_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab59b' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='8' is-anonymous='yes' visibility='default' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='result' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_status' type-id='b96825af' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__7' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='delta_rec_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='crc32c_val' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_ins_comp' type-id='e7f43f7a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dif_upd_comp' type-id='e7f43f7b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='op_specific' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dif_chk_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='dif_chk_app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='dif_chk_app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rsvd' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='src_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='src_app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='src_app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dest_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dest_app_tag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dest_app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iaa_hw_comp_record' size-in-bits='512' is-struct='yes' visibility='default' id='683f0694'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='84ff7d66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='error_code' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='rsvd' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bytes_completed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fault_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='invalid_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='output_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='output_bits' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='rsvd3' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='rsvd4' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='rsvd5' type-id='85c64d26' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='iaa_aecs' size-in-bits='12544' is-struct='yes' visibility='default' id='59b921a3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='xor_checksum' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd' type-id='736fb5aa' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='num_output_accum_bits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output_accum' type-id='62946659' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='ll_sym' type-id='5d23843f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11456'>
        <var-decl name='rsvd1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11488'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11520'>
        <var-decl name='d_sym' type-id='fc89bb16' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12480'>
        <var-decl name='pad' type-id='337c1cdd' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='idxd_dev' id='7c2d7fe1'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='IDXD_DEV_TYPE_DSA' value='0'/>
      <enumerator name='IDXD_DEV_TYPE_IAA' value='1'/>
    </enum-decl>
    <class-decl name='idxd_batch' size-in-bits='448' is-struct='yes' visibility='default' id='5d3374ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='user_desc' type-id='694bf982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='user_ops' type-id='93724e37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='user_desc_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='index' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='refcnt' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='chan' type-id='1e6253fc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f7c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f2220617' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='688fd207' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_idxd_io_channel' size-in-bits='832' is-struct='yes' visibility='default' id='d65e93a6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idxd' type-id='c67e102a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='portal' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='portal_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='pasid_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='batch' type-id='f2220617' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='desc_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ops_pool' type-id='e7f43f7d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ops_outstanding' type-id='2a36045d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ops_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='batch_pool' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='batch_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='93724e37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='39f0f7a7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='op_head' size-in-bits='128' is-struct='yes' visibility='default' id='2a36045d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='93724e37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='39f0f7a7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f2220617' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='688fd207' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='idxd_ops' size-in-bits='1024' is-struct='yes' visibility='default' id='c886508f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab59c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='cb_fn' type-id='576652af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='batch' type-id='f2220617' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='desc' type-id='694bf982' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='' type-id='ac5ab59d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parent' type-id='93724e37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='link' type-id='e7f43f7f' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='512' is-anonymous='yes' visibility='default' id='ac5ab59c'>
      <data-member access='public'>
        <var-decl name='hw' type-id='1c1f2957' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iaa_hw' type-id='683f0694' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__8' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab59d'>
      <data-member access='public'>
        <var-decl name='crc_dst' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='output_size' type-id='90421557' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='93724e37' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_idxd_impl' size-in-bits='384' is-struct='yes' visibility='default' id='e5336688'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='probe' type-id='599994b0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destruct' type-id='eb7345ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dump_sw_error' type-id='5c5953a3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='portal_get_addr' type-id='0c7afae9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='link' type-id='e7f43f80' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='ea2cf69e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_idxd_device' size-in-bits='768' is-struct='yes' visibility='default' id='2d706d0c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='impl' type-id='ea2cf69e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='portal' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='socket_id' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='num_channels' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='total_wq_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='chan_per_device' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='num_channels_lock' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='pasid_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='type' type-id='7c2d7fe1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='aecs' type-id='479a08e3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='version' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='382815ac' size-in-bits='64' id='d6185de6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <pointer-type-def type-id='8141f46d' size-in-bits='64' id='0c7afae9'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='59b921a3' size-in-bits='64' id='479a08e3'/>
    <pointer-type-def type-id='5d3374ef' size-in-bits='64' id='f2220617'/>
    <pointer-type-def type-id='f2220617' size-in-bits='64' id='688fd207'/>
    <pointer-type-def type-id='7f046df4' size-in-bits='64' id='694bf982'/>
    <pointer-type-def type-id='c886508f' size-in-bits='64' id='93724e37'/>
    <pointer-type-def type-id='93724e37' size-in-bits='64' id='39f0f7a7'/>
    <pointer-type-def type-id='917f2454' size-in-bits='64' id='d4b79756'/>
    <pointer-type-def type-id='b388f466' size-in-bits='64' id='0bfed558'/>
    <pointer-type-def type-id='d8facee7' size-in-bits='64' id='13cdbdab'/>
    <pointer-type-def type-id='18d95c76' size-in-bits='64' id='599994b0'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='2d706d0c' size-in-bits='64' id='c67e102a'/>
    <pointer-type-def type-id='e5336688' size-in-bits='64' id='ea2cf69e'/>
    <pointer-type-def type-id='d65e93a6' size-in-bits='64' id='1e6253fc'/>
    <pointer-type-def type-id='86ef9a2b' size-in-bits='64' id='efc5406b'/>
    <pointer-type-def type-id='efc5406b' size-in-bits='64' id='b4842653'/>
    <pointer-type-def type-id='469e1bd7' size-in-bits='64' id='a10bedff'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='dfd36323' size-in-bits='64' id='eb7345ef'/>
    <pointer-type-def type-id='e5db1037' size-in-bits='64' id='5c5953a3'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='04d9cfe5' size-in-bits='64' id='dd80c2c9'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <qualified-type-def type-id='b96825af' volatile='yes' id='84ff7d66'/>
    <class-decl name='spdk_pci_driver' is-struct='yes' visibility='default' is-declaration-only='yes' id='469e1bd7'/>
    <function-decl name='spdk_idxd_get_socket' mangled-name='spdk_idxd_get_socket' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_idxd_get_socket'>
      <parameter type-id='c67e102a' name='idxd'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_idxd_get_channel' mangled-name='spdk_idxd_get_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_idxd_get_channel'>
      <parameter type-id='c67e102a' name='idxd'/>
      <return type-id='1e6253fc'/>
    </function-decl>
    <function-decl name='spdk_idxd_put_channel' mangled-name='spdk_idxd_put_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_idxd_put_channel'>
      <parameter type-id='1e6253fc' name='chan'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_idxd_set_config' mangled-name='spdk_idxd_set_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_idxd_set_config'>
      <parameter type-id='c894953d' name='kernel_mode'/>
      <return type-id='48b5725f'/>
    </function-decl>
