<abi-corpus version='2.0' soname='libspdk_util.so.5.1'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_base64_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_capacity' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_count_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_strerror_r' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strlen_pad' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strlwr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strsepq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strtol' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_strtoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_u32log2' type='gnu-ifunc-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_u32log2.resolver' type='func-type' binding='weak-binding' visibility='default-visibility' alias='spdk_u32log2' is-defined='yes'/>
    <elf-symbol name='spdk_u64log2' type='gnu-ifunc-type' binding='global-binding' visibility='default-visibility' alias='spdk_u64log2.resolver' is-defined='yes'/>
    <elf-symbol name='spdk_u64log2.resolver' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_unhexlify' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_fmt_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vsprintf_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vsprintf_append_realloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xor_gen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_xor_get_optimal_alignment' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_zipf_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='base64.c' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <function-decl name='spdk_base64_encode' mangled-name='spdk_base64_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_encode'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='src_len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_encode' mangled-name='spdk_base64_urlsafe_encode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_encode'>
      <parameter type-id='26a90f95' name='dst'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='b59d7dce' name='src_len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_decode' mangled-name='spdk_base64_decode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_decode'>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='78c01427' name='dst_len'/>
      <parameter type-id='80f4b756' name='src'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_decode' mangled-name='spdk_base64_urlsafe_decode' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_decode'>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='78c01427' name='dst_len'/>
      <parameter type-id='80f4b756' name='src'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='bit_array.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <array-type-def dimensions='1' type-id='499e6015' size-in-bits='infinite' id='5fd5704e'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <typedef-decl name='spdk_bit_array_word' type-id='9c313c2d' id='499e6015'/>
    <class-decl name='spdk_bit_array' size-in-bits='64' is-struct='yes' visibility='default' id='cfe40fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bit_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='words' type-id='5fd5704e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bit_pool' size-in-bits='128' is-struct='yes' visibility='default' id='e7349382'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='array' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lowest_free_bit' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='free_count' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <qualified-type-def type-id='cfe40fb1' const='yes' id='58a40d50'/>
    <pointer-type-def type-id='58a40d50' size-in-bits='64' id='0441370e'/>
    <qualified-type-def type-id='e7349382' const='yes' id='bce190f9'/>
    <pointer-type-def type-id='bce190f9' size-in-bits='64' id='2a16fc29'/>
    <pointer-type-def type-id='cfe40fb1' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='6ef42d89' size-in-bits='64' id='4d63d799'/>
    <pointer-type-def type-id='e7349382' size-in-bits='64' id='d5dec3d0'/>
    <pointer-type-def type-id='d5dec3d0' size-in-bits='64' id='a7ae828e'/>
    <function-decl name='spdk_bit_array_create' mangled-name='spdk_bit_array_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_create'>
      <parameter type-id='8f92235e' name='num_bits'/>
      <return type-id='6ef42d89'/>
    </function-decl>
    <function-decl name='spdk_bit_array_free' mangled-name='spdk_bit_array_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_free'>
      <parameter type-id='4d63d799' name='bap'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_resize' mangled-name='spdk_bit_array_resize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_resize'>
      <parameter type-id='4d63d799' name='bap'/>
      <parameter type-id='8f92235e' name='num_bits'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_capacity' mangled-name='spdk_bit_array_capacity' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_capacity'>
      <parameter type-id='0441370e' name='ba'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_get' mangled-name='spdk_bit_array_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_get'>
      <parameter type-id='0441370e' name='ba'/>
      <parameter type-id='8f92235e' name='bit_index'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_array_set' mangled-name='spdk_bit_array_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_set'>
      <parameter type-id='6ef42d89' name='ba'/>
      <parameter type-id='8f92235e' name='bit_index'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear' mangled-name='spdk_bit_array_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear'>
      <parameter type-id='6ef42d89' name='ba'/>
      <parameter type-id='8f92235e' name='bit_index'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_set' mangled-name='spdk_bit_array_find_first_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_set'>
      <parameter type-id='0441370e' name='ba'/>
      <parameter type-id='8f92235e' name='start_bit_index'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_clear' mangled-name='spdk_bit_array_find_first_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_clear'>
      <parameter type-id='0441370e' name='ba'/>
      <parameter type-id='8f92235e' name='start_bit_index'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_set' mangled-name='spdk_bit_array_count_set' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_set'>
      <parameter type-id='0441370e' name='ba'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_clear' mangled-name='spdk_bit_array_count_clear' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_clear'>
      <parameter type-id='0441370e' name='ba'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_store_mask' mangled-name='spdk_bit_array_store_mask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_store_mask'>
      <parameter type-id='0441370e' name='ba'/>
      <parameter type-id='eaa32e2f' name='mask'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_load_mask' mangled-name='spdk_bit_array_load_mask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_load_mask'>
      <parameter type-id='6ef42d89' name='ba'/>
      <parameter type-id='eaa32e2f' name='mask'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear_mask' mangled-name='spdk_bit_array_clear_mask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear_mask'>
      <parameter type-id='6ef42d89' name='ba'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_create' mangled-name='spdk_bit_pool_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create'>
      <parameter type-id='8f92235e' name='num_bits'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_create_from_array' mangled-name='spdk_bit_pool_create_from_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create_from_array'>
      <parameter type-id='6ef42d89' name='array'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free' mangled-name='spdk_bit_pool_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free'>
      <parameter type-id='a7ae828e' name='ppool'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_resize' mangled-name='spdk_bit_pool_resize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_resize'>
      <parameter type-id='a7ae828e' name='ppool'/>
      <parameter type-id='8f92235e' name='num_bits'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_capacity' mangled-name='spdk_bit_pool_capacity' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_capacity'>
      <parameter type-id='2a16fc29' name='pool'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_is_allocated' mangled-name='spdk_bit_pool_is_allocated' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_is_allocated'>
      <parameter type-id='2a16fc29' name='pool'/>
      <parameter type-id='8f92235e' name='bit_index'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_allocate_bit' mangled-name='spdk_bit_pool_allocate_bit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_allocate_bit'>
      <parameter type-id='d5dec3d0' name='pool'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_bit' mangled-name='spdk_bit_pool_free_bit' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_bit'>
      <parameter type-id='d5dec3d0' name='pool'/>
      <parameter type-id='8f92235e' name='bit_index'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_allocated' mangled-name='spdk_bit_pool_count_allocated' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_allocated'>
      <parameter type-id='2a16fc29' name='pool'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_free' mangled-name='spdk_bit_pool_count_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_free'>
      <parameter type-id='2a16fc29' name='pool'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_store_mask' mangled-name='spdk_bit_pool_store_mask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_store_mask'>
      <parameter type-id='2a16fc29' name='pool'/>
      <parameter type-id='eaa32e2f' name='mask'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_load_mask' mangled-name='spdk_bit_pool_load_mask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_load_mask'>
      <parameter type-id='d5dec3d0' name='pool'/>
      <parameter type-id='eaa32e2f' name='mask'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_all_bits' mangled-name='spdk_bit_pool_free_all_bits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_all_bits'>
      <parameter type-id='d5dec3d0' name='pool'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cpuset.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='7359adad' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <qualified-type-def type-id='aec5215a' const='yes' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' id='75291c35'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' id='d5319498'/>
    <function-decl name='spdk_cpuset_alloc' mangled-name='spdk_cpuset_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_alloc'>
      <return type-id='d5319498'/>
    </function-decl>
    <function-decl name='spdk_cpuset_free' mangled-name='spdk_cpuset_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_free'>
      <parameter type-id='d5319498' name='set'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_equal' mangled-name='spdk_cpuset_equal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_equal'>
      <parameter type-id='75291c35' name='set1'/>
      <parameter type-id='75291c35' name='set2'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_copy' mangled-name='spdk_cpuset_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_copy'>
      <parameter type-id='d5319498' name='dst'/>
      <parameter type-id='75291c35' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_negate' mangled-name='spdk_cpuset_negate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_negate'>
      <parameter type-id='d5319498' name='set'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_and' mangled-name='spdk_cpuset_and' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_and'>
      <parameter type-id='d5319498' name='dst'/>
      <parameter type-id='75291c35' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_or' mangled-name='spdk_cpuset_or' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_or'>
      <parameter type-id='d5319498' name='dst'/>
      <parameter type-id='75291c35' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_xor' mangled-name='spdk_cpuset_xor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_xor'>
      <parameter type-id='d5319498' name='dst'/>
      <parameter type-id='75291c35' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_zero' mangled-name='spdk_cpuset_zero' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_zero'>
      <parameter type-id='d5319498' name='set'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_set_cpu' mangled-name='spdk_cpuset_set_cpu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_set_cpu'>
      <parameter type-id='d5319498' name='set'/>
      <parameter type-id='8f92235e' name='cpu'/>
      <parameter type-id='c894953d' name='state'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_get_cpu' mangled-name='spdk_cpuset_get_cpu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_get_cpu'>
      <parameter type-id='75291c35' name='set'/>
      <parameter type-id='8f92235e' name='cpu'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_count' mangled-name='spdk_cpuset_count' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_count'>
      <parameter type-id='75291c35' name='set'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_cpuset_fmt' mangled-name='spdk_cpuset_fmt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_fmt'>
      <parameter type-id='d5319498' name='set'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_cpuset_parse' mangled-name='spdk_cpuset_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_parse'>
      <parameter type-id='d5319498' name='set'/>
      <parameter type-id='80f4b756' name='mask'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc16.c' language='LANG_C99'>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <function-decl name='spdk_crc16_t10dif' mangled-name='spdk_crc16_t10dif' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif'>
      <parameter type-id='149c6638' name='init_crc'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_crc16_t10dif_copy' mangled-name='spdk_crc16_t10dif_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif_copy'>
      <parameter type-id='149c6638' name='init_crc'/>
      <parameter type-id='ae3e8ca6' name='dst'/>
      <parameter type-id='ae3e8ca6' name='src'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='149c6638'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32_ieee.c' language='LANG_C99'>
    <function-decl name='spdk_crc32_ieee_update' mangled-name='spdk_crc32_ieee_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32_ieee_update'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='8f92235e' name='crc'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32c.c' language='LANG_C99'>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <function-decl name='spdk_crc32c_update' mangled-name='spdk_crc32c_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_update'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <parameter type-id='8f92235e' name='crc'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_crc32c_iov_update' mangled-name='spdk_crc32c_iov_update' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_iov_update'>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='crc32c'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dif.c' language='LANG_C99'>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <enum-decl name='spdk_dif_type' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_dif_ctx' size-in-bits='384' is-struct='yes' visibility='default' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='last_guard' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='guard_seed' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_error' size-in-bits='128' is-struct='yes' visibility='default' id='035f351a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='err_type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='expected' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='actual' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='err_offset' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='6e011169' const='yes' id='507bcddc'/>
    <pointer-type-def type-id='507bcddc' size-in-bits='64' id='a8e53a42'/>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <pointer-type-def type-id='035f351a' size-in-bits='64' id='c7935638'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <function-decl name='spdk_dif_ctx_init' mangled-name='spdk_dif_ctx_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_init'>
      <parameter type-id='a3141401' name='ctx'/>
      <parameter type-id='8f92235e' name='block_size'/>
      <parameter type-id='8f92235e' name='md_size'/>
      <parameter type-id='c894953d' name='md_interleave'/>
      <parameter type-id='c894953d' name='dif_loc'/>
      <parameter type-id='388e2dcf' name='dif_type'/>
      <parameter type-id='8f92235e' name='dif_flags'/>
      <parameter type-id='8f92235e' name='init_ref_tag'/>
      <parameter type-id='149c6638' name='apptag_mask'/>
      <parameter type-id='149c6638' name='app_tag'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='149c6638' name='guard_seed'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_data_offset' mangled-name='spdk_dif_ctx_set_data_offset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_data_offset'>
      <parameter type-id='a3141401' name='ctx'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_remapped_init_ref_tag' mangled-name='spdk_dif_ctx_set_remapped_init_ref_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_remapped_init_ref_tag'>
      <parameter type-id='a3141401' name='ctx'/>
      <parameter type-id='8f92235e' name='remapped_init_ref_tag'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_generate' mangled-name='spdk_dif_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify' mangled-name='spdk_dif_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c' mangled-name='spdk_dif_update_crc32c' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='90421557' name='_crc32c'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_copy' mangled-name='spdk_dif_generate_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_copy'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_copy' mangled-name='spdk_dif_verify_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_copy'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_inject_error' mangled-name='spdk_dif_inject_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_inject_error'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='8f92235e' name='inject_flags'/>
      <parameter type-id='90421557' name='inject_offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_generate' mangled-name='spdk_dix_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_generate'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='md_iov'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_verify' mangled-name='spdk_dix_verify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_verify'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='md_iov'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_inject_error' mangled-name='spdk_dix_inject_error' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_inject_error'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='md_iov'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='8f92235e' name='inject_flags'/>
      <parameter type-id='90421557' name='inject_offset'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_set_md_interleave_iovs' mangled-name='spdk_dif_set_md_interleave_iovs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_set_md_interleave_iovs'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='cc4b1be9' name='buf_iovs'/>
      <parameter type-id='95e97e5e' name='buf_iovcnt'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='90421557' name='_mapped_len'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_stream' mangled-name='spdk_dif_generate_stream' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_stream'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='a3141401' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_stream' mangled-name='spdk_dif_verify_stream' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_stream'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='a3141401' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c_stream' mangled-name='spdk_dif_update_crc32c_stream' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c_stream'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='90421557' name='_crc32c'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_get_range_with_md' mangled-name='spdk_dif_get_range_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_range_with_md'>
      <parameter type-id='8f92235e' name='data_offset'/>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='90421557' name='_buf_offset'/>
      <parameter type-id='90421557' name='_buf_len'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_get_length_with_md' mangled-name='spdk_dif_get_length_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_length_with_md'>
      <parameter type-id='8f92235e' name='data_len'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_dif_remap_ref_tag' mangled-name='spdk_dif_remap_ref_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_remap_ref_tag'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_remap_ref_tag' mangled-name='spdk_dix_remap_ref_tag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_remap_ref_tag'>
      <parameter type-id='cc4b1be9' name='md_iov'/>
      <parameter type-id='8f92235e' name='num_blocks'/>
      <parameter type-id='a8e53a42' name='ctx'/>
      <parameter type-id='c7935638' name='err_blk'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd.c' language='LANG_C99'>
    <function-decl name='spdk_fd_get_blocklen' mangled-name='spdk_fd_get_blocklen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_blocklen'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_fd_get_size' mangled-name='spdk_fd_get_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_size'>
      <parameter type-id='95e97e5e' name='fd'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd_group.c' language='LANG_C99'>
    <typedef-decl name='spdk_fd_fn' type-id='b9b212f5' id='12d464a6'/>
    <enum-decl name='event_handler_state' id='604b2669'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='EVENT_HANDLER_STATE_WAITING' value='0'/>
      <enumerator name='EVENT_HANDLER_STATE_RUNNING' value='1'/>
      <enumerator name='EVENT_HANDLER_STATE_REMOVED' value='2'/>
    </enum-decl>
    <class-decl name='event_handler' size-in-bits='2432' is-struct='yes' visibility='default' id='bf43b284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='state' type-id='604b2669' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fn' type-id='12d464a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fn_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='name' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='a65d3ec2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ccca0738' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fd_group' size-in-bits='192' is-struct='yes' visibility='default' id='c8d12ece'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='epfd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_fds' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='event_handlers' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='a65d3ec2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ccca0738' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='bf43b284' size-in-bits='64' id='a65d3ec2'/>
    <pointer-type-def type-id='a65d3ec2' size-in-bits='64' id='ccca0738'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='c8d12ece' size-in-bits='64' id='eb7a8954'/>
    <pointer-type-def type-id='eb7a8954' size-in-bits='64' id='2fe6715a'/>
    <function-decl name='spdk_fd_group_get_fd' mangled-name='spdk_fd_group_get_fd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_fd'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_add' mangled-name='spdk_fd_group_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_add'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <parameter type-id='95e97e5e' name='efd'/>
      <parameter type-id='12d464a6' name='fn'/>
      <parameter type-id='eaa32e2f' name='arg'/>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_remove' mangled-name='spdk_fd_group_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_remove'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <parameter type-id='95e97e5e' name='efd'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_event_modify' mangled-name='spdk_fd_group_event_modify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_event_modify'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <parameter type-id='95e97e5e' name='efd'/>
      <parameter type-id='95e97e5e' name='event_types'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_create' mangled-name='spdk_fd_group_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_create'>
      <parameter type-id='2fe6715a' name='_egrp'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_destroy' mangled-name='spdk_fd_group_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_destroy'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_wait' mangled-name='spdk_fd_group_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_wait'>
      <parameter type-id='eb7a8954' name='fgrp'/>
      <parameter type-id='95e97e5e' name='timeout'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='file.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_posix_file_load' mangled-name='spdk_posix_file_load' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_posix_file_load'>
      <parameter type-id='822cd80b' name='file'/>
      <parameter type-id='78c01427' name='size'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='hexlify.c' language='LANG_C99'>
    <function-decl name='spdk_hexlify' mangled-name='spdk_hexlify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_hexlify'>
      <parameter type-id='80f4b756' name='bin'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_unhexlify' mangled-name='spdk_unhexlify' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unhexlify'>
      <parameter type-id='80f4b756' name='hex'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='iov.c' language='LANG_C99'>
    <class-decl name='spdk_ioviter' size-in-bits='640' is-struct='yes' visibility='default' id='cda159a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='siov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='siovcnt' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='diov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='diovcnt' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sidx' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='didx' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='siov_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='siov_base' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='diov_len' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='diov_base' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='cda159a0' size-in-bits='64' id='949c74e6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <function-decl name='spdk_ioviter_first' mangled-name='spdk_ioviter_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_first'>
      <parameter type-id='949c74e6' name='iter'/>
      <parameter type-id='cc4b1be9' name='siov'/>
      <parameter type-id='b59d7dce' name='siovcnt'/>
      <parameter type-id='cc4b1be9' name='diov'/>
      <parameter type-id='b59d7dce' name='diovcnt'/>
      <parameter type-id='63e171df' name='src'/>
      <parameter type-id='63e171df' name='dst'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_next' mangled-name='spdk_ioviter_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_next'>
      <parameter type-id='949c74e6' name='iter'/>
      <parameter type-id='63e171df' name='src'/>
      <parameter type-id='63e171df' name='dst'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iovcpy' mangled-name='spdk_iovcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iovcpy'>
      <parameter type-id='cc4b1be9' name='siov'/>
      <parameter type-id='b59d7dce' name='siovcnt'/>
      <parameter type-id='cc4b1be9' name='diov'/>
      <parameter type-id='b59d7dce' name='diovcnt'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_copy_iovs_to_buf' mangled-name='spdk_copy_iovs_to_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_iovs_to_buf'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='buf_len'/>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_copy_buf_to_iovs' mangled-name='spdk_copy_buf_to_iovs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_buf_to_iovs'>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='buf_len'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pipe.c' language='LANG_C99'>
    <class-decl name='spdk_pipe' size-in-bits='192' is-struct='yes' visibility='default' id='ab2deffc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='write' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='read' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='ab2deffc' size-in-bits='64' id='cc32297a'/>
    <function-decl name='spdk_pipe_create' mangled-name='spdk_pipe_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_create'>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='8f92235e' name='sz'/>
      <return type-id='cc32297a'/>
    </function-decl>
    <function-decl name='spdk_pipe_destroy' mangled-name='spdk_pipe_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_destroy'>
      <parameter type-id='cc32297a' name='pipe'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_get_buffer' mangled-name='spdk_pipe_writer_get_buffer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_get_buffer'>
      <parameter type-id='cc32297a' name='pipe'/>
      <parameter type-id='8f92235e' name='requested_sz'/>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_advance' mangled-name='spdk_pipe_writer_advance' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_advance'>
      <parameter type-id='cc32297a' name='pipe'/>
      <parameter type-id='8f92235e' name='requested_sz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_bytes_available' mangled-name='spdk_pipe_reader_bytes_available' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_bytes_available'>
      <parameter type-id='cc32297a' name='pipe'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_get_buffer' mangled-name='spdk_pipe_reader_get_buffer' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_get_buffer'>
      <parameter type-id='cc32297a' name='pipe'/>
      <parameter type-id='8f92235e' name='requested_sz'/>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_advance' mangled-name='spdk_pipe_reader_advance' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_advance'>
      <parameter type-id='cc32297a' name='pipe'/>
      <parameter type-id='8f92235e' name='requested_sz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strerror_tls.c' language='LANG_C99'>
    <function-decl name='spdk_strerror' mangled-name='spdk_strerror' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror'>
      <parameter type-id='95e97e5e' name='errnum'/>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='string.c' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='long long int' size-in-bits='64' id='1eb56b1e'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <pointer-type-def type-id='c894953d' size-in-bits='64' id='d8e6b335'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' id='9b23c9ad'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <function-decl name='spdk_vsprintf_append_realloc' mangled-name='spdk_vsprintf_append_realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_append_realloc'>
      <parameter type-id='26a90f95' name='buffer'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter type-id='b7f2d5e6' name='args'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_append_realloc' mangled-name='spdk_sprintf_append_realloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_append_realloc'>
      <parameter type-id='26a90f95' name='buffer'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_vsprintf_alloc' mangled-name='spdk_vsprintf_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_alloc'>
      <parameter type-id='80f4b756' name='format'/>
      <parameter type-id='b7f2d5e6' name='args'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_alloc' mangled-name='spdk_sprintf_alloc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_alloc'>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strlwr' mangled-name='spdk_strlwr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlwr'>
      <parameter type-id='26a90f95' name='s'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strsepq' mangled-name='spdk_strsepq' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strsepq'>
      <parameter type-id='9b23c9ad' name='stringp'/>
      <parameter type-id='80f4b756' name='delim'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_str_trim' mangled-name='spdk_str_trim' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_trim'>
      <parameter type-id='26a90f95' name='s'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strcpy_pad' mangled-name='spdk_strcpy_pad' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strcpy_pad'>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='80f4b756' name='src'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='95e97e5e' name='pad'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_strlen_pad' mangled-name='spdk_strlen_pad' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlen_pad'>
      <parameter type-id='eaa32e2f' name='str'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='95e97e5e' name='pad'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_parse_ip_addr' mangled-name='spdk_parse_ip_addr' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_ip_addr'>
      <parameter type-id='26a90f95' name='ip'/>
      <parameter type-id='9b23c9ad' name='host'/>
      <parameter type-id='9b23c9ad' name='port'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_str_chomp' mangled-name='spdk_str_chomp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_chomp'>
      <parameter type-id='26a90f95' name='s'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_strerror_r' mangled-name='spdk_strerror_r' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror_r'>
      <parameter type-id='95e97e5e' name='errnum'/>
      <parameter type-id='26a90f95' name='buf'/>
      <parameter type-id='b59d7dce' name='buflen'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_parse_capacity' mangled-name='spdk_parse_capacity' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_capacity'>
      <parameter type-id='80f4b756' name='cap_str'/>
      <parameter type-id='5d6479ae' name='cap'/>
      <parameter type-id='d8e6b335' name='has_prefix'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_all_zero' mangled-name='spdk_mem_all_zero' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_all_zero'>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='size'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_strtol' mangled-name='spdk_strtol' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtol'>
      <parameter type-id='80f4b756' name='nptr'/>
      <parameter type-id='95e97e5e' name='base'/>
      <return type-id='bd54fe1a'/>
    </function-decl>
    <function-decl name='spdk_strtoll' mangled-name='spdk_strtoll' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtoll'>
      <parameter type-id='80f4b756' name='nptr'/>
      <parameter type-id='95e97e5e' name='base'/>
      <return type-id='1eb56b1e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='uuid.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='429c70d3' size-in-bits='64' id='69a99433'/>
    <function-decl name='spdk_uuid_parse' mangled-name='spdk_uuid_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_parse'>
      <parameter type-id='69a99433' name='uuid'/>
      <parameter type-id='80f4b756' name='uuid_str'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_fmt_lower' mangled-name='spdk_uuid_fmt_lower' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_fmt_lower'>
      <parameter type-id='26a90f95' name='uuid_str'/>
      <parameter type-id='b59d7dce' name='uuid_str_size'/>
      <parameter type-id='c2482856' name='uuid'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_compare' mangled-name='spdk_uuid_compare' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_compare'>
      <parameter type-id='c2482856' name='u1'/>
      <parameter type-id='c2482856' name='u2'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_generate' mangled-name='spdk_uuid_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_generate'>
      <parameter type-id='69a99433' name='uuid'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_uuid_copy' mangled-name='spdk_uuid_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_copy'>
      <parameter type-id='69a99433' name='dst'/>
      <parameter type-id='c2482856' name='src'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='xor.c' language='LANG_C99'>
    <function-decl name='spdk_xor_gen' mangled-name='spdk_xor_gen' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_xor_gen'>
      <parameter type-id='eaa32e2f' name='dest'/>
      <parameter type-id='63e171df' name='sources'/>
      <parameter type-id='8f92235e' name='n'/>
      <parameter type-id='8f92235e' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_xor_get_optimal_alignment' mangled-name='spdk_xor_get_optimal_alignment' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_xor_get_optimal_alignment'>
      <return type-id='b59d7dce'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='zipf.c' language='LANG_C99'>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <class-decl name='spdk_zipf' size-in-bits='448' is-struct='yes' visibility='default' id='a27394eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='range' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='alpha' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='eta' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='theta' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='zetan' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='val1_limit' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='seed' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a27394eb' size-in-bits='64' id='37ae105b'/>
    <pointer-type-def type-id='37ae105b' size-in-bits='64' id='1803e1e3'/>
    <function-decl name='spdk_zipf_create' mangled-name='spdk_zipf_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zipf_create'>
      <parameter type-id='9c313c2d' name='range'/>
      <parameter type-id='a0eb0f08' name='theta'/>
      <parameter type-id='8f92235e' name='seed'/>
      <return type-id='37ae105b'/>
    </function-decl>
    <function-decl name='spdk_zipf_free' mangled-name='spdk_zipf_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zipf_free'>
      <parameter type-id='1803e1e3' name='zipfp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_zipf_generate' mangled-name='spdk_zipf_generate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_zipf_generate'>
      <parameter type-id='37ae105b' name='zipf'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
