<abi-corpus version='2.0' soname='libspdk_vhost.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libspdk_util.so.5.1'/>
    <dependency name='libspdk_thread.so.7.0'/>
    <dependency name='libspdk_json.so.4.0'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.1'/>
    <dependency name='libspdk_bdev.so.10.0'/>
    <dependency name='libspdk_scsi.so.5.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vhost_blk_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_blk_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_find' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_get_coalescing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_add_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_get_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_remove_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_set_coalescing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_set_socket_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_trylock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='rte_vhost_user.c' language='LANG_C99'>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <function-decl name='spdk_vhost_set_coalescing' mangled-name='spdk_vhost_set_coalescing' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_coalescing'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='8f92235e' name='delay_base_us'/>
      <parameter type-id='8f92235e' name='iops_threshold'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_get_coalescing' mangled-name='spdk_vhost_get_coalescing' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_get_coalescing'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='90421557' name='delay_base_us'/>
      <parameter type-id='90421557' name='iops_threshold'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_set_socket_path' mangled-name='spdk_vhost_set_socket_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_socket_path'>
      <parameter type-id='80f4b756' name='basename'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vhost.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='7359adad' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_vhost_init_cb' type-id='03347643' id='e7e0eab8'/>
    <typedef-decl name='spdk_vhost_fini_cb' type-id='953b12f8' id='c30658ee'/>
    <class-decl name='spdk_vhost_dev' size-in-bits='768' is-struct='yes' visibility='default' id='4e8a23c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='path' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='registered' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='virtio_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='disabled_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='protocol_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='packed_ring_recovery' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='backend' type-id='b7db1e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='05d247e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='f6070624' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='vhost_backend_type' id='d33184bc'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VHOST_BACKEND_BLK' value='0'/>
      <enumerator name='VHOST_BACKEND_SCSI' value='1'/>
    </enum-decl>
    <class-decl name='spdk_vhost_dev_backend' size-in-bits='384' is-struct='yes' visibility='default' id='3d671967'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='d33184bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vhost_get_config' type-id='8a85dbc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='vhost_set_config' type-id='60e00dcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dump_info_json' type-id='4abd9d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write_config_json' type-id='4abd9d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='remove_device' type-id='7b272674' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='aec5215a' const='yes' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' id='75291c35'/>
    <qualified-type-def type-id='3d671967' const='yes' id='6b901b4e'/>
    <pointer-type-def type-id='6b901b4e' size-in-bits='64' id='b7db1e6c'/>
    <pointer-type-def type-id='a93a8ffa' size-in-bits='64' id='7b272674'/>
    <pointer-type-def type-id='9d3906ee' size-in-bits='64' id='8a85dbc8'/>
    <pointer-type-def type-id='50c0d11a' size-in-bits='64' id='60e00dcc'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='4e8a23c0' size-in-bits='64' id='05d247e6'/>
    <pointer-type-def type-id='05d247e6' size-in-bits='64' id='f6070624'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='f712e2b7' size-in-bits='64' id='03347643'/>
    <pointer-type-def type-id='9b4d63a2' size-in-bits='64' id='4abd9d34'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <function-decl name='spdk_vhost_dev_next' mangled-name='spdk_vhost_dev_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_next'>
      <parameter type-id='05d247e6' name='vdev'/>
      <return type-id='05d247e6'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_find' mangled-name='spdk_vhost_dev_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_find'>
      <parameter type-id='80f4b756' name='ctrlr_name'/>
      <return type-id='05d247e6'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_get_name' mangled-name='spdk_vhost_dev_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_get_name'>
      <parameter type-id='05d247e6' name='vdev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_get_cpumask' mangled-name='spdk_vhost_dev_get_cpumask' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_get_cpumask'>
      <parameter type-id='05d247e6' name='vdev'/>
      <return type-id='75291c35'/>
    </function-decl>
    <function-decl name='spdk_vhost_dev_remove' mangled-name='spdk_vhost_dev_remove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_dev_remove'>
      <parameter type-id='05d247e6' name='vdev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_lock' mangled-name='spdk_vhost_lock' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_lock'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_trylock' mangled-name='spdk_vhost_trylock' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_trylock'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_unlock' mangled-name='spdk_vhost_unlock' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_unlock'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_init' mangled-name='spdk_vhost_scsi_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_init'>
      <parameter type-id='e7e0eab8' name='init_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_init' mangled-name='spdk_vhost_blk_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_init'>
      <parameter type-id='e7e0eab8' name='init_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_fini' mangled-name='spdk_vhost_scsi_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_fini'>
      <parameter type-id='c30658ee' name='fini_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_fini' mangled-name='spdk_vhost_blk_fini' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_fini'>
      <parameter type-id='c30658ee' name='fini_cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_config_json' mangled-name='spdk_vhost_scsi_config_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_config_json'>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_blk_config_json' mangled-name='spdk_vhost_blk_config_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_config_json'>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='a93a8ffa'>
      <parameter type-id='05d247e6' name='vdev'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9d3906ee'>
      <parameter type-id='05d247e6'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='50c0d11a'>
      <parameter type-id='05d247e6'/>
      <parameter type-id='ae3e8ca6'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='8f92235e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f712e2b7'>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='9b4d63a2'>
      <parameter type-id='05d247e6'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='vhost_blk.c' language='LANG_C99'>
    <enum-decl name='spdk_json_val_type' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <function-decl name='spdk_vhost_blk_construct' mangled-name='spdk_vhost_blk_construct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_blk_construct'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='cpumask'/>
      <parameter type-id='80f4b756' name='dev_name'/>
      <parameter type-id='80f4b756' name='transport'/>
      <parameter type-id='3ee1fff1' name='params'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='vhost_scsi.c' language='LANG_C99'>
    <class-decl name='spdk_scsi_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='74e6cc2e'/>
    <typedef-decl name='spdk_vhost_event_fn' type-id='453d8496' id='f068ad8b'/>
    <pointer-type-def type-id='81637ba4' size-in-bits='64' id='453d8496'/>
    <pointer-type-def type-id='74e6cc2e' size-in-bits='64' id='491ccef4'/>
    <class-decl name='spdk_scsi_dev' is-struct='yes' visibility='default' is-declaration-only='yes' id='74e6cc2e'/>
    <function-decl name='spdk_vhost_scsi_dev_construct' mangled-name='spdk_vhost_scsi_dev_construct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_construct'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='cpumask'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_dev_get_tgt' mangled-name='spdk_vhost_scsi_dev_get_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_get_tgt'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='b96825af' name='num'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_dev_add_tgt' mangled-name='spdk_vhost_scsi_dev_add_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_add_tgt'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='95e97e5e' name='scsi_tgt_num'/>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_scsi_dev_remove_tgt' mangled-name='spdk_vhost_scsi_dev_remove_tgt' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_scsi_dev_remove_tgt'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='f0981eeb' name='scsi_tgt_num'/>
      <parameter type-id='f068ad8b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='81637ba4'>
      <parameter type-id='05d247e6'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
</abi-corpus>
