<abi-corpus version='2.0' soname='libspdk_log.so.5.0'>
  <elf-needed>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_clear_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_dump' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_enable_timestamps' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_first_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_next_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_get_print_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_set_print_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_to_syslog_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_log_usage' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vlog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='log.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' type-id='7359adad' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' type-id='7359adad' id='fdca39cf'/>
    </array-type-def>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='logfunc' type-id='bba1f737' id='049770e8'/>
    <enum-decl name='spdk_log_level' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <typedef-decl name='__off_t' type-id='bd54fe1a' id='79989e9c'/>
    <typedef-decl name='__off64_t' type-id='bd54fe1a' id='724e4de6'/>
    <typedef-decl name='FILE' type-id='ec1ed955' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' id='bb4788fa'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='8efea9e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='95e97e5e' const='yes' id='2448a865'/>
    <pointer-type-def type-id='049770e8' size-in-bits='64' id='c7712a73'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_log_set_level' mangled-name='spdk_log_set_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_level'>
      <parameter type-id='4271cbce' name='level'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_level' mangled-name='spdk_log_get_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_level'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_set_print_level' mangled-name='spdk_log_set_print_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_print_level'>
      <parameter type-id='4271cbce' name='level'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_print_level' mangled-name='spdk_log_get_print_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_print_level'>
      <return type-id='4271cbce'/>
    </function-decl>
    <function-decl name='spdk_log_open' mangled-name='spdk_log_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_open'>
      <parameter type-id='c7712a73' name='logf'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_close' mangled-name='spdk_log_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_close'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_enable_timestamps' mangled-name='spdk_log_enable_timestamps' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_enable_timestamps'>
      <parameter type-id='c894953d' name='value'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log' mangled-name='spdk_log' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log'>
      <parameter type-id='4271cbce' name='level'/>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='2448a865' name='line'/>
      <parameter type-id='80f4b756' name='func'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_to_syslog_level' mangled-name='spdk_log_to_syslog_level' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_to_syslog_level'>
      <parameter type-id='4271cbce' name='level'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vlog' mangled-name='spdk_vlog' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vlog'>
      <parameter type-id='4271cbce' name='level'/>
      <parameter type-id='80f4b756' name='file'/>
      <parameter type-id='2448a865' name='line'/>
      <parameter type-id='80f4b756' name='func'/>
      <parameter type-id='80f4b756' name='format'/>
      <parameter type-id='b7f2d5e6' name='ap'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_dump' mangled-name='spdk_log_dump' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_dump'>
      <parameter type-id='822cd80b' name='fp'/>
      <parameter type-id='80f4b756' name='label'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='bba1f737'>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='2448a865'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='b7f2d5e6'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='log_flags.c' language='LANG_C99'>
    <class-decl name='spdk_log_flag' size-in-bits='256' is-struct='yes' visibility='default' id='c29bb739'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='enabled' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ce203111' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b7ad7fe1' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='c29bb739' size-in-bits='64' id='ce203111'/>
    <pointer-type-def type-id='ce203111' size-in-bits='64' id='b7ad7fe1'/>
    <function-decl name='spdk_log_register_flag' mangled-name='spdk_log_register_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_register_flag'>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='ce203111' name='flag'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_log_get_flag' mangled-name='spdk_log_get_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_flag'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_log_set_flag' mangled-name='spdk_log_set_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_set_flag'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_clear_flag' mangled-name='spdk_log_clear_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_clear_flag'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_log_get_first_flag' mangled-name='spdk_log_get_first_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_first_flag'>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_get_next_flag' mangled-name='spdk_log_get_next_flag' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_get_next_flag'>
      <parameter type-id='ce203111' name='flag'/>
      <return type-id='ce203111'/>
    </function-decl>
    <function-decl name='spdk_log_usage' mangled-name='spdk_log_usage' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_log_usage'>
      <parameter type-id='822cd80b' name='f'/>
      <parameter type-id='80f4b756' name='log_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
