<abi-corpus version='2.4' soname='libspdk_util.so.11.0'>
  <elf-needed>
    <dependency name='libuuid.so.1'/>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_base64_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_decode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_base64_urlsafe_encode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_capacity' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_clear_mask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bit_array_count_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='uuid_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uuid_generate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uuid_generate_sha1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uuid_is_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uuid_parse' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uuid_unparse_lower' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='vsnprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='EVP_DigestFinal_ex' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_DigestInit_ex' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_DigestUpdate' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_MD_CTX_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_MD_CTX_new' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='EVP_md5' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='crc16_t10dif' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='crc16_t10dif_copy' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='crc32_iscsi' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='crc64_rocksoft_refl' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_realloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='xor_gen' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='base64.c' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' hash='54c1e9f81ec7a1db' id='78c01427'/>
    <function-decl name='spdk_base64_encode' mangled-name='spdk_base64_encode' filepath='base64.c' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_encode' hash='9c7e25a67d484c6e'>
      <parameter type-id='26a90f95' name='dst' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='b59d7dce' name='src_len' filepath='base64.c' line='129' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_encode' mangled-name='spdk_base64_urlsafe_encode' filepath='base64.c' line='129' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_encode' hash='9c7e25a67d484c6e'>
      <parameter type-id='26a90f95' name='dst' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='eaa32e2f' name='src' filepath='base64.c' line='129' column='1'/>
      <parameter type-id='b59d7dce' name='src_len' filepath='base64.c' line='129' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_decode' mangled-name='spdk_base64_decode' filepath='base64.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_decode' hash='d37b7ddb510bfbc0'>
      <parameter type-id='eaa32e2f' name='dst' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='78c01427' name='dst_len' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='base64.c' line='242' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_base64_urlsafe_decode' mangled-name='spdk_base64_urlsafe_decode' filepath='base64.c' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_base64_urlsafe_decode' hash='d37b7ddb510bfbc0'>
      <parameter type-id='eaa32e2f' name='dst' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='78c01427' name='dst_len' filepath='base64.c' line='242' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='base64.c' line='242' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
  </abi-instr>
  <abi-instr address-size='64' path='bit_array.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eec'/>
    <qualified-type-def type-id='cfe40fb1' const='yes' id='58a40d50'/>
    <pointer-type-def type-id='58a40d50' size-in-bits='64' id='0441370e'/>
    <qualified-type-def type-id='e7349382' const='yes' id='bce190f9'/>
    <pointer-type-def type-id='bce190f9' size-in-bits='64' id='2a16fc29'/>
    <pointer-type-def type-id='cfe40fb1' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='6ef42d89' size-in-bits='64' id='4d63d799'/>
    <pointer-type-def type-id='e7349382' size-in-bits='64' id='d5dec3d0'/>
    <pointer-type-def type-id='d5dec3d0' size-in-bits='64' id='a7ae828e'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bit_array.c' line='24' column='1' id='cfe40fb1'/>
    <function-decl name='spdk_bit_array_create' mangled-name='spdk_bit_array_create' filepath='bit_array.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_create' hash='2bb88322482ae81c'>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='30' column='1'/>
      <return type-id='6ef42d89'/>
    </function-decl>
    <function-decl name='spdk_bit_array_free' mangled-name='spdk_bit_array_free' filepath='bit_array.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_free' hash='7f32ffea222edbe7'>
      <parameter type-id='4d63d799' name='bap' filepath='bit_array.c' line='40' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_resize' mangled-name='spdk_bit_array_resize' filepath='bit_array.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_resize' hash='6668baab5275d4c5'>
      <parameter type-id='4d63d799' name='bap' filepath='bit_array.c' line='67' column='1'/>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='67' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_capacity' mangled-name='spdk_bit_array_capacity' filepath='bit_array.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_capacity' hash='2bb88322482ae81c'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='283' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_get' mangled-name='spdk_bit_array_get' filepath='bit_array.c' line='151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_get' hash='79745b8d969ff31b'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='151' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='151' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_array_set' mangled-name='spdk_bit_array_set' filepath='bit_array.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_set' hash='6668baab5275d4c5'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='163' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='163' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear' mangled-name='spdk_bit_array_clear' filepath='bit_array.c' line='176' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear' hash='2bb88322482ae81c'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='176' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='176' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_set' mangled-name='spdk_bit_array_find_first_set' filepath='bit_array.c' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_set' hash='0389e499374a3f97'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='247' column='1'/>
      <parameter type-id='8f92235e' name='start_bit_index' filepath='bit_array.c' line='247' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_find_first_clear' mangled-name='spdk_bit_array_find_first_clear' filepath='bit_array.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_find_first_clear' hash='0389e499374a3f97'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='247' column='1'/>
      <parameter type-id='8f92235e' name='start_bit_index' filepath='bit_array.c' line='247' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_set' mangled-name='spdk_bit_array_count_set' filepath='bit_array.c' line='265' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_set' hash='2bb88322482ae81c'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='283' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_count_clear' mangled-name='spdk_bit_array_count_clear' filepath='bit_array.c' line='283' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_count_clear' hash='2bb88322482ae81c'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='283' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_array_store_mask' mangled-name='spdk_bit_array_store_mask' filepath='bit_array.c' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_store_mask' hash='7f32ffea222edbe7'>
      <parameter type-id='0441370e' name='ba' filepath='bit_array.c' line='289' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='289' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_load_mask' mangled-name='spdk_bit_array_load_mask' filepath='bit_array.c' line='307' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_load_mask' hash='7f32ffea222edbe7'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='307' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='307' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_array_clear_mask' mangled-name='spdk_bit_array_clear_mask' filepath='bit_array.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_array_clear_mask' hash='7f32ffea222edbe7'>
      <parameter type-id='6ef42d89' name='ba' filepath='bit_array.c' line='325' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_bit_pool' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='bit_array.c' line='338' column='1' id='e7349382'/>
    <function-decl name='spdk_bit_pool_create' mangled-name='spdk_bit_pool_create' filepath='bit_array.c' line='345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create' hash='2bb88322482ae81c'>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='345' column='1'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_create_from_array' mangled-name='spdk_bit_pool_create_from_array' filepath='bit_array.c' line='369' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_create_from_array' hash='7f32ffea222edbe7'>
      <parameter type-id='6ef42d89' name='array' filepath='bit_array.c' line='369' column='1'/>
      <return type-id='d5dec3d0'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free' mangled-name='spdk_bit_pool_free' filepath='bit_array.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free' hash='7f32ffea222edbe7'>
      <parameter type-id='a7ae828e' name='ppool' filepath='bit_array.c' line='386' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_resize' mangled-name='spdk_bit_pool_resize' filepath='bit_array.c' line='403' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_resize' hash='6668baab5275d4c5'>
      <parameter type-id='a7ae828e' name='ppool' filepath='bit_array.c' line='403' column='1'/>
      <parameter type-id='8f92235e' name='num_bits' filepath='bit_array.c' line='403' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_capacity' mangled-name='spdk_bit_pool_capacity' filepath='bit_array.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_capacity' hash='2bb88322482ae81c'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='490' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_is_allocated' mangled-name='spdk_bit_pool_is_allocated' filepath='bit_array.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_is_allocated' hash='79745b8d969ff31b'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='429' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='429' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_allocate_bit' mangled-name='spdk_bit_pool_allocate_bit' filepath='bit_array.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_allocate_bit' hash='2bb88322482ae81c'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='435' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_set_bit_allocated' mangled-name='spdk_bit_pool_set_bit_allocated' filepath='bit_array.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_set_bit_allocated' hash='6668baab5275d4c5'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='450' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='450' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_bit' mangled-name='spdk_bit_pool_free_bit' filepath='bit_array.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_bit' hash='2bb88322482ae81c'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='472' column='1'/>
      <parameter type-id='8f92235e' name='bit_index' filepath='bit_array.c' line='472' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_allocated' mangled-name='spdk_bit_pool_count_allocated' filepath='bit_array.c' line='484' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_allocated' hash='2bb88322482ae81c'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='490' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_count_free' mangled-name='spdk_bit_pool_count_free' filepath='bit_array.c' line='490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_count_free' hash='2bb88322482ae81c'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='490' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_store_mask' mangled-name='spdk_bit_pool_store_mask' filepath='bit_array.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_store_mask' hash='7f32ffea222edbe7'>
      <parameter type-id='2a16fc29' name='pool' filepath='bit_array.c' line='496' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='496' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_load_mask' mangled-name='spdk_bit_pool_load_mask' filepath='bit_array.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_load_mask' hash='7f32ffea222edbe7'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='502' column='1'/>
      <parameter type-id='eaa32e2f' name='mask' filepath='bit_array.c' line='502' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bit_pool_free_all_bits' mangled-name='spdk_bit_pool_free_all_bits' filepath='bit_array.c' line='510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bit_pool_free_all_bits' hash='7f32ffea222edbe7'>
      <parameter type-id='d5dec3d0' name='pool' filepath='bit_array.c' line='510' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='cpuset.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_cpuset' is-struct='yes' visibility='default' size-in-bits='3080' filepath='cpuset.h' line='25' column='1' hash='c4979574ded471d6' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' hash='d146d941c673b418' id='c768f32d'>
      <subrange length='128' lower-bound='0' upper-bound='127' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6d1a6a21feae6dd2' id='1eb1687a'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <qualified-type-def type-id='aec5215a' const='yes' hash='9ec73d88b6bfc7ef' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' hash='18395ee449757275' id='75291c35'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' hash='3b069d0e8f010cd1' id='d5319498'/>
    <pointer-type-def type-id='122f096e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c6dc7e1f'/>
    <function-decl name='spdk_cpuset_alloc' mangled-name='spdk_cpuset_alloc' filepath='cpuset.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_alloc' hash='10eb1064c040b228'>
      <return type-id='d5319498'/>
    </function-decl>
    <function-decl name='spdk_cpuset_free' mangled-name='spdk_cpuset_free' filepath='cpuset.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_free' hash='10eb1064c040b228'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='81' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_equal' mangled-name='spdk_cpuset_equal' filepath='cpuset.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_equal' hash='4d53606659d06c6c'>
      <parameter type-id='75291c35' name='set1' filepath='cpuset.c' line='22' column='1'/>
      <parameter type-id='75291c35' name='set2' filepath='cpuset.c' line='22' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_copy' mangled-name='spdk_cpuset_copy' filepath='cpuset.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_copy' hash='d0068e8b28509791'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='70' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='70' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_negate' mangled-name='spdk_cpuset_negate' filepath='cpuset.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_negate' hash='10eb1064c040b228'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='81' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_and' mangled-name='spdk_cpuset_and' filepath='cpuset.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_and' hash='d0068e8b28509791'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='70' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='70' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_or' mangled-name='spdk_cpuset_or' filepath='cpuset.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_or' hash='d0068e8b28509791'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='70' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='70' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_xor' mangled-name='spdk_cpuset_xor' filepath='cpuset.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_xor' hash='d0068e8b28509791'>
      <parameter type-id='d5319498' name='dst' filepath='cpuset.c' line='70' column='1'/>
      <parameter type-id='75291c35' name='src' filepath='cpuset.c' line='70' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_zero' mangled-name='spdk_cpuset_zero' filepath='cpuset.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_zero' hash='10eb1064c040b228'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='81' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_set_cpu' mangled-name='spdk_cpuset_set_cpu' filepath='cpuset.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_set_cpu' hash='f53056c845586997'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='88' column='1'/>
      <parameter type-id='8f92235e' name='cpu' filepath='cpuset.c' line='88' column='1'/>
      <parameter type-id='c894953d' name='state' filepath='cpuset.c' line='88' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_get_cpu' mangled-name='spdk_cpuset_get_cpu' filepath='cpuset.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_get_cpu' hash='306e4365f55390f9'>
      <parameter type-id='75291c35' name='set' filepath='cpuset.c' line='100' column='1'/>
      <parameter type-id='8f92235e' name='cpu' filepath='cpuset.c' line='100' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_cpuset_for_each_cpu' mangled-name='spdk_cpuset_for_each_cpu' filepath='cpuset.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_for_each_cpu' hash='71de89cbf1785e58'>
      <parameter type-id='75291c35' name='set' filepath='cpuset.c' line='108' column='1'/>
      <parameter type-id='c6dc7e1f' name='fn' filepath='cpuset.c' line='109' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='cpuset.c' line='109' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_cpuset_count' mangled-name='spdk_cpuset_count' filepath='cpuset.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_count' hash='4ba5e9d1ba69b37f'>
      <parameter type-id='75291c35' name='set' filepath='cpuset.c' line='132' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_cpuset_fmt' mangled-name='spdk_cpuset_fmt' filepath='cpuset.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_fmt' hash='7603693f31ac2d27'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='141' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_cpuset_parse' mangled-name='spdk_cpuset_parse' filepath='cpuset.c' line='300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_cpuset_parse' hash='546b33bfc91a84fe'>
      <parameter type-id='d5319498' name='set' filepath='cpuset.c' line='300' column='1'/>
      <parameter type-id='80f4b756' name='mask' filepath='cpuset.c' line='300' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='2bb88322482ae81c' id='122f096e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='crc16.c' language='LANG_C11'>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eed'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' hash='24d8cca8965ce13e' id='ae3e8ca6'/>
    <function-decl name='spdk_crc16_t10dif' mangled-name='spdk_crc16_t10dif' filepath='crc16.c' line='17' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif' hash='a03ee8e0e0286cf4'>
      <parameter type-id='149c6638' name='init_crc' filepath='crc16.c' line='17' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc16.c' line='17' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc16.c' line='17' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_crc16_t10dif_copy' mangled-name='spdk_crc16_t10dif_copy' filepath='crc16.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc16_t10dif_copy' hash='fb76a13ff80227e7'>
      <parameter type-id='149c6638' name='init_crc' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='ae3e8ca6' name='dst' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='ae3e8ca6' name='src' filepath='crc16.c' line='23' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc16.c' line='24' column='1'/>
      <return type-id='149c6638'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32_ieee.c' language='LANG_C11'>
    <function-decl name='spdk_crc32_ieee_update' mangled-name='spdk_crc32_ieee_update' filepath='crc32_ieee.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32_ieee_update' hash='11359469beb6e735'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32_ieee.c' line='18' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc32c.c' language='LANG_C11'>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <function-decl name='spdk_crc32c_update' mangled-name='spdk_crc32c_update' filepath='crc32c.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_update' hash='11359469beb6e735'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32_ieee.c' line='18' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_crc32c_iov_update' mangled-name='spdk_crc32c_iov_update' filepath='crc32c.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_iov_update' hash='4c0c289f4042f730'>
      <parameter type-id='cc4b1be9' name='iov' filepath='crc32c.c' line='112' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='crc32c.c' line='112' column='1'/>
      <parameter type-id='8f92235e' name='crc32c' filepath='crc32c.c' line='112' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_crc32c_nvme' mangled-name='spdk_crc32c_nvme' filepath='crc32c.c' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc32c_nvme' hash='11359469beb6e735'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc32_ieee.c' line='18' column='1'/>
      <parameter type-id='8f92235e' name='crc' filepath='crc32_ieee.c' line='18' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='crc64.c' language='LANG_C11'>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <function-decl name='spdk_crc64_nvme' mangled-name='spdk_crc64_nvme' filepath='crc64.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_crc64_nvme' hash='a46227d8770aeeb5'>
      <parameter type-id='eaa32e2f' name='buf' filepath='crc64.c' line='13' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='crc64.c' line='13' column='1'/>
      <parameter type-id='9c313c2d' name='crc' filepath='crc64.c' line='13' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dif.c' language='LANG_C11'>
    <enum-decl name='spdk_dif_pi_format' size-in-bits='32' alignment-in-bits='32' filepath='dif.h' line='50' column='1' hash='5a03827420007bb5' id='d940afde'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_16' value='0'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_32' value='1'/>
      <enumerator name='SPDK_DIF_PI_FORMAT_64' value='2'/>
    </enum-decl>
    <enum-decl name='spdk_dif_type' size-in-bits='32' alignment-in-bits='32' filepath='dif.h' line='37' column='1' hash='67f6f95a0f174265' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <class-decl name='spdk_dif_ctx' is-struct='yes' visibility='default' size-in-bits='512' filepath='dif.h' line='65' column='1' hash='3fa86a99bcca3589' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='117' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_ctx_init_ext_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='dif.h' line='56' column='1' hash='0c6b55da6c764e56' id='d3237ae7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='dif.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dif_pi_format' type-id='8f92235e' visibility='default' filepath='dif.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_dif_error' is-struct='yes' visibility='default' size-in-bits='256' filepath='dif.h' line='122' column='1' hash='1c8ca713d84d211b' id='035f351a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='err_type' type-id='b96825af' visibility='default' filepath='dif.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rsvd' type-id='d3538ec5' visibility='default' filepath='dif.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='expected' type-id='9c313c2d' visibility='default' filepath='dif.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='actual' type-id='9c313c2d' visibility='default' filepath='dif.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='err_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' hash='2d5fed862e074f47' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' hash='b2afc7891a8b4aa4' id='d3538ec5'>
      <subrange length='7' lower-bound='0' upper-bound='6' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='58190901bcecd086' id='16fc326e'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <qualified-type-def type-id='6e011169' const='yes' hash='79ceb31c961be71d' id='507bcddc'/>
    <pointer-type-def type-id='507bcddc' size-in-bits='64' hash='b74b42c0aaa673c9' id='a8e53a42'/>
    <pointer-type-def type-id='6e011169' size-in-bits='64' hash='09fde6bcda1f9892' id='a3141401'/>
    <pointer-type-def type-id='d3237ae7' size-in-bits='64' hash='2f8ae99a6b9bf095' id='343546bf'/>
    <pointer-type-def type-id='035f351a' size-in-bits='64' hash='4ba7187bfa0b834d' id='c7935638'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' hash='a285db8f38e4ea02' id='90421557'/>
    <function-decl name='spdk_dif_pi_format_get_size' mangled-name='spdk_dif_pi_format_get_size' filepath='dif.c' line='198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_pi_format_get_size' hash='a4bc7b8558e61393'>
      <parameter type-id='d940afde' name='dif_pi_format' filepath='dif.c' line='198' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_init' mangled-name='spdk_dif_ctx_init' filepath='dif.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_init' hash='2ac593538cbb5e53'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='577' column='1'/>
      <parameter type-id='8f92235e' name='block_size' filepath='dif.c' line='577' column='1'/>
      <parameter type-id='8f92235e' name='md_size' filepath='dif.c' line='577' column='1'/>
      <parameter type-id='c894953d' name='md_interleave' filepath='dif.c' line='578' column='1'/>
      <parameter type-id='c894953d' name='dif_loc' filepath='dif.c' line='578' column='1'/>
      <parameter type-id='388e2dcf' name='dif_type' filepath='dif.c' line='578' column='1'/>
      <parameter type-id='8f92235e' name='dif_flags' filepath='dif.c' line='578' column='1'/>
      <parameter type-id='8f92235e' name='init_ref_tag' filepath='dif.c' line='579' column='1'/>
      <parameter type-id='149c6638' name='apptag_mask' filepath='dif.c' line='579' column='1'/>
      <parameter type-id='149c6638' name='app_tag' filepath='dif.c' line='579' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='580' column='1'/>
      <parameter type-id='9c313c2d' name='guard_seed' filepath='dif.c' line='580' column='1'/>
      <parameter type-id='343546bf' name='opts' filepath='dif.c' line='580' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_data_offset' mangled-name='spdk_dif_ctx_set_data_offset' filepath='dif.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_data_offset' hash='111ec0168e29612a'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='667' column='1'/>
      <parameter type-id='8f92235e' name='remapped_init_ref_tag' filepath='dif.c' line='668' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_ctx_set_remapped_init_ref_tag' mangled-name='spdk_dif_ctx_set_remapped_init_ref_tag' filepath='dif.c' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_ctx_set_remapped_init_ref_tag' hash='111ec0168e29612a'>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='667' column='1'/>
      <parameter type-id='8f92235e' name='remapped_init_ref_tag' filepath='dif.c' line='668' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_generate' mangled-name='spdk_dif_generate' filepath='dif.c' line='815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate' hash='f271d08c769cf050'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='815' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='815' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='815' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='816' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify' mangled-name='spdk_dif_verify' filepath='dif.c' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify' hash='dd556f5e2150ecf6'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1062' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1062' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1062' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1063' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='1063' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c' mangled-name='spdk_dif_update_crc32c' filepath='dif.c' line='1145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c' hash='7aa2b7d37ee35605'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1145' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1145' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1145' column='1'/>
      <parameter type-id='90421557' name='_crc32c' filepath='dif.c' line='1146' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1146' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_copy' mangled-name='spdk_dif_generate_copy' filepath='dif.c' line='1408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_copy' hash='5fc7d9cba141137d'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1408' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1408' column='1'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs' filepath='dif.c' line='1408' column='1'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt' filepath='dif.c' line='1409' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1409' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1410' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_copy' mangled-name='spdk_dif_verify_copy' filepath='dif.c' line='1698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_copy' hash='6b7dca3ffe2538d0'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1698' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1698' column='1'/>
      <parameter type-id='cc4b1be9' name='bounce_iovs' filepath='dif.c' line='1698' column='1'/>
      <parameter type-id='95e97e5e' name='bounce_iovcnt' filepath='dif.c' line='1699' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1699' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1700' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='1701' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_inject_error' mangled-name='spdk_dif_inject_error' filepath='dif.c' line='1790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_inject_error' hash='5974171cb3ca7ee7'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1790' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1790' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1790' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1791' column='1'/>
      <parameter type-id='8f92235e' name='inject_flags' filepath='dif.c' line='1791' column='1'/>
      <parameter type-id='90421557' name='inject_offset' filepath='dif.c' line='1792' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_generate' mangled-name='spdk_dix_generate' filepath='dif.c' line='1936' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_generate' hash='d082745816986885'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='1936' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='1936' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='1936' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='1937' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='1937' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_verify' mangled-name='spdk_dix_verify' filepath='dif.c' line='2056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_verify' hash='26b7685c8ef6af60'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2056' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2056' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='2056' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2057' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2057' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2058' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_inject_error' mangled-name='spdk_dix_inject_error' filepath='dif.c' line='2088' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_inject_error' hash='1b96f97d05c7322d'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2088' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2088' column='1'/>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='2088' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2089' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2089' column='1'/>
      <parameter type-id='8f92235e' name='inject_flags' filepath='dif.c' line='2090' column='1'/>
      <parameter type-id='90421557' name='inject_offset' filepath='dif.c' line='2090' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_set_md_interleave_iovs' mangled-name='spdk_dif_set_md_interleave_iovs' filepath='dif.c' line='2167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_set_md_interleave_iovs' hash='2b497fd51b60bc1e'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2167' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2167' column='1'/>
      <parameter type-id='cc4b1be9' name='buf_iovs' filepath='dif.c' line='2168' column='1'/>
      <parameter type-id='95e97e5e' name='buf_iovcnt' filepath='dif.c' line='2168' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='2169' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2169' column='1'/>
      <parameter type-id='90421557' name='_mapped_len' filepath='dif.c' line='2170' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2171' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_generate_stream' mangled-name='spdk_dif_generate_stream' filepath='dif.c' line='2256' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_generate_stream' hash='edf93f2bcc9131be'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2256' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2256' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='2257' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2257' column='1'/>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='2258' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_verify_stream' mangled-name='spdk_dif_verify_stream' filepath='dif.c' line='2300' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_verify_stream' hash='9049ccf9421eb979'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2300' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2300' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='2301' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2301' column='1'/>
      <parameter type-id='a3141401' name='ctx' filepath='dif.c' line='2302' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2303' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_update_crc32c_stream' mangled-name='spdk_dif_update_crc32c_stream' filepath='dif.c' line='2349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_update_crc32c_stream' hash='56696d055a915bc4'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2349' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2349' column='1'/>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='2350' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2350' column='1'/>
      <parameter type-id='90421557' name='_crc32c' filepath='dif.c' line='2351' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2351' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dif_get_range_with_md' mangled-name='spdk_dif_get_range_with_md' filepath='dif.c' line='2386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_range_with_md' hash='d06e175eb096d3be'>
      <parameter type-id='8f92235e' name='data_offset' filepath='dif.c' line='2386' column='1'/>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2386' column='1'/>
      <parameter type-id='90421557' name='_buf_offset' filepath='dif.c' line='2387' column='1'/>
      <parameter type-id='90421557' name='_buf_len' filepath='dif.c' line='2387' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2388' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_dif_get_length_with_md' mangled-name='spdk_dif_get_length_with_md' filepath='dif.c' line='2415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_get_length_with_md' hash='9dea9050499065d2'>
      <parameter type-id='8f92235e' name='data_len' filepath='dif.c' line='2415' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2415' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_dif_remap_ref_tag' mangled-name='spdk_dif_remap_ref_tag' filepath='dif.c' line='2496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dif_remap_ref_tag' hash='5e10c20844e6cd3a'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='dif.c' line='2496' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='dif.c' line='2496' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2496' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2497' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2497' column='1'/>
      <parameter type-id='c894953d' name='check_ref_tag' filepath='dif.c' line='2498' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_dix_remap_ref_tag' mangled-name='spdk_dix_remap_ref_tag' filepath='dif.c' line='2572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_dix_remap_ref_tag' hash='dbefada582418e13'>
      <parameter type-id='cc4b1be9' name='md_iov' filepath='dif.c' line='2572' column='1'/>
      <parameter type-id='8f92235e' name='num_blocks' filepath='dif.c' line='2572' column='1'/>
      <parameter type-id='a8e53a42' name='ctx' filepath='dif.c' line='2573' column='1'/>
      <parameter type-id='c7935638' name='err_blk' filepath='dif.c' line='2574' column='1'/>
      <parameter type-id='c894953d' name='check_ref_tag' filepath='dif.c' line='2575' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd.c' language='LANG_C11'>
    <function-decl name='spdk_fd_get_blocklen' mangled-name='spdk_fd_get_blocklen' filepath='fd.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_blocklen' hash='29887d081255b4ed'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='41' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_fd_get_size' mangled-name='spdk_fd_get_size' filepath='fd.c' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_get_size' hash='2dc81cf21cc431f4'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='67' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_fd_set_nonblock' mangled-name='spdk_fd_set_nonblock' filepath='fd.c' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_set_nonblock' hash='d628501fd2223339'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='131' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_clear_nonblock' mangled-name='spdk_fd_clear_nonblock' filepath='fd.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_clear_nonblock' hash='d628501fd2223339'>
      <parameter type-id='95e97e5e' name='fd' filepath='fd.c' line='131' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='fd_group.c' language='LANG_C11'>
    <class-decl name='epoll_event' is-struct='yes' visibility='default' size-in-bits='96' filepath='epoll.h' line='85' column='1' hash='ff86c5f5aa86b0c8' id='7064bc4a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='events' type-id='8f92235e' visibility='default' filepath='epoll.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='data' type-id='86315334' visibility='default' filepath='epoll.h' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_event_handler_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='fd_group.h' line='36' column='1' hash='e7ab4467a2066d96' id='67302c12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='fd_group.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='events' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fd_type' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='epoll_data_t' type-id='c72ff3d7' size-in-bits='64' filepath='epoll.h' line='83' column='1' id='86315334'/>
    <typedef-decl name='spdk_fd_fn' type-id='c04372aa' size-in-bits='64' filepath='fd_group.h' line='62' column='1' hash='fd7a63c0c6c822c4' id='12d464a6'/>
    <typedef-decl name='spdk_fd_group_wrapper_fn' type-id='343896c2' size-in-bits='64' filepath='fd_group.h' line='248' column='1' hash='fd7a63c0c6c822c4' id='15c31fa6'/>
    <union-decl name='epoll_data' visibility='default' size-in-bits='64' filepath='epoll.h' line='77' column='1' hash='b7b019b718d186c4' id='c72ff3d7'>
      <data-member access='public'>
        <var-decl name='ptr' type-id='eaa32e2f' visibility='default' filepath='epoll.h' line='79' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default' filepath='epoll.h' line='80' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u32' type-id='8f92235e' visibility='default' filepath='epoll.h' line='81' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='u64' type-id='9c313c2d' visibility='default' filepath='epoll.h' line='82' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='7064bc4a' size-in-bits='64' hash='7c23e53f6891bab3' id='9da7f678'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' hash='fd7a63c0c6c822c4' id='c04372aa'/>
    <pointer-type-def type-id='b2a34c6b' size-in-bits='64' hash='fd7a63c0c6c822c4' id='343896c2'/>
    <pointer-type-def type-id='67302c12' size-in-bits='64' hash='208620969292ce77' id='bfd3fa20'/>
    <pointer-type-def type-id='c8d12ece' size-in-bits='64' id='eb7a8954'/>
    <pointer-type-def type-id='eb7a8954' size-in-bits='64' id='2fe6715a'/>
    <class-decl name='spdk_fd_group' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='fd_group.c' line='45' column='1' id='c8d12ece'/>
    <function-decl name='spdk_fd_group_get_fd' mangled-name='spdk_fd_group_get_fd' filepath='fd_group.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_fd' hash='388da3fa973fde78'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='65' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_get_epoll_event' mangled-name='spdk_fd_group_get_epoll_event' filepath='fd_group.c' line='75' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_epoll_event' hash='0a59a3f7b42bdbf8'>
      <parameter type-id='9da7f678' name='event' filepath='fd_group.c' line='75' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_unnest' mangled-name='spdk_fd_group_unnest' filepath='fd_group.c' line='251' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_unnest' hash='388da3fa973fde78'>
      <parameter type-id='eb7a8954' name='parent' filepath='fd_group.c' line='279' column='1'/>
      <parameter type-id='eb7a8954' name='child' filepath='fd_group.c' line='279' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_nest' mangled-name='spdk_fd_group_nest' filepath='fd_group.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_nest' hash='388da3fa973fde78'>
      <parameter type-id='eb7a8954' name='parent' filepath='fd_group.c' line='279' column='1'/>
      <parameter type-id='eb7a8954' name='child' filepath='fd_group.c' line='279' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_get_default_event_handler_opts' mangled-name='spdk_fd_group_get_default_event_handler_opts' filepath='fd_group.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_get_default_event_handler_opts' hash='7e2a3f6ba64e545f'>
      <parameter type-id='bfd3fa20' name='opts' filepath='fd_group.c' line='314' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='fd_group.c' line='315' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_add' mangled-name='spdk_fd_group_add' filepath='fd_group.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_add' hash='1016f40212c3f267'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='376' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='376' column='1'/>
      <parameter type-id='12d464a6' name='fn' filepath='fd_group.c' line='376' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='fd_group.c' line='377' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='fd_group.c' line='377' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_add_for_events' mangled-name='spdk_fd_group_add_for_events' filepath='fd_group.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_add_for_events' hash='74201d928a91e9f6'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='383' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='383' column='1'/>
      <parameter type-id='8f92235e' name='events' filepath='fd_group.c' line='383' column='1'/>
      <parameter type-id='12d464a6' name='fn' filepath='fd_group.c' line='384' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='fd_group.c' line='384' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='fd_group.c' line='384' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_add_ext' mangled-name='spdk_fd_group_add_ext' filepath='fd_group.c' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_add_ext' hash='d905d9005a446e2c'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='396' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='396' column='1'/>
      <parameter type-id='12d464a6' name='fn' filepath='fd_group.c' line='396' column='1'/>
      <parameter type-id='eaa32e2f' name='arg' filepath='fd_group.c' line='396' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='fd_group.c' line='397' column='1'/>
      <parameter type-id='bfd3fa20' name='opts' filepath='fd_group.c' line='397' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_remove' mangled-name='spdk_fd_group_remove' filepath='fd_group.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_remove' hash='388da3fa973fde78'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='455' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='455' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_event_modify' mangled-name='spdk_fd_group_event_modify' filepath='fd_group.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_event_modify' hash='a9fd86e6e981c3b5'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='503' column='1'/>
      <parameter type-id='95e97e5e' name='efd' filepath='fd_group.c' line='504' column='1'/>
      <parameter type-id='95e97e5e' name='event_types' filepath='fd_group.c' line='504' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_create' mangled-name='spdk_fd_group_create' filepath='fd_group.c' line='534' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_create' hash='388da3fa973fde78'>
      <parameter type-id='2fe6715a' name='_egrp' filepath='fd_group.c' line='534' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_destroy' mangled-name='spdk_fd_group_destroy' filepath='fd_group.c' line='564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='564' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_fd_group_wait' mangled-name='spdk_fd_group_wait' filepath='fd_group.c' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_wait' hash='d628501fd2223339'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='593' column='1'/>
      <parameter type-id='95e97e5e' name='timeout' filepath='fd_group.c' line='593' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_fd_group_set_wrapper' mangled-name='spdk_fd_group_set_wrapper' filepath='fd_group.c' line='704' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_fd_group_set_wrapper' hash='a7f99494147764a8'>
      <parameter type-id='eb7a8954' name='fgrp' filepath='fd_group.c' line='704' column='1'/>
      <parameter type-id='15c31fa6' name='fn' filepath='fd_group.c' line='704' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='fd_group.c' line='704' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='a7f99494147764a8' id='b2a34c6b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='12d464a6'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='file.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eed' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='ede1f91d' visibility='default' filepath='struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='8910171f' visibility='default' filepath='struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='8e100159' visibility='default' filepath='struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='45' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='dca988a5' size-in-bits='64' hash='e8c018048121152c' id='ede1f91d'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' hash='a93039fe023ed77b' id='9b23c9ad'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <function-decl name='spdk_posix_file_load' mangled-name='spdk_posix_file_load' filepath='file.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_posix_file_load' hash='eb5ac022e84932e1'>
      <parameter type-id='822cd80b' name='file' filepath='file.c' line='10' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='file.c' line='10' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_posix_file_load_from_name' mangled-name='spdk_posix_file_load_from_name' filepath='file.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_posix_file_load_from_name' hash='114ffec73b719831'>
      <parameter type-id='80f4b756' name='file_name' filepath='file.c' line='47' column='1'/>
      <parameter type-id='78c01427' name='size' filepath='file.c' line='47' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_read_sysfs_attribute' mangled-name='spdk_read_sysfs_attribute' filepath='file.c' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_read_sysfs_attribute' hash='d6f2fc1aba7fa56c'>
      <parameter type-id='9b23c9ad' name='attribute_p' filepath='file.c' line='109' column='1'/>
      <parameter type-id='80f4b756' name='path_format' filepath='file.c' line='109' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_read_sysfs_attribute_uint32' mangled-name='spdk_read_sysfs_attribute_uint32' filepath='file.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_read_sysfs_attribute_uint32' hash='e93b08feb1771e16'>
      <parameter type-id='90421557' name='attribute' filepath='file.c' line='122' column='1'/>
      <parameter type-id='80f4b756' name='path_format' filepath='file.c' line='122' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
  </abi-instr>
  <abi-instr address-size='64' path='hexlify.c' language='LANG_C11'>
    <function-decl name='spdk_hexlify' mangled-name='spdk_hexlify' filepath='hexlify.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_hexlify' hash='64b4b60cdba4ca37'>
      <parameter type-id='80f4b756' name='bin' filepath='hexlify.c' line='35' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='hexlify.c' line='35' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_unhexlify' mangled-name='spdk_unhexlify' filepath='hexlify.c' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_unhexlify' hash='bac6a89264ba699c'>
      <parameter type-id='80f4b756' name='hex' filepath='hexlify.c' line='60' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='iov.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='7ba5bfe3' size-in-bits='640' hash='9d6b87062fe2e83b' id='0918d7f1'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='7ba5bfe3' size-in-bits='unknown' hash='90f74be69381a773' id='c2430667'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <class-decl name='spdk_iov_xfer' is-struct='yes' visibility='default' size-in-bits='192' filepath='util.h' line='285' column='1' hash='505300d9f30cdc23' id='b1ac7456'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='util.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='util.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='cur_iov_idx' type-id='95e97e5e' visibility='default' filepath='util.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cur_iov_offset' type-id='b59d7dce' visibility='default' filepath='util.h' line='289' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_ioviter' is-struct='yes' visibility='default' size-in-bits='704' filepath='util.h' line='198' column='1' hash='5ba4d096289de34c' id='cda159a0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='8f92235e' visibility='default' filepath='util.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_single_ioviter' is-struct='yes' visibility='default' size-in-bits='320' filepath='util.h' line='185' column='1' hash='428f6ca3ae25c3fb' id='7ba5bfe3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default' filepath='util.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='b59d7dce' visibility='default' filepath='util.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='idx' type-id='b59d7dce' visibility='default' filepath='util.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='util.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='iov_base' type-id='ae3e8ca6' visibility='default' filepath='util.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='640' is-anonymous='yes' filepath='util.h' line='201' column='1' hash='74c765b3a4787592' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='iters_compat' type-id='0918d7f1' visibility='default' filepath='util.h' line='202' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='iters' type-id='c2430667' visibility='default' filepath='util.h' line='203' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='cc4b1be9' size-in-bits='64' hash='8de6cf6a3609be5f' id='5d3cb3f9'/>
    <pointer-type-def type-id='b1ac7456' size-in-bits='64' hash='e9b5bf0a9153b1e9' id='34d237dc'/>
    <pointer-type-def type-id='cda159a0' size-in-bits='64' hash='d68a3032d6c67adf' id='949c74e6'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <function-decl name='spdk_iov_memset' mangled-name='spdk_iov_memset' filepath='iov.c' line='10' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_memset' hash='90466b310c5e1b0c'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='10' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='10' column='1'/>
      <parameter type-id='95e97e5e' name='c' filepath='iov.c' line='10' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_ioviter_first' mangled-name='spdk_ioviter_first' filepath='iov.c' line='23' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_first' hash='b01e51fc70852437'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='23' column='1'/>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='24' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='24' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='25' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='25' column='1'/>
      <parameter type-id='63e171df' name='src' filepath='iov.c' line='26' column='1'/>
      <parameter type-id='63e171df' name='dst' filepath='iov.c' line='26' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_firstv' mangled-name='spdk_ioviter_firstv' filepath='iov.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_firstv' hash='99bbeda3277617f8'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='50' column='1'/>
      <parameter type-id='8f92235e' name='count' filepath='iov.c' line='51' column='1'/>
      <parameter type-id='5d3cb3f9' name='iov' filepath='iov.c' line='52' column='1'/>
      <parameter type-id='78c01427' name='iovcnt' filepath='iov.c' line='53' column='1'/>
      <parameter type-id='63e171df' name='out' filepath='iov.c' line='54' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_next' mangled-name='spdk_ioviter_next' filepath='iov.c' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_next' hash='91aa87c900df28df'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='74' column='1'/>
      <parameter type-id='63e171df' name='src' filepath='iov.c' line='74' column='1'/>
      <parameter type-id='63e171df' name='dst' filepath='iov.c' line='74' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_ioviter_nextv' mangled-name='spdk_ioviter_nextv' filepath='iov.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_ioviter_nextv' hash='312c6014dfc3a6ed'>
      <parameter type-id='949c74e6' name='iter' filepath='iov.c' line='90' column='1'/>
      <parameter type-id='63e171df' name='out' filepath='iov.c' line='90' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iovcpy' mangled-name='spdk_iovcpy' filepath='iov.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iovcpy' hash='cec533c03f8c0cca'>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='150' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iovmove' mangled-name='spdk_iovmove' filepath='iov.c' line='150' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iovmove' hash='cec533c03f8c0cca'>
      <parameter type-id='cc4b1be9' name='siov' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='b59d7dce' name='siovcnt' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='cc4b1be9' name='diov' filepath='iov.c' line='150' column='1'/>
      <parameter type-id='b59d7dce' name='diovcnt' filepath='iov.c' line='150' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_init' mangled-name='spdk_iov_xfer_init' filepath='iov.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_init' hash='bfcc7bb93dc66d9a'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='168' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='168' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='168' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_from_buf' mangled-name='spdk_iov_xfer_from_buf' filepath='iov.c' line='216' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_from_buf' hash='e5864e6e3ce40295'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='222' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='222' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='222' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_iov_xfer_to_buf' mangled-name='spdk_iov_xfer_to_buf' filepath='iov.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iov_xfer_to_buf' hash='e5864e6e3ce40295'>
      <parameter type-id='34d237dc' name='ix' filepath='iov.c' line='222' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='222' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='222' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_copy_iovs_to_buf' mangled-name='spdk_copy_iovs_to_buf' filepath='iov.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_iovs_to_buf' hash='3f0cc3c0f55c5e9c'>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='228' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='228' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='228' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='228' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_copy_buf_to_iovs' mangled-name='spdk_copy_buf_to_iovs' filepath='iov.c' line='237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_copy_buf_to_iovs' hash='64b79636c0ec04c0'>
      <parameter type-id='cc4b1be9' name='iovs' filepath='iov.c' line='237' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='iov.c' line='237' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iov.c' line='237' column='1'/>
      <parameter type-id='b59d7dce' name='buf_len' filepath='iov.c' line='237' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='math.c' language='LANG_C11'>
  </abi-instr>
  <abi-instr address-size='64' path='md5.c' language='LANG_C11'>
    <class-decl name='spdk_md5ctx' is-struct='yes' visibility='default' size-in-bits='64' filepath='md5.h' line='22' column='1' hash='ca9c9bb575ac4613' id='7d5f7e91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='md5ctx' type-id='f96b04ce' visibility='default' filepath='md5.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='7d5f7e91' size-in-bits='64' hash='6e68e81674a072bd' id='2b30d709'/>
    <pointer-type-def type-id='e179d075' size-in-bits='64' id='f96b04ce'/>
    <class-decl name='evp_md_ctx_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='59d94fa2'/>
    <function-decl name='spdk_md5init' mangled-name='spdk_md5init' filepath='md5.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_md5init' hash='70d58a409a6c0a2b'>
      <parameter type-id='2b30d709' name='md5ctx' filepath='md5.c' line='12' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_md5final' mangled-name='spdk_md5final' filepath='md5.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_md5final' hash='70d58a409a6c0a2b'>
      <parameter type-id='eaa32e2f' name='md5' filepath='md5.c' line='36' column='1'/>
      <parameter type-id='2b30d709' name='md5ctx' filepath='md5.c' line='36' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_md5pdate' mangled-name='spdk_md5update' filepath='md5.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_md5update' hash='ad3ef237ca73989c'>
      <parameter type-id='2b30d709' name='md5ctx' filepath='md5.c' line='50' column='1'/>
      <parameter type-id='eaa32e2f' name='data' filepath='md5.c' line='50' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='md5.c' line='50' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <typedef-decl name='EVP_MD_CTX' type-id='59d94fa2' filepath='types.h' line='113' column='1' id='e179d075'/>
  </abi-instr>
  <abi-instr address-size='64' path='net.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <class-decl name='sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='socket.h' line='184' column='1' hash='17b889f8dd08e00f' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default' filepath='socket.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default' filepath='socket.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_family_t' type-id='f0981eed' size-in-bits='16' filepath='sockaddr.h' line='28' column='1' hash='d7723bb93a30b11d' id='376fda66'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='64' hash='b051efca9beefff0' id='5c0abad8'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' hash='bd1d889facccead8' id='8a121f49'/>
    <function-decl name='spdk_net_get_interface_name' mangled-name='spdk_net_get_interface_name' filepath='net.c' line='13' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_net_get_interface_name' hash='989cd6034de8354f'>
      <parameter type-id='80f4b756' name='ip' filepath='net.c' line='13' column='1'/>
      <parameter type-id='26a90f95' name='ifc' filepath='net.c' line='13' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='net.c' line='13' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_net_get_address_string' mangled-name='spdk_net_get_address_string' filepath='net.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_net_get_address_string' hash='879fbdd191a8bfe4'>
      <parameter type-id='5c0abad8' name='sa' filepath='net.c' line='44' column='1'/>
      <parameter type-id='26a90f95' name='addr' filepath='net.c' line='44' column='1'/>
      <parameter type-id='b59d7dce' name='len' filepath='net.c' line='44' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_net_is_loopback' mangled-name='spdk_net_is_loopback' filepath='net.c' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_net_is_loopback' hash='bf8627a41670229c'>
      <parameter type-id='95e97e5e' name='fd' filepath='net.c' line='73' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_net_getaddr' mangled-name='spdk_net_getaddr' filepath='net.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_net_getaddr' hash='e1cc7295d154bda8'>
      <parameter type-id='95e97e5e' name='fd' filepath='net.c' line='126' column='1'/>
      <parameter type-id='26a90f95' name='laddr' filepath='net.c' line='126' column='1'/>
      <parameter type-id='95e97e5e' name='llen' filepath='net.c' line='126' column='1'/>
      <parameter type-id='8a121f49' name='lport' filepath='net.c' line='126' column='1'/>
      <parameter type-id='26a90f95' name='paddr' filepath='net.c' line='127' column='1'/>
      <parameter type-id='95e97e5e' name='plen' filepath='net.c' line='127' column='1'/>
      <parameter type-id='8a121f49' name='pport' filepath='net.c' line='127' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='pipe.c' language='LANG_C11'>
    <pointer-type-def type-id='ab2deffc' size-in-bits='64' id='cc32297a'/>
    <pointer-type-def type-id='cb0f9310' size-in-bits='64' id='85edcec6'/>
    <class-decl name='spdk_pipe_group' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='pipe.c' line='16' column='1' id='cb0f9310'/>
    <class-decl name='spdk_pipe' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='pipe.c' line='20' column='1' id='ab2deffc'/>
    <function-decl name='spdk_pipe_create' mangled-name='spdk_pipe_create' filepath='pipe.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_create' hash='2bb88322482ae81c'>
      <parameter type-id='eaa32e2f' name='buf' filepath='pipe.c' line='32' column='1'/>
      <parameter type-id='8f92235e' name='sz' filepath='pipe.c' line='32' column='1'/>
      <return type-id='cc32297a'/>
    </function-decl>
    <function-decl name='spdk_pipe_destroy' mangled-name='spdk_pipe_destroy' filepath='pipe.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='48' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_get_buffer' mangled-name='spdk_pipe_writer_get_buffer' filepath='pipe.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_get_buffer' hash='6b0a009742a6d8a0'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='204' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='204' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='pipe.c' line='204' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_writer_advance' mangled-name='spdk_pipe_writer_advance' filepath='pipe.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_writer_advance' hash='6668baab5275d4c5'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='247' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='247' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_bytes_available' mangled-name='spdk_pipe_reader_bytes_available' filepath='pipe.c' line='186' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_bytes_available' hash='2bb88322482ae81c'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='186' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_get_buffer' mangled-name='spdk_pipe_reader_get_buffer' filepath='pipe.c' line='204' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_get_buffer' hash='6b0a009742a6d8a0'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='204' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='204' column='1'/>
      <parameter type-id='cc4b1be9' name='iovs' filepath='pipe.c' line='204' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_reader_advance' mangled-name='spdk_pipe_reader_advance' filepath='pipe.c' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_reader_advance' hash='6668baab5275d4c5'>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='247' column='1'/>
      <parameter type-id='8f92235e' name='requested_sz' filepath='pipe.c' line='247' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_group_create' mangled-name='spdk_pipe_group_create' filepath='pipe.c' line='308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_group_create' hash='7f32ffea222edbe7'>
      <return type-id='85edcec6'/>
    </function-decl>
    <function-decl name='spdk_pipe_group_destroy' mangled-name='spdk_pipe_group_destroy' filepath='pipe.c' line='323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_group_destroy' hash='7f32ffea222edbe7'>
      <parameter type-id='85edcec6' name='group' filepath='pipe.c' line='323' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_pipe_group_add' mangled-name='spdk_pipe_group_add' filepath='pipe.c' line='334' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_group_add' hash='388da3fa973fde78'>
      <parameter type-id='85edcec6' name='group' filepath='pipe.c' line='357' column='1'/>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='357' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_pipe_group_remove' mangled-name='spdk_pipe_group_remove' filepath='pipe.c' line='357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_pipe_group_remove' hash='388da3fa973fde78'>
      <parameter type-id='85edcec6' name='group' filepath='pipe.c' line='357' column='1'/>
      <parameter type-id='cc32297a' name='pipe' filepath='pipe.c' line='357' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='strerror_tls.c' language='LANG_C11'>
    <function-decl name='spdk_strerror' mangled-name='spdk_strerror' filepath='strerror_tls.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror' hash='7cffa03161e7e042'>
      <parameter type-id='95e97e5e' name='errnum' filepath='strerror_tls.c' line='11' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='string.c' language='LANG_C11'>
    <type-decl name='long long int' size-in-bits='64' hash='5ae7f9eec1fc43d6#3' id='95e97e60'/>
    <class-decl name='__va_list_tag' is-struct='yes' visibility='default' size-in-bits='192' hash='3cf0fd8284404e34' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eec' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='d5027220' size-in-bits='64' hash='39fc40d7ba4ca689' id='b7f2d5e6'/>
    <pointer-type-def type-id='c894953d' size-in-bits='64' hash='9c0e3f8596726a0b' id='d8e6b335'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' hash='cea1d4b0943594a3' id='7d3cd834'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <function-decl name='spdk_vsprintf_append_realloc' mangled-name='spdk_vsprintf_append_realloc' filepath='string.c' line='12' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_append_realloc' hash='d4b488575d662d42'>
      <parameter type-id='26a90f95' name='buffer' filepath='string.c' line='12' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='12' column='1'/>
      <parameter type-id='b7f2d5e6' name='args' filepath='string.c' line='12' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_append_realloc' mangled-name='spdk_sprintf_append_realloc' filepath='string.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_append_realloc' hash='d2c49d83b30fb50c'>
      <parameter type-id='26a90f95' name='buffer' filepath='string.c' line='44' column='1'/>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='44' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_vsprintf_alloc' mangled-name='spdk_vsprintf_alloc' filepath='string.c' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vsprintf_alloc' hash='fa7faf7de4fe4d2c'>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='57' column='1'/>
      <parameter type-id='b7f2d5e6' name='args' filepath='string.c' line='57' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_sprintf_alloc' mangled-name='spdk_sprintf_alloc' filepath='string.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_sprintf_alloc' hash='bac6a89264ba699c'>
      <parameter type-id='80f4b756' name='format' filepath='string.c' line='63' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strlwr' mangled-name='spdk_strlwr' filepath='string.c' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlwr' hash='6faa8831d3af3ad4'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='159' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strsepq' mangled-name='spdk_strsepq' filepath='string.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strsepq' hash='52ce6f5878b4a009'>
      <parameter type-id='9b23c9ad' name='stringp' filepath='string.c' line='94' column='1'/>
      <parameter type-id='80f4b756' name='delim' filepath='string.c' line='94' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_str_trim' mangled-name='spdk_str_trim' filepath='string.c' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_trim' hash='6faa8831d3af3ad4'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='159' column='1'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_strcpy_pad' mangled-name='spdk_strcpy_pad' filepath='string.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strcpy_pad' hash='89e84780470728ca'>
      <parameter type-id='eaa32e2f' name='dst' filepath='string.c' line='193' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='string.c' line='193' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='193' column='1'/>
      <parameter type-id='95e97e5e' name='pad' filepath='string.c' line='193' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_strlen_pad' mangled-name='spdk_strlen_pad' filepath='string.c' line='207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strlen_pad' hash='d8f551d99ba6f26a'>
      <parameter type-id='eaa32e2f' name='str' filepath='string.c' line='207' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='207' column='1'/>
      <parameter type-id='95e97e5e' name='pad' filepath='string.c' line='207' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_parse_ip_addr' mangled-name='spdk_parse_ip_addr' filepath='string.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_ip_addr' hash='e48096fb63a214ad'>
      <parameter type-id='26a90f95' name='ip' filepath='string.c' line='235' column='1'/>
      <parameter type-id='9b23c9ad' name='host' filepath='string.c' line='235' column='1'/>
      <parameter type-id='9b23c9ad' name='port' filepath='string.c' line='235' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_str_chomp' mangled-name='spdk_str_chomp' filepath='string.c' line='291' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_str_chomp' hash='9cbf7f4218cdaf6b'>
      <parameter type-id='26a90f95' name='s' filepath='string.c' line='291' column='1'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_strerror_r' mangled-name='spdk_strerror_r' filepath='string.c' line='310' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strerror_r' hash='9c7e25a67d484c6e'>
      <parameter type-id='95e97e5e' name='errnum' filepath='string.c' line='310' column='1'/>
      <parameter type-id='26a90f95' name='buf' filepath='string.c' line='310' column='1'/>
      <parameter type-id='b59d7dce' name='buflen' filepath='string.c' line='310' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_parse_capacity' mangled-name='spdk_parse_capacity' filepath='string.c' line='335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_parse_capacity' hash='cfd6d114658eebbe'>
      <parameter type-id='80f4b756' name='cap_str' filepath='string.c' line='335' column='1'/>
      <parameter type-id='5d6479ae' name='cap' filepath='string.c' line='335' column='1'/>
      <parameter type-id='d8e6b335' name='has_prefix' filepath='string.c' line='335' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_mem_all_zero' mangled-name='spdk_mem_all_zero' filepath='string.c' line='381' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_mem_all_zero' hash='7e544b18f5e89a62'>
      <parameter type-id='eaa32e2f' name='data' filepath='string.c' line='381' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='381' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_strtol' mangled-name='spdk_strtol' filepath='string.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtol' hash='f2690588a26e973f'>
      <parameter type-id='80f4b756' name='nptr' filepath='string.c' line='395' column='1'/>
      <parameter type-id='95e97e5e' name='base' filepath='string.c' line='395' column='1'/>
      <return type-id='95e97e5f'/>
    </function-decl>
    <function-decl name='spdk_strtoll' mangled-name='spdk_strtoll' filepath='string.c' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strtoll' hash='cfdf68d9ce1a4bba#2'>
      <parameter type-id='80f4b756' name='nptr' filepath='string.c' line='426' column='1'/>
      <parameter type-id='95e97e5e' name='base' filepath='string.c' line='426' column='1'/>
      <return type-id='95e97e60'/>
    </function-decl>
    <function-decl name='spdk_strarray_free' mangled-name='spdk_strarray_free' filepath='string.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_free' hash='3327e540f712d574'>
      <parameter type-id='9b23c9ad' name='strarray' filepath='string.c' line='457' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_strarray_from_string' mangled-name='spdk_strarray_from_string' filepath='string.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_from_string' hash='800a579987e0f3d0'>
      <parameter type-id='80f4b756' name='str' filepath='string.c' line='472' column='1'/>
      <parameter type-id='80f4b756' name='delim' filepath='string.c' line='472' column='1'/>
      <return type-id='9b23c9ad'/>
    </function-decl>
    <function-decl name='spdk_strarray_dup' mangled-name='spdk_strarray_dup' filepath='string.c' line='526' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strarray_dup' hash='cd457682885ec2d0'>
      <parameter type-id='7d3cd834' name='strarray' filepath='string.c' line='526' column='1'/>
      <return type-id='9b23c9ad'/>
    </function-decl>
    <function-decl name='spdk_strcpy_replace' mangled-name='spdk_strcpy_replace' filepath='string.c' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_strcpy_replace' hash='1f95181cf78a558b'>
      <parameter type-id='26a90f95' name='dst' filepath='string.c' line='553' column='1'/>
      <parameter type-id='b59d7dce' name='size' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='src' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='search' filepath='string.c' line='553' column='1'/>
      <parameter type-id='80f4b756' name='replace' filepath='string.c' line='554' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='uuid.c' language='LANG_C11'>
    <class-decl name='spdk_uuid' is-struct='yes' visibility='default' size-in-bits='128' filepath='uuid.h' line='21' column='1' hash='ad18e2956698a415' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab596' visibility='default' filepath='uuid.h' line='24' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='fa9986a5'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='uuid.h' line='22' column='1' hash='83563518080289b9#2' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default' filepath='uuid.h' line='23' column='1'/>
      </data-member>
    </union-decl>
    <qualified-type-def type-id='429c70d3' const='yes' hash='7e397e1f3d0802a3' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' hash='8dd43daba5434137' id='c2482856'/>
    <pointer-type-def type-id='429c70d3' size-in-bits='64' hash='03153afb00ca8d25' id='69a99433'/>
    <function-decl name='spdk_uuid_parse' mangled-name='spdk_uuid_parse' filepath='uuid.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_parse' hash='e34941ea409fdf5a'>
      <parameter type-id='69a99433' name='uuid' filepath='uuid.c' line='21' column='1'/>
      <parameter type-id='80f4b756' name='uuid_str' filepath='uuid.c' line='21' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_fmt_lower' mangled-name='spdk_uuid_fmt_lower' filepath='uuid.c' line='27' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_fmt_lower' hash='0983272f86a51e58'>
      <parameter type-id='26a90f95' name='uuid_str' filepath='uuid.c' line='27' column='1'/>
      <parameter type-id='b59d7dce' name='uuid_str_size' filepath='uuid.c' line='27' column='1'/>
      <parameter type-id='c2482856' name='uuid' filepath='uuid.c' line='27' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_compare' mangled-name='spdk_uuid_compare' filepath='uuid.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_compare' hash='26df11fc3ccf3898'>
      <parameter type-id='c2482856' name='u1' filepath='uuid.c' line='38' column='1'/>
      <parameter type-id='c2482856' name='u2' filepath='uuid.c' line='38' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_uuid_generate' mangled-name='spdk_uuid_generate' filepath='uuid.c' line='44' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_generate' hash='ea42da5274ffffdd'>
      <parameter type-id='69a99433' name='uuid' filepath='uuid.c' line='62' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_uuid_copy' mangled-name='spdk_uuid_copy' filepath='uuid.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_copy' hash='9f3307fcd812f8ca'>
      <parameter type-id='69a99433' name='dst' filepath='uuid.c' line='50' column='1'/>
      <parameter type-id='c2482856' name='src' filepath='uuid.c' line='50' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_uuid_is_null' mangled-name='spdk_uuid_is_null' filepath='uuid.c' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_uuid_is_null' hash='7872729180f7a220'>
      <parameter type-id='c2482856' name='uuid' filepath='uuid.c' line='56' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
