<abi-corpus version='2.4' soname='libspdk_blob.so.13.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_thread.so.12.0'/>
    <dependency name='libspdk_dma.so.6.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_blob_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_clones' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_esnap_bs_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_esnap_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_next_allocated_io_unit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_blob_get_next_unallocated_io_unit' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_put_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_held' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_description_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_tpoint_register_relation' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u32log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_u64log2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_realloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_zmalloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='blobstore.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='128' hash='20e557d8b727a2ee' id='ac1fa8c0'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='64' hash='e1c8b625c73024c4' id='8e100159'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <enum-decl name='blob_clear_method' size-in-bits='32' alignment-in-bits='32' filepath='blob.h' line='48' column='1' hash='37e93404c044de31' id='6486fbcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BLOB_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='BLOB_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='BLOB_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='BLOB_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='bs_clear_method' size-in-bits='32' alignment-in-bits='32' filepath='blob.h' line='55' column='1' hash='50cd1756254463e8' id='10cabe8b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BS_CLEAR_WITH_UNMAP' value='0'/>
      <enumerator name='BS_CLEAR_WITH_WRITE_ZEROES' value='1'/>
      <enumerator name='BS_CLEAR_WITH_NONE' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='28577a57'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='ede1f91d' visibility='default' filepath='struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='8910171f' visibility='default' filepath='struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='8e100159' visibility='default' filepath='struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_ext_io_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='blob.h' line='171' column='1' hash='d17a330c630e0141' id='3a1587ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='blob.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='user_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='179' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_open_opts' is-struct='yes' visibility='default' size-in-bits='192' filepath='blob.h' line='870' column='1' hash='2a9ddd85e74551c8' id='27e387a7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='blob.h' line='871' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='879' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='esnap_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='885' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_opts' is-struct='yes' visibility='default' size-in-bits='640' filepath='blob.h' line='573' column='1' hash='aa3b32df66694558' id='212067a2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_clusters' type-id='9c313c2d' visibility='default' filepath='blob.h' line='574' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thin_provision' type-id='c894953d' visibility='default' filepath='blob.h' line='575' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default' filepath='blob.h' line='576' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='xattrs' type-id='eaa06656' visibility='default' filepath='blob.h' line='577' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='use_extent_table' type-id='c894953d' visibility='default' filepath='blob.h' line='580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='588' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='esnap_id' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='esnap_id_len' type-id='9c313c2d' visibility='default' filepath='blob.h' line='604' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_blob_xattr_opts' is-struct='yes' visibility='default' size-in-bits='256' filepath='blob.h' line='561' column='1' hash='8e128c1ae505d951' id='eaa06656'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='count' type-id='b59d7dce' visibility='default' filepath='blob.h' line='563' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='names' type-id='9b23c9ad' visibility='default' filepath='blob.h' line='565' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_value' type-id='be61c37a' visibility='default' filepath='blob.h' line='569' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' is-struct='yes' visibility='default' size-in-bits='1280' filepath='blob.h' line='183' column='1' hash='bc194d0c09e1edaf' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='ebc27c62' visibility='default' filepath='blob.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='0c87adc6' visibility='default' filepath='blob.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='7a375257' visibility='default' filepath='blob.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='ec0088fb' visibility='default' filepath='blob.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='ec0088fb' visibility='default' filepath='blob.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='9a3d0978' visibility='default' filepath='blob.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='9a3d0978' visibility='default' filepath='blob.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='readv_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='writev_ext' type-id='77117e5a' visibility='default' filepath='blob.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='flush' type-id='23168c30' visibility='default' filepath='blob.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='write_zeroes' type-id='311fca94' visibility='default' filepath='blob.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='unmap' type-id='311fca94' visibility='default' filepath='blob.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='get_base_bdev' type-id='4a9ec7e9' visibility='default' filepath='blob.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='is_zeroes' type-id='afcde08d' visibility='default' filepath='blob.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='is_range_valid' type-id='afcde08d' visibility='default' filepath='blob.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='translate_lba' type-id='05114f47' visibility='default' filepath='blob.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='copy' type-id='9a6dafa7' visibility='default' filepath='blob.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='is_degraded' type-id='088f71e9' visibility='default' filepath='blob.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default' filepath='blob.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default' filepath='blob.h' line='263' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev_cb_args' is-struct='yes' visibility='default' size-in-bits='192' filepath='blob.h' line='161' column='1' hash='66b11ce90ae11b3c' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default' filepath='blob.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default' filepath='blob.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='164' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_opts' is-struct='yes' visibility='default' size-in-bits='704' filepath='blob.h' line='270' column='1' hash='b3f2ce132a7ca7fa' id='d5816d4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default' filepath='blob.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='num_md_pages' type-id='8f92235e' visibility='default' filepath='blob.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='max_md_ops' type-id='8f92235e' visibility='default' filepath='blob.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='max_channel_ops' type-id='8f92235e' visibility='default' filepath='blob.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='clear_method' type-id='10cabe8b' visibility='default' filepath='blob.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='bstype' type-id='2b310a38' visibility='default' filepath='blob.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='md_page_size' type-id='8f92235e' visibility='default' filepath='blob.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iter_cb_fn' type-id='cb1c4f44' visibility='default' filepath='blob.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iter_cb_arg' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='blob.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='force_recover' type-id='9c313c2d' visibility='default' filepath='blob.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='esnap_bs_dev_create' type-id='63c64b6d' visibility='default' filepath='blob.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='esnap_ctx' type-id='eaa32e2f' visibility='default' filepath='blob.h' line='317' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_type' is-struct='yes' visibility='default' size-in-bits='128' filepath='blob.h' line='266' column='1' hash='3fe2f41b0753aadb' id='2b310a38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bstype' type-id='ac1fa8c0' visibility='default' filepath='blob.h' line='267' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' size-in-bits='1728' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='45' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='153' column='1' hash='b119fe0931d2ee10' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' size-in-bits='64' filepath='blob.h' line='43' column='1' hash='8fdc5eea2983a729' id='533eb244'/>
    <typedef-decl name='spdk_blob_op_complete' type-id='82328a76' size-in-bits='64' filepath='blob.h' line='91' column='1' hash='fd7a63c0c6c822c4' id='6531ee70'/>
    <typedef-decl name='spdk_blob_op_with_handle_complete' type-id='222ea1f0' size-in-bits='64' filepath='blob.h' line='109' column='1' hash='fd7a63c0c6c822c4' id='cb1c4f44'/>
    <typedef-decl name='spdk_blob_op_with_id_complete' type-id='6cca7f1e' size-in-bits='64' filepath='blob.h' line='100' column='1' hash='fd7a63c0c6c822c4' id='d1133f51'/>
    <typedef-decl name='spdk_blob_shallow_copy_status' type-id='f76b72b0' size-in-bits='64' filepath='blob.h' line='159' column='1' hash='fd7a63c0c6c822c4' id='8d6c4ea0'/>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='03ca1b4b' size-in-bits='64' filepath='blob.h' line='118' column='1' hash='fd7a63c0c6c822c4' id='7683f572'/>
    <typedef-decl name='spdk_bs_dump_print_xattr' type-id='b4e04a59' size-in-bits='64' filepath='blob.h' line='374' column='1' hash='fd7a63c0c6c822c4' id='7b4a763b'/>
    <typedef-decl name='spdk_bs_esnap_dev_create' type-id='3e82def8' size-in-bits='64' filepath='blob.h' line='149' column='1' hash='fd7a63c0c6c822c4' id='63c64b6d'/>
    <typedef-decl name='spdk_bs_op_complete' type-id='82328a76' size-in-bits='64' filepath='blob.h' line='73' column='1' hash='fd7a63c0c6c822c4' id='0955aa0c'/>
    <typedef-decl name='spdk_bs_op_with_handle_complete' type-id='deb6099a' size-in-bits='64' filepath='blob.h' line='82' column='1' hash='fd7a63c0c6c822c4' id='9214bc90'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='f0981eed'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' hash='4cdc26b379a5c62d' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' hash='071f36dcbe00ad00' id='dca988a5'/>
    <pointer-type-def type-id='dca988a5' size-in-bits='64' hash='e8c018048121152c' id='ede1f91d'/>
    <pointer-type-def type-id='a3780f1e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='088f71e9'/>
    <pointer-type-def type-id='793673b2' size-in-bits='64' hash='fd7a63c0c6c822c4' id='afcde08d'/>
    <pointer-type-def type-id='73b5cb02' size-in-bits='64' hash='fd7a63c0c6c822c4' id='05114f47'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' hash='e533f42d1dd4942c' id='26a90f95'/>
    <pointer-type-def type-id='26a90f95' size-in-bits='64' hash='a93039fe023ed77b' id='9b23c9ad'/>
    <qualified-type-def type-id='a84c031d' const='yes' hash='3e50fd33f9bb78d9' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' hash='c44743f354f6a443' id='80f4b756'/>
    <qualified-type-def type-id='212067a2' const='yes' hash='b619799f07492cab' id='de6127e7'/>
    <pointer-type-def type-id='de6127e7' size-in-bits='64' hash='28b9244c5edcc157' id='dff1a7b7'/>
    <qualified-type-def type-id='eaa06656' const='yes' hash='8c495c36efbef92e' id='f2acb557'/>
    <pointer-type-def type-id='f2acb557' size-in-bits='64' hash='3bfc86fbe3d1bafd' id='82e1b3c7'/>
    <pointer-type-def type-id='bb02f5b5' size-in-bits='64' hash='fd7a63c0c6c822c4' id='3e82def8'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' hash='83ff866b84e07157' id='cc4b1be9'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' hash='54c1e9f81ec7a1db' id='78c01427'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' hash='fd7a63c0c6c822c4' id='4a9ec7e9'/>
    <pointer-type-def type-id='3a1587ff' size-in-bits='64' hash='41afd7cacfa527b1' id='e79cd027'/>
    <pointer-type-def type-id='533eb244' size-in-bits='64' hash='58f50000891e7c3b' id='9d19ecd1'/>
    <pointer-type-def type-id='27e387a7' size-in-bits='64' hash='06abafd5d47bec80' id='5874496f'/>
    <pointer-type-def type-id='212067a2' size-in-bits='64' hash='d07e1465794e86f7' id='4556e950'/>
    <pointer-type-def type-id='c7372297' size-in-bits='64' hash='a41648db21b39856' id='44388ddf'/>
    <pointer-type-def type-id='44388ddf' size-in-bits='64' hash='3600ed88c067324b' id='5a0778af'/>
    <pointer-type-def type-id='c0d240d3' size-in-bits='64' hash='549de05cd96f1e43' id='d8768e33'/>
    <pointer-type-def type-id='d5816d4e' size-in-bits='64' hash='ad732a1586227149' id='1eb99384'/>
    <pointer-type-def type-id='5f1f8343' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ebc27c62'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' hash='a7b536d51360d693' id='5d6479ae'/>
    <pointer-type-def type-id='b4669f4e' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b4e04a59'/>
    <pointer-type-def type-id='faef6e24' size-in-bits='64' hash='fd7a63c0c6c822c4' id='7a375257'/>
    <pointer-type-def type-id='d8775801' size-in-bits='64' hash='fd7a63c0c6c822c4' id='0c87adc6'/>
    <pointer-type-def type-id='8c2aa1fd' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9a3d0978'/>
    <pointer-type-def type-id='08c6b893' size-in-bits='64' hash='fd7a63c0c6c822c4' id='77117e5a'/>
    <pointer-type-def type-id='aa39dfd7' size-in-bits='64' hash='fd7a63c0c6c822c4' id='23168c30'/>
    <pointer-type-def type-id='dcbdad5b' size-in-bits='64' hash='fd7a63c0c6c822c4' id='311fca94'/>
    <pointer-type-def type-id='6762781c' size-in-bits='64' hash='fd7a63c0c6c822c4' id='9a6dafa7'/>
    <pointer-type-def type-id='c2a8b732' size-in-bits='64' hash='fd7a63c0c6c822c4' id='ec0088fb'/>
    <pointer-type-def type-id='72d56e00' size-in-bits='64' hash='fd7a63c0c6c822c4' id='03ca1b4b'/>
    <pointer-type-def type-id='97b6f0fd' size-in-bits='64' hash='fd7a63c0c6c822c4' id='f76b72b0'/>
    <pointer-type-def type-id='71fd0c83' size-in-bits='64' hash='fd7a63c0c6c822c4' id='be61c37a'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' hash='fd7a63c0c6c822c4' id='82328a76'/>
    <pointer-type-def type-id='9065f8df' size-in-bits='64' hash='fd7a63c0c6c822c4' id='222ea1f0'/>
    <pointer-type-def type-id='ee8f2b21' size-in-bits='64' hash='fd7a63c0c6c822c4' id='6cca7f1e'/>
    <pointer-type-def type-id='92c60ced' size-in-bits='64' hash='fd7a63c0c6c822c4' id='deb6099a'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' hash='473a9667a2856e32' id='63e171df'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <qualified-type-def type-id='396cf9f3' const='yes' id='050b6e44'/>
    <pointer-type-def type-id='050b6e44' size-in-bits='64' id='5efed72a'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='396cf9f3' size-in-bits='64' id='89e1f283'/>
    <pointer-type-def type-id='90246e15' size-in-bits='64' id='07fd40b5'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='172b608c' size-in-bits='64' id='5684630a'/>
    <pointer-type-def type-id='5684630a' size-in-bits='64' id='52680b60'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <function-decl name='spdk_blob_opts_init' mangled-name='spdk_blob_opts_init' filepath='blobstore.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_opts_init' hash='bef9aebd88e7786e'>
      <parameter type-id='4556e950' name='opts' filepath='blobstore.c' line='232' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='blobstore.c' line='232' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_open_opts_init' mangled-name='spdk_blob_open_opts_init' filepath='blobstore.c' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_open_opts_init' hash='8cd55e04cc0f584f'>
      <parameter type-id='5874496f' name='opts' filepath='blobstore.c' line='270' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='blobstore.c' line='270' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_opts_init' mangled-name='spdk_bs_opts_init' filepath='blobstore.c' line='3826' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_opts_init' hash='f2ee66dbf581a770'>
      <parameter type-id='1eb99384' name='opts' filepath='blobstore.c' line='3826' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='blobstore.c' line='3826' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_load' mangled-name='spdk_bs_load' filepath='blobstore.c' line='5077' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_load' hash='ca8b9a3974d2bb2a'>
      <parameter type-id='44388ddf' name='dev' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='1eb99384' name='o' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='9214bc90' name='cb_fn' filepath='blobstore.c' line='10013' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='10013' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_dump' mangled-name='spdk_bs_dump' filepath='blobstore.c' line='5476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_dump' hash='a875a3d32e8b466e'>
      <parameter type-id='44388ddf' name='dev' filepath='blobstore.c' line='5476' column='1'/>
      <parameter type-id='822cd80b' name='fp' filepath='blobstore.c' line='5476' column='1'/>
      <parameter type-id='7b4a763b' name='print_xattr_fn' filepath='blobstore.c' line='5476' column='1'/>
      <parameter type-id='0955aa0c' name='cb_fn' filepath='blobstore.c' line='5477' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='5477' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_init' mangled-name='spdk_bs_init' filepath='blobstore.c' line='5547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_init' hash='ca8b9a3974d2bb2a'>
      <parameter type-id='44388ddf' name='dev' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='1eb99384' name='o' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='9214bc90' name='cb_fn' filepath='blobstore.c' line='10013' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='10013' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_destroy' mangled-name='spdk_bs_destroy' filepath='blobstore.c' line='5786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_destroy' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9968' column='1'/>
      <parameter type-id='0955aa0c' name='cb_fn' filepath='blobstore.c' line='9969' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9969' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_unload' mangled-name='spdk_bs_unload' filepath='blobstore.c' line='5940' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_unload' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9968' column='1'/>
      <parameter type-id='0955aa0c' name='cb_fn' filepath='blobstore.c' line='9969' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9969' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_set_super' mangled-name='spdk_bs_set_super' filepath='blobstore.c' line='6063' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_set_super' hash='9cff686ffc6325ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6063' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='6063' column='1'/>
      <parameter type-id='0955aa0c' name='cb_fn' filepath='blobstore.c' line='6064' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='6064' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_get_super' mangled-name='spdk_bs_get_super' filepath='blobstore.c' line='6111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_super' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6444' column='1'/>
      <parameter type-id='d1133f51' name='cb_fn' filepath='blobstore.c' line='6445' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='6445' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_get_cluster_size' mangled-name='spdk_bs_get_cluster_size' filepath='blobstore.c' line='6122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_cluster_size' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_get_page_size' mangled-name='spdk_bs_get_page_size' filepath='blobstore.c' line='6128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_page_size' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_get_max_growable_size' mangled-name='spdk_bs_get_max_growable_size' filepath='blobstore.c' line='6134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_max_growable_size' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_get_io_unit_size' mangled-name='spdk_bs_get_io_unit_size' filepath='blobstore.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_io_unit_size' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_free_cluster_count' mangled-name='spdk_bs_free_cluster_count' filepath='blobstore.c' line='6158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_free_cluster_count' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_total_data_cluster_count' mangled-name='spdk_bs_total_data_cluster_count' filepath='blobstore.c' line='6164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_total_data_cluster_count' hash='e0055d99adb0e173'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6164' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_id' mangled-name='spdk_blob_get_id' filepath='blobstore.c' line='6190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_id' hash='e0055d99adb0e173'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6190' column='1'/>
      <return type-id='533eb244'/>
    </function-decl>
    <function-decl name='spdk_blob_get_num_io_units' mangled-name='spdk_blob_get_num_io_units' filepath='blobstore.c' line='6198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_num_io_units' hash='e0055d99adb0e173'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6214' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_num_clusters' mangled-name='spdk_blob_get_num_clusters' filepath='blobstore.c' line='6206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_num_clusters' hash='e0055d99adb0e173'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6214' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_num_allocated_clusters' mangled-name='spdk_blob_get_num_allocated_clusters' filepath='blobstore.c' line='6214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_num_allocated_clusters' hash='e0055d99adb0e173'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6214' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_next_allocated_io_unit' mangled-name='spdk_blob_get_next_allocated_io_unit' filepath='blobstore.c' line='6238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_next_allocated_io_unit' hash='91495cdf6321a116'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6244' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='6244' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_next_unallocated_io_unit' mangled-name='spdk_blob_get_next_unallocated_io_unit' filepath='blobstore.c' line='6244' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_next_unallocated_io_unit' hash='91495cdf6321a116'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='6244' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='6244' column='1'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bs_create_blob' mangled-name='spdk_bs_create_blob' filepath='blobstore.c' line='6444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_create_blob' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6444' column='1'/>
      <parameter type-id='d1133f51' name='cb_fn' filepath='blobstore.c' line='6445' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='6445' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_create_blob_ext' mangled-name='spdk_bs_create_blob_ext' filepath='blobstore.c' line='6451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_create_blob_ext' hash='ccf6d5e241982696'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='6451' column='1'/>
      <parameter type-id='dff1a7b7' name='opts' filepath='blobstore.c' line='6451' column='1'/>
      <parameter type-id='d1133f51' name='cb_fn' filepath='blobstore.c' line='6452' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='6452' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_create_snapshot' mangled-name='spdk_bs_create_snapshot' filepath='blobstore.c' line='6903' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_create_snapshot' hash='f0f6c743f9d1abc0'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7013' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='7013' column='1'/>
      <parameter type-id='82e1b3c7' name='clone_xattrs' filepath='blobstore.c' line='7014' column='1'/>
      <parameter type-id='d1133f51' name='cb_fn' filepath='blobstore.c' line='7015' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7015' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_create_clone' mangled-name='spdk_bs_create_clone' filepath='blobstore.c' line='7013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_create_clone' hash='f0f6c743f9d1abc0'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7013' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='7013' column='1'/>
      <parameter type-id='82e1b3c7' name='clone_xattrs' filepath='blobstore.c' line='7014' column='1'/>
      <parameter type-id='d1133f51' name='cb_fn' filepath='blobstore.c' line='7015' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7015' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_inflate_blob' mangled-name='spdk_bs_inflate_blob' filepath='blobstore.c' line='7279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_inflate_blob' hash='9cff686ffc6325ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7286' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='7286' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='7287' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7287' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7287' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_blob_decouple_parent' mangled-name='spdk_bs_blob_decouple_parent' filepath='blobstore.c' line='7286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_blob_decouple_parent' hash='9cff686ffc6325ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7286' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='7286' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='7287' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7287' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7287' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_blob_shallow_copy' mangled-name='spdk_bs_blob_shallow_copy' filepath='blobstore.c' line='7477' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_blob_shallow_copy' hash='fe919ac308670a0b'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7477' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='7477' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='7478' column='1'/>
      <parameter type-id='44388ddf' name='ext_dev' filepath='blobstore.c' line='7478' column='1'/>
      <parameter type-id='8d6c4ea0' name='status_cb_fn' filepath='blobstore.c' line='7479' column='1'/>
      <parameter type-id='eaa32e2f' name='status_cb_arg' filepath='blobstore.c' line='7479' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7480' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7480' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bs_blob_set_parent' mangled-name='spdk_bs_blob_set_parent' filepath='blobstore.c' line='7711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_blob_set_parent' hash='3aa907ea60dd12ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7711' column='1'/>
      <parameter type-id='533eb244' name='blob_id' filepath='blobstore.c' line='7711' column='1'/>
      <parameter type-id='533eb244' name='snapshot_id' filepath='blobstore.c' line='7712' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7712' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7712' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_blob_set_external_parent' mangled-name='spdk_bs_blob_set_external_parent' filepath='blobstore.c' line='7884' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_blob_set_external_parent' hash='38ea5e72580d793e'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='7884' column='1'/>
      <parameter type-id='533eb244' name='blob_id' filepath='blobstore.c' line='7884' column='1'/>
      <parameter type-id='44388ddf' name='esnap_bs_dev' filepath='blobstore.c' line='7885' column='1'/>
      <parameter type-id='eaa32e2f' name='esnap_id' filepath='blobstore.c' line='7885' column='1'/>
      <parameter type-id='8f92235e' name='esnap_id_len' filepath='blobstore.c' line='7886' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7886' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7886' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_resize' mangled-name='spdk_blob_resize' filepath='blobstore.c' line='7978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_resize' hash='9cff686ffc6325ba'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='7978' column='1'/>
      <parameter type-id='9c313c2d' name='sz' filepath='blobstore.c' line='7978' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='7978' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='7978' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_delete_blob' mangled-name='spdk_bs_delete_blob' filepath='blobstore.c' line='8600' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_delete_blob' hash='9cff686ffc6325ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='8600' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='8600' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='8601' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='8601' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_open_blob' mangled-name='spdk_bs_open_blob' filepath='blobstore.c' line='8741' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_open_blob' hash='9cff686ffc6325ba'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='8741' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='8741' column='1'/>
      <parameter type-id='cb1c4f44' name='cb_fn' filepath='blobstore.c' line='8742' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='8742' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_open_blob_ext' mangled-name='spdk_bs_open_blob_ext' filepath='blobstore.c' line='8748' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_open_blob_ext' hash='e409d341544f8b21'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='8748' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='8748' column='1'/>
      <parameter type-id='5874496f' name='opts' filepath='blobstore.c' line='8749' column='1'/>
      <parameter type-id='cb1c4f44' name='cb_fn' filepath='blobstore.c' line='8749' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='8749' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_set_read_only' mangled-name='spdk_blob_set_read_only' filepath='blobstore.c' line='8758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_set_read_only' hash='388da3fa973fde78'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='8758' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_blob_sync_md' mangled-name='spdk_blob_sync_md' filepath='blobstore.c' line='8804' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_sync_md' hash='5695f5ce05a4c55f'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9142' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9142' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9142' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_close' mangled-name='spdk_blob_close' filepath='blobstore.c' line='9142' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_close' hash='5695f5ce05a4c55f'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9142' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9142' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9142' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_alloc_io_channel' mangled-name='spdk_bs_alloc_io_channel' filepath='blobstore.c' line='9177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_alloc_io_channel' hash='7f32ffea222edbe7'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9177' column='1'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bs_free_io_channel' mangled-name='spdk_bs_free_io_channel' filepath='blobstore.c' line='9183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_free_io_channel' hash='7f32ffea222edbe7'>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9183' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_unmap' mangled-name='spdk_blob_io_unmap' filepath='blobstore.c' line='9190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_unmap' hash='3aa907ea60dd12ba'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9198' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9198' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9199' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_write_zeroes' mangled-name='spdk_blob_io_write_zeroes' filepath='blobstore.c' line='9198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_write_zeroes' hash='3aa907ea60dd12ba'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9198' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9198' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9199' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9199' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_write' mangled-name='spdk_blob_io_write' filepath='blobstore.c' line='9206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_write' hash='3aa907ea60dd12ba'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9215' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9215' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9217' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9217' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_read' mangled-name='spdk_blob_io_read' filepath='blobstore.c' line='9215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_read' hash='3aa907ea60dd12ba'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9215' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9215' column='1'/>
      <parameter type-id='eaa32e2f' name='payload' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9216' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9217' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9217' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_writev' mangled-name='spdk_blob_io_writev' filepath='blobstore.c' line='9224' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_writev' hash='37abcf86bd955c52'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9232' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9232' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9234' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9234' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_readv' mangled-name='spdk_blob_io_readv' filepath='blobstore.c' line='9232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_readv' hash='37abcf86bd955c52'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9232' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9232' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9233' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9234' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9234' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_writev_ext' mangled-name='spdk_blob_io_writev_ext' filepath='blobstore.c' line='9240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_writev_ext' hash='50769a5c5a32cde4'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9249' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9249' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9251' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9251' column='1'/>
      <parameter type-id='e79cd027' name='io_opts' filepath='blobstore.c' line='9251' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_io_readv_ext' mangled-name='spdk_blob_io_readv_ext' filepath='blobstore.c' line='9249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_io_readv_ext' hash='50769a5c5a32cde4'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9249' column='1'/>
      <parameter type-id='a7e01876' name='channel' filepath='blobstore.c' line='9249' column='1'/>
      <parameter type-id='cc4b1be9' name='iov' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='95e97e5e' name='iovcnt' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='9c313c2d' name='offset' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='9c313c2d' name='length' filepath='blobstore.c' line='9250' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='9251' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9251' column='1'/>
      <parameter type-id='e79cd027' name='io_opts' filepath='blobstore.c' line='9251' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_iter_first' mangled-name='spdk_bs_iter_first' filepath='blobstore.c' line='9292' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_iter_first' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9292' column='1'/>
      <parameter type-id='cb1c4f44' name='cb_fn' filepath='blobstore.c' line='9293' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9293' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_iter_next' mangled-name='spdk_bs_iter_next' filepath='blobstore.c' line='9320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_iter_next' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9320' column='1'/>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9320' column='1'/>
      <parameter type-id='cb1c4f44' name='cb_fn' filepath='blobstore.c' line='9321' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9321' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_set_xattr' mangled-name='spdk_blob_set_xattr' filepath='blobstore.c' line='9416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_set_xattr' hash='229e74d64cef3b72'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9416' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='blobstore.c' line='9416' column='1'/>
      <parameter type-id='eaa32e2f' name='value' filepath='blobstore.c' line='9416' column='1'/>
      <parameter type-id='149c6638' name='value_len' filepath='blobstore.c' line='9417' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_blob_remove_xattr' mangled-name='spdk_blob_remove_xattr' filepath='blobstore.c' line='9455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_remove_xattr' hash='e9ea91a7eab8302c'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9455' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='blobstore.c' line='9455' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_blob_get_xattr_value' mangled-name='spdk_blob_get_xattr_value' filepath='blobstore.c' line='9480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_xattr_value' hash='bdce3bea058723f1'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9480' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='blobstore.c' line='9480' column='1'/>
      <parameter type-id='63e171df' name='value' filepath='blobstore.c' line='9481' column='1'/>
      <parameter type-id='78c01427' name='value_len' filepath='blobstore.c' line='9481' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <class-decl name='spdk_xattr_names' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='blobstore.c' line='9488' column='1' id='172b608c'/>
    <function-decl name='spdk_blob_get_xattr_names' mangled-name='spdk_blob_get_xattr_names' filepath='blobstore.c' line='9516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_xattr_names' hash='388da3fa973fde78'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9516' column='1'/>
      <parameter type-id='52680b60' name='names' filepath='blobstore.c' line='9516' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_xattr_names_get_count' mangled-name='spdk_xattr_names_get_count' filepath='blobstore.c' line='9524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_xattr_names_get_count' hash='2bb88322482ae81c'>
      <parameter type-id='5684630a' name='names' filepath='blobstore.c' line='9524' column='1'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_xattr_names_get_name' mangled-name='spdk_xattr_names_get_name' filepath='blobstore.c' line='9532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_xattr_names_get_name' hash='cf5212e813271279'>
      <parameter type-id='5684630a' name='names' filepath='blobstore.c' line='9532' column='1'/>
      <parameter type-id='8f92235e' name='index' filepath='blobstore.c' line='9532' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_xattr_names_free' mangled-name='spdk_xattr_names_free' filepath='blobstore.c' line='9542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_xattr_names_free' hash='7f32ffea222edbe7'>
      <parameter type-id='5684630a' name='names' filepath='blobstore.c' line='9542' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_get_bstype' mangled-name='spdk_bs_get_bstype' filepath='blobstore.c' line='9548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_get_bstype' hash='7f32ffea222edbe7'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9548' column='1'/>
      <return type-id='2b310a38'/>
    </function-decl>
    <function-decl name='spdk_bs_set_bstype' mangled-name='spdk_bs_set_bstype' filepath='blobstore.c' line='9554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_set_bstype' hash='7f32ffea222edbe7'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9554' column='1'/>
      <parameter type-id='2b310a38' name='bstype' filepath='blobstore.c' line='9554' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_is_read_only' mangled-name='spdk_blob_is_read_only' filepath='blobstore.c' line='9560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_read_only' hash='c7c710e908194b91'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9596' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_blob_is_snapshot' mangled-name='spdk_blob_is_snapshot' filepath='blobstore.c' line='9567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_snapshot' hash='c7c710e908194b91'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9596' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_blob_is_clone' mangled-name='spdk_blob_is_clone' filepath='blobstore.c' line='9582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_clone' hash='c7c710e908194b91'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9596' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_blob_is_thin_provisioned' mangled-name='spdk_blob_is_thin_provisioned' filepath='blobstore.c' line='9596' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_thin_provisioned' hash='c7c710e908194b91'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='9596' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_blob_is_esnap_clone' mangled-name='spdk_blob_is_esnap_clone' filepath='blobstore.c' line='9603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_esnap_clone' hash='c7c710e908194b91'>
      <parameter type-id='5efed72a' name='blob' filepath='blobstore.c' line='10362' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_blob_get_parent_snapshot' mangled-name='spdk_blob_get_parent_snapshot' filepath='blobstore.c' line='9630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_parent_snapshot' hash='91495cdf6321a116'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9630' column='1'/>
      <parameter type-id='533eb244' name='blob_id' filepath='blobstore.c' line='9630' column='1'/>
      <return type-id='533eb244'/>
    </function-decl>
    <function-decl name='spdk_blob_get_clones' mangled-name='spdk_blob_get_clones' filepath='blobstore.c' line='9647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_clones' hash='486297955956c408'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9647' column='1'/>
      <parameter type-id='533eb244' name='blobid' filepath='blobstore.c' line='9647' column='1'/>
      <parameter type-id='9d19ecd1' name='ids' filepath='blobstore.c' line='9647' column='1'/>
      <parameter type-id='78c01427' name='count' filepath='blobstore.c' line='9648' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bs_grow_live' mangled-name='spdk_bs_grow_live' filepath='blobstore.c' line='9968' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_grow_live' hash='5695f5ce05a4c55f'>
      <parameter type-id='07fd40b5' name='bs' filepath='blobstore.c' line='9968' column='1'/>
      <parameter type-id='0955aa0c' name='cb_fn' filepath='blobstore.c' line='9969' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='9969' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bs_grow' mangled-name='spdk_bs_grow' filepath='blobstore.c' line='10012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bs_grow' hash='ca8b9a3974d2bb2a'>
      <parameter type-id='44388ddf' name='dev' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='1eb99384' name='o' filepath='blobstore.c' line='10012' column='1'/>
      <parameter type-id='9214bc90' name='cb_fn' filepath='blobstore.c' line='10013' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='10013' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_get_esnap_id' mangled-name='spdk_blob_get_esnap_id' filepath='blobstore.c' line='10073' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_esnap_id' hash='c7e20f5356529bd0'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='10073' column='1'/>
      <parameter type-id='63e171df' name='id' filepath='blobstore.c' line='10073' column='1'/>
      <parameter type-id='78c01427' name='len' filepath='blobstore.c' line='10073' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_blob_set_esnap_bs_dev' mangled-name='spdk_blob_set_esnap_bs_dev' filepath='blobstore.c' line='10338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_set_esnap_bs_dev' hash='7d3b69e7d344b07a'>
      <parameter type-id='89e1f283' name='blob' filepath='blobstore.c' line='10338' column='1'/>
      <parameter type-id='44388ddf' name='back_bs_dev' filepath='blobstore.c' line='10338' column='1'/>
      <parameter type-id='6531ee70' name='cb_fn' filepath='blobstore.c' line='10339' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='blobstore.c' line='10339' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_blob_get_esnap_bs_dev' mangled-name='spdk_blob_get_esnap_bs_dev' filepath='blobstore.c' line='10351' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_get_esnap_bs_dev' hash='93dcc48f1aca95e3'>
      <parameter type-id='5efed72a' name='blob' filepath='blobstore.c' line='10351' column='1'/>
      <return type-id='44388ddf'/>
    </function-decl>
    <function-decl name='spdk_blob_is_degraded' mangled-name='spdk_blob_is_degraded' filepath='blobstore.c' line='10362' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_blob_is_degraded' hash='c7c710e908194b91'>
      <parameter type-id='5efed72a' name='blob' filepath='blobstore.c' line='10362' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <class-decl name='spdk_blob' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='blobstore.h' line='104' column='1' id='396cf9f3'/>
    <class-decl name='spdk_blob_store' is-struct='yes' visibility='default' is-declaration-only='yes' filepath='blobstore.h' line='156' column='1' id='90246e15'/>
    <var-decl name='stderr' type-id='822cd80b' visibility='default' filepath='stdio.h' line='151' column='1' elf-symbol-id='stderr'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' hash='58b6af30dc601131' id='a3780f1e'>
      <parameter type-id='44388ddf'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' hash='93eb703529f252b7' id='793673b2'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' hash='21fffaa5d5fa565a' id='73b5cb02'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='5d6479ae'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' hash='47fa2d628286d587' id='bb02f5b5'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='89e1f283'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='5a0778af'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='93dcc48f1aca95e3' id='7f5edace'>
      <parameter type-id='44388ddf'/>
      <return type-id='7b7cfb3d'/>
    </function-type>
    <function-type size-in-bits='64' hash='93dcc48f1aca95e3' id='5f1f8343'>
      <parameter type-id='44388ddf'/>
      <return type-id='a7e01876'/>
    </function-type>
    <function-type size-in-bits='64' hash='87dab1a9a707223b' id='b4669f4e'>
      <parameter type-id='822cd80b'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b59d7dce'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='93dcc48f1aca95e3' id='faef6e24'>
      <parameter type-id='44388ddf'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='93dcc48f1aca95e3' id='d8775801'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='c511d39e7ac45618' id='8c2aa1fd'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='57011e8129316a62' id='08c6b893'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <parameter type-id='e79cd027'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='a91d63c233f35527' id='aa39dfd7'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='98390c496f624d07' id='dcbdad5b'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='5053e38854319af2' id='6762781c'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='725d07738df7ee03' id='c2a8b732'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='72d56e00'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='97b6f0fd'>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='2c0ae02117fe6be5' id='71fd0c83'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='80f4b756'/>
      <parameter type-id='63e171df'/>
      <parameter type-id='78c01427'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='9065f8df'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='89e1f283'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='2dc81cf21cc431f4' id='ee8f2b21'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='533eb244'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='92c60ced'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='07fd40b5'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='request.c' language='LANG_C11'>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f72' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='65536' hash='837662ad0a66648a' id='4dee7a71'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='1280' hash='2c6ebbabf2c1ee95' id='38ce06c2'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='fdca39cf'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='unknown' hash='953f9801eb087566' id='048fe7bc'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='031f2035'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='002ac4a6'/>
    <pointer-type-def type-id='a6dc9de4' size-in-bits='64' hash='f13879d37c217898' id='ddda0722'/>
    <var-decl name='g_trace_file' type-id='ddda0722' visibility='default' filepath='trace.h' line='149' column='1' elf-symbol-id='g_trace_file'/>
  </abi-instr>
</abi-corpus>
