<abi-corpus version='2.4' soname='libspdk_fsdev.so.3.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_thread.so.12.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libspdk_jsonrpc.so.7.0'/>
    <dependency name='libspdk_rpc.so.8.0'/>
    <dependency name='libspdk_notify.so.7.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_fsdev_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_copy_file_range' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_desc_get_fsdev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_destruct_done' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_fsdev_fallocate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_notify_send' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_notify_type_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_put_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_register_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_spin_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_sprintf_alloc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_get_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_put' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='fsdev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <enum-decl name='spdk_fsdev_event_type' size-in-bits='32' alignment-in-bits='32' filepath='fsdev.h' line='29' column='1' hash='8030ad2c8c8ea953' id='2766c765'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_EVENT_REMOVE' value='0'/>
    </enum-decl>
    <enum-decl name='spdk_fsdev_io_type' size-in-bits='32' alignment-in-bits='32' filepath='fsdev_module.h' line='177' column='1' hash='84e3f65dd3c3dc49' id='12c1ab69'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_IO_MOUNT' value='0'/>
      <enumerator name='SPDK_FSDEV_IO_UMOUNT' value='1'/>
      <enumerator name='SPDK_FSDEV_IO_LOOKUP' value='2'/>
      <enumerator name='SPDK_FSDEV_IO_FORGET' value='3'/>
      <enumerator name='SPDK_FSDEV_IO_GETATTR' value='4'/>
      <enumerator name='SPDK_FSDEV_IO_SETATTR' value='5'/>
      <enumerator name='SPDK_FSDEV_IO_READLINK' value='6'/>
      <enumerator name='SPDK_FSDEV_IO_SYMLINK' value='7'/>
      <enumerator name='SPDK_FSDEV_IO_MKNOD' value='8'/>
      <enumerator name='SPDK_FSDEV_IO_MKDIR' value='9'/>
      <enumerator name='SPDK_FSDEV_IO_UNLINK' value='10'/>
      <enumerator name='SPDK_FSDEV_IO_RMDIR' value='11'/>
      <enumerator name='SPDK_FSDEV_IO_RENAME' value='12'/>
      <enumerator name='SPDK_FSDEV_IO_LINK' value='13'/>
      <enumerator name='SPDK_FSDEV_IO_OPEN' value='14'/>
      <enumerator name='SPDK_FSDEV_IO_READ' value='15'/>
      <enumerator name='SPDK_FSDEV_IO_WRITE' value='16'/>
      <enumerator name='SPDK_FSDEV_IO_STATFS' value='17'/>
      <enumerator name='SPDK_FSDEV_IO_RELEASE' value='18'/>
      <enumerator name='SPDK_FSDEV_IO_FSYNC' value='19'/>
      <enumerator name='SPDK_FSDEV_IO_SETXATTR' value='20'/>
      <enumerator name='SPDK_FSDEV_IO_GETXATTR' value='21'/>
      <enumerator name='SPDK_FSDEV_IO_LISTXATTR' value='22'/>
      <enumerator name='SPDK_FSDEV_IO_REMOVEXATTR' value='23'/>
      <enumerator name='SPDK_FSDEV_IO_FLUSH' value='24'/>
      <enumerator name='SPDK_FSDEV_IO_OPENDIR' value='25'/>
      <enumerator name='SPDK_FSDEV_IO_READDIR' value='26'/>
      <enumerator name='SPDK_FSDEV_IO_RELEASEDIR' value='27'/>
      <enumerator name='SPDK_FSDEV_IO_FSYNCDIR' value='28'/>
      <enumerator name='SPDK_FSDEV_IO_FLOCK' value='29'/>
      <enumerator name='SPDK_FSDEV_IO_CREATE' value='30'/>
      <enumerator name='SPDK_FSDEV_IO_ABORT' value='31'/>
      <enumerator name='SPDK_FSDEV_IO_FALLOCATE' value='32'/>
      <enumerator name='SPDK_FSDEV_IO_COPY_FILE_RANGE' value='33'/>
      <enumerator name='__SPDK_FSDEV_IO_LAST' value='34'/>
    </enum-decl>
    <enum-decl name='spdk_fsdev_status' size-in-bits='32' alignment-in-bits='32' filepath='fsdev.h' line='48' column='1' hash='38693222b554693a' id='476c061a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_FSDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_FSDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_FSDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_FSDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <class-decl name='__fsdev_internal_fields' is-struct='yes' visibility='default' size-in-bits='1024' filepath='fsdev_module.h' line='154' column='1' hash='0a375e0ea783902d' id='d5f22443'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='d02a8f9f' visibility='default' filepath='fsdev_module.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='status' type-id='476c061a' visibility='default' filepath='fsdev_module.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unregister_cb' type-id='7bff2ab2' visibility='default' filepath='fsdev_module.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='open_descs' type-id='e7f43f72' visibility='default' filepath='fsdev_module.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='fsdev_module.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fsdev_name' type-id='60db09f4' visibility='default' filepath='fsdev_module.h' line='173' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__fsdev_io_internal_fields' is-struct='yes' visibility='default' size-in-bits='896' filepath='fsdev_module.h' line='486' column='1' hash='7e4fa194f209673a' id='2eacca64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='7f460d6c' visibility='default' filepath='fsdev_module.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='f0f65670' visibility='default' filepath='fsdev_module.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_fn' type-id='e975e7e9' visibility='default' filepath='fsdev_module.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='in_submit_request' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='505' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='type' type-id='12c1ab69' visibility='default' filepath='fsdev_module.h' line='508' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='unique' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='511' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='usr_cb_fn' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='514' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='usr_cb_arg' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='517' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='status' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='520' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='fsdev_module.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='buf_link' type-id='e7f43f75' visibility='default' filepath='fsdev_module.h' line='526' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='ch_link' type-id='e7f43f74' visibility='default' filepath='fsdev_module.h' line='529' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__fsdev_module_internal_fields' is-struct='yes' visibility='default' size-in-bits='128' filepath='fsdev_module.h' line='73' column='1' hash='607509161f1430fd' id='8ad91680'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f76' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev' is-struct='yes' visibility='default' size-in-bits='1280' filepath='fsdev_module.h' line='136' column='1' hash='cf328bd75ea5e503' id='08bb5c12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='module' type-id='aad364e3' visibility='default' filepath='fsdev_module.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fn_table' type-id='e6cae10f' visibility='default' filepath='fsdev_module.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='internal' type-id='d5f22443' visibility='default' filepath='fsdev_module.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_file_attr' is-struct='yes' visibility='default' size-in-bits='704' filepath='fsdev.h' line='278' column='1' hash='64f61c34c8441147' id='b3665c31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ino' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='280' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='atime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mtime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ctime' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='atimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='mtimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ctimensec' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='mode' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nlink' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='uid' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='gid' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='rdev' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='blksize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='valid_ms' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='294' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_file_statfs' is-struct='yes' visibility='default' size-in-bits='448' filepath='fsdev.h' line='297' column='1' hash='ede24a0ee80eee8d' id='e618950b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='blocks' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bfree' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bavail' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='files' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ffree' type-id='9c313c2d' visibility='default' filepath='fsdev.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bsize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='namelen' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='frsize' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='305' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_fn_table' is-struct='yes' visibility='default' size-in-bits='320' filepath='fsdev_module.h' line='86' column='1' hash='a86b3c917ea417b3' id='e473dbdc'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='c04372aa' visibility='default' filepath='fsdev_module.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='e20349de' visibility='default' filepath='fsdev_module.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_io_channel' type-id='0bad6792' visibility='default' filepath='fsdev_module.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_config_json' type-id='9c3e4c91' visibility='default' filepath='fsdev_module.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_memory_domains' type-id='d3d1557a' visibility='default' filepath='fsdev_module.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_io' is-struct='yes' visibility='default' size-in-bits='2944' filepath='fsdev_module.h' line='215' column='1' hash='85301425709b6d33' id='88fbe88f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fsdev' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='fsdev_module.h' line='220' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='fsdev_module.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='u_in' type-id='ac5ab595' visibility='default' filepath='fsdev_module.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='u_out' type-id='ac5ab596' visibility='default' filepath='fsdev_module.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='internal' type-id='2eacca64' visibility='default' filepath='fsdev_module.h' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default' filepath='fsdev_module.h' line='535' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_io_opts' is-struct='yes' visibility='default' size-in-bits='192' filepath='fsdev.h' line='108' column='1' hash='02c75aaa1f4d8260' id='22c5338e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default' filepath='fsdev.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default' filepath='fsdev.h' line='118' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_module' is-struct='yes' visibility='default' size-in-bits='448' filepath='fsdev_module.h' line='27' column='1' hash='ecaf2fc436e758aa' id='3ac83ed3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='65e3965a' visibility='default' filepath='fsdev_module.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module_fini' type-id='c640490b' visibility='default' filepath='fsdev_module.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='config_json' type-id='494cdc6d' visibility='default' filepath='fsdev_module.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='fsdev_module.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_ctx_size' type-id='65e3965a' visibility='default' filepath='fsdev_module.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='internal' type-id='8ad91680' visibility='default' filepath='fsdev_module.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_mount_opts' is-struct='yes' visibility='default' size-in-bits='72' filepath='fsdev.h' line='76' column='1' hash='88c383a6fed66165' id='3d012a23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='max_write' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='writeback_cache_enabled' type-id='b96825af' visibility='default' filepath='fsdev.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_name' is-struct='yes' visibility='default' size-in-bits='320' filepath='fsdev_module.h' line='120' column='1' hash='34c44ba8623aea58' id='60db09f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fsdev' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f77' visibility='default' filepath='fsdev_module.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_fsdev_opts' is-struct='yes' visibility='default' size-in-bits='96' filepath='fsdev.h' line='56' column='1' hash='7cbaca78b4e34521' id='c6726725'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fsdev_io_pool_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fsdev_io_cache_size' type-id='8f92235e' visibility='default' filepath='fsdev.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' is-struct='yes' visibility='default' size-in-bits='256' filepath='thread.h' line='1044' column='1' hash='f3654a830a369375' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='1049' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__38' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='425' column='1' hash='d21a95cb58c7d517' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='linkname' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='426' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' is-struct='yes' visibility='default' size-in-bits='896' is-anonymous='yes' filepath='fsdev_module.h' line='466' column='1' hash='9c065c73d5c49893#2' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='fsdev_module.h' line='467' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='468' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='offset' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='470' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__48' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='459' column='1' hash='7ee8c329a3eee467#3' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='460' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size_only' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='461' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='477' column='1' hash='575b61355262cab1#4' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='478' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__47' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='456' column='1' hash='87c8cd66d57f1245#5' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value_size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='457' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='170' column='1' hash='1e97cd0e71c9b3a0#6' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='e93d8a00' visibility='default' filepath='fsdev_module.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='55e0801e' visibility='default' filepath='fsdev_module.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__56' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='168' column='1' hash='88a04d14b93cac82#7' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f0f65670' visibility='default' filepath='fsdev_module.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='adc9efae' visibility='default' filepath='fsdev_module.h' line='168' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__36' is-struct='yes' visibility='default' size-in-bits='704' is-anonymous='yes' filepath='fsdev_module.h' line='419' column='1' hash='a6c8a12d813b012b#8' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__43' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='444' column='1' hash='d0d6943c1e5c32cf#9' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='445' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='341' column='1' hash='0bd8e89bb62ee325#10' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='buffer' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='343' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='344' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='328' column='1' hash='3535d2f96cf925ae#11' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='333' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='fsdev_module.h' line='335' column='1' hash='8745c467b961d17b#12' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buffer' type-id='eaa32e2f' visibility='default' filepath='fsdev_module.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='339' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='346' column='1' hash='897513bc8503a2cc#13' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='348' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__35' is-struct='yes' visibility='default' size-in-bits='768' is-anonymous='yes' filepath='fsdev_module.h' line='415' column='1' hash='46ba558985d03283#14' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='417' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='323' column='1' hash='9e46a4da0e7cfaa5#15' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='datasync' type-id='c894953d' visibility='default' filepath='fsdev_module.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='391' column='1' hash='02d7cee82ae07440#16' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='393' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='394' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='length' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='396' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='374' column='1' hash='7c386c33c3cf0ac9#17' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='operation' type-id='95e97e5e' visibility='default' filepath='fsdev_module.h' line='377' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='fsdev_module.h' line='296' column='1' hash='6b448ae38b77fc1d#18' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offs' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default' filepath='fsdev_module.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts' type-id='d69566d4' visibility='default' filepath='fsdev_module.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='fsdev_module.h' line='306' column='1' hash='1a19f41f2dc546ab#19' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offs' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='iov' type-id='2c556848' visibility='default' filepath='fsdev_module.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='313' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='opts' type-id='d69566d4' visibility='default' filepath='fsdev_module.h' line='314' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='896' is-anonymous='yes' filepath='fsdev_module.h' line='241' column='1' hash='969d94de84d58e66#20' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='to_set' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='245' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' is-struct='yes' visibility='default' size-in-bits='832' is-anonymous='yes' filepath='fsdev_module.h' line='472' column='1' hash='78c76d858d0b9cff#21' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='attr' type-id='b3665c31' visibility='default' filepath='fsdev_module.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='358' column='1' hash='01b1dc458805567a#22' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='360' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='361' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='entry_cb_fn' type-id='f2f8cb0c' visibility='default' filepath='fsdev_module.h' line='362' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='usr_entry_cb_fn' type-id='18bd2393' visibility='default' filepath='fsdev_module.h' line='363' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='237' column='1' hash='adf5e742aaa3c246#23' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='239' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='287' column='1' hash='905069e088daa11a#24' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='new_parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='290' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='292' column='1' hash='3583d9a5b230d839#25' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='294' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='233' column='1' hash='98ee89272853ef3d#26' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nlookup' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='235' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='247' column='1' hash='d424fd21bbc46ba8#27' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='248' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__33' is-struct='yes' visibility='default' size-in-bits='512' is-anonymous='yes' filepath='fsdev_module.h' line='398' column='1' hash='e707d6d8e5005f1a#28' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fobject_in' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='fhandle_in' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='400' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='off_in' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='401' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fobject_out' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fhandle_out' type-id='b008536a' visibility='default' filepath='fsdev_module.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='off_out' type-id='ad707ada' visibility='default' filepath='fsdev_module.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='fsdev_module.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='406' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='257' column='1' hash='01b866ca1a9b0f97#29' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='rdev' type-id='8504f260' visibility='default' filepath='fsdev_module.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='263' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='fsdev_module.h' line='265' column='1' hash='75dacd39086e9be0#30' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='379' column='1' hash='76b9d4e15bb58cda#31' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='380' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mode' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='382' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='383' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='umask' type-id='d50d396c' visibility='default' filepath='fsdev_module.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='386' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' is-struct='yes' visibility='default' size-in-bits='320' is-anonymous='yes' filepath='fsdev_module.h' line='280' column='1' hash='a40e0f980bb8e925#32' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='new_parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='new_name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='flags' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='285' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='229' column='1' hash='5b759befb2af85ca#33' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='231' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='256' is-anonymous='yes' filepath='fsdev_module.h' line='250' column='1' hash='01163366e7e6dee1#34' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='target' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='linkpath' type-id='26a90f95' visibility='default' filepath='fsdev_module.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='euid' type-id='354978ed' visibility='default' filepath='fsdev_module.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='egid' type-id='2bb2b96f' visibility='default' filepath='fsdev_module.h' line='255' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__46' is-struct='yes' visibility='default' size-in-bits='448' is-anonymous='yes' filepath='fsdev_module.h' line='453' column='1' hash='86060ec7b0c66183#35' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='statfs' type-id='e618950b' visibility='default' filepath='fsdev_module.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='526' column='1' hash='9df4de927d6620ba#36' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='ebe2c337' visibility='default' filepath='fsdev_module.h' line='526' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='523' column='1' hash='5ad899fad66ed6af#37' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ebe2c337' visibility='default' filepath='fsdev_module.h' line='523' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='72f926a7' visibility='default' filepath='fsdev_module.h' line='523' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='fsdev_module.h' line='74' column='1' hash='f98b9a69e378efc5#38' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='aad364e3' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='b3c7a86b' visibility='default' filepath='fsdev_module.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__34' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='411' column='1' hash='bc18eea61f0d993a#39' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='3d012a23' visibility='default' filepath='fsdev_module.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='root_fobject' type-id='6e396921' visibility='default' filepath='fsdev_module.h' line='413' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='72' is-anonymous='yes' filepath='fsdev_module.h' line='226' column='1' hash='53f7b12620f13509#40' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts' type-id='3d012a23' visibility='default' filepath='fsdev_module.h' line='227' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='fsdev_module.h' line='123' column='1' hash='48585c50383a255a#41' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='598f2d72' visibility='default' filepath='fsdev_module.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__44' is-struct='yes' visibility='default' size-in-bits='32' is-anonymous='yes' filepath='fsdev_module.h' line='447' column='1' hash='f53a816ba377db45#42' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data_size' type-id='8f92235e' visibility='default' filepath='fsdev_module.h' line='448' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='fsdev_module.h' line='388' column='1' hash='b4bb4575515a8761#43' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unique_to_abort' type-id='9c313c2d' visibility='default' filepath='fsdev_module.h' line='389' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__dev_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='145' column='1' hash='8fdc5eea2983a729' id='35ed8932'/>
    <typedef-decl name='__gid_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='147' column='1' hash='e66b43f97c38e87a' id='d94ec6d9'/>
    <typedef-decl name='__mode_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='150' column='1' hash='e66b43f97c38e87a' id='e1c52942'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='152' column='1' hash='b119fe0931d2ee10' id='79989e9c'/>
    <typedef-decl name='__uid_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='146' column='1' hash='e66b43f97c38e87a' id='cc5fcceb'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='dev_t' type-id='35ed8932' size-in-bits='64' filepath='types.h' line='59' column='1' hash='8fdc5eea2983a729' id='8504f260'/>
    <typedef-decl name='gid_t' type-id='d94ec6d9' size-in-bits='32' filepath='types.h' line='64' column='1' hash='e66b43f97c38e87a' id='2bb2b96f'/>
    <typedef-decl name='mode_t' type-id='e1c52942' size-in-bits='32' filepath='types.h' line='69' column='1' hash='e66b43f97c38e87a' id='d50d396c'/>
    <typedef-decl name='off_t' type-id='79989e9c' size-in-bits='64' filepath='stdio.h' line='64' column='1' hash='b119fe0931d2ee10' id='ad707ada'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' size-in-bits='32' filepath='pthreadtypes.h' line='103' column='1' hash='ae69415523d5e788' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_fsdev_event_cb_t' type-id='e37e36e9' size-in-bits='64' filepath='fsdev.h' line='40' column='1' hash='fd7a63c0c6c822c4' id='f5bf2e9f'/>
    <typedef-decl name='spdk_fsdev_fini_cb' type-id='61359e15' size-in-bits='64' filepath='fsdev.h' line='140' column='1' hash='fd7a63c0c6c822c4' id='c17a5d68'/>
    <typedef-decl name='spdk_fsdev_init_cb' type-id='82328a76' size-in-bits='64' filepath='fsdev.h' line='133' column='1' hash='fd7a63c0c6c822c4' id='94168d2e'/>
    <typedef-decl name='spdk_fsdev_io_completion_cb' type-id='8d6edbcb' size-in-bits='64' filepath='fsdev_module.h' line='118' column='1' hash='fd7a63c0c6c822c4' id='e975e7e9'/>
    <typedef-decl name='spdk_fsdev_readdir_entry_cb' type-id='7c767da8' size-in-bits='64' filepath='fsdev.h' line='1224' column='1' id='fee029bc'/>
    <typedef-decl name='spdk_fsdev_unregister_cb' type-id='82328a76' size-in-bits='64' filepath='fsdev_module.h' line='78' column='1' hash='fd7a63c0c6c822c4' id='7bff2ab2'/>
    <typedef-decl name='uid_t' type-id='cc5fcceb' size-in-bits='32' filepath='types.h' line='79' column='1' hash='e66b43f97c38e87a' id='354978ed'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' size-in-bits='64' filepath='stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
