<abi-corpus version='2.4' soname='libspdk_sock.so.13.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_json.so.7.0'/>
    <dependency name='libspdk_jsonrpc.so.7.0'/>
    <dependency name='libspdk_rpc.so.8.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_net_impl_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_accept' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_connect_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_connect_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_sock_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_fd_group_get_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_set_nonblock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_decode_bool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_decode_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_decode_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_decode_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_array_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_array_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_bool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_named_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_json_write_object_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_end_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_send_bool_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_rpc_register_method' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_description_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_owner_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='sock.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' hash='e7f9696e246a3049' id='36c46961'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='8f80b239'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='95e97e5f'/>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='95e97e60'/>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default' filepath='thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eec' visibility='default' filepath='struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default' filepath='struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='95e97e60' visibility='default' filepath='struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default' filepath='struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__sock_request_internal' is-struct='yes' visibility='default' size-in-bits='320' filepath='sock.h' line='47' column='1' hash='87974f02dbba2b72' id='683903f3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='sock.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='curr_list' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='offset' type-id='8f92235e' visibility='default' filepath='sock.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='zcopy_idx' type-id='8f92235e' visibility='default' filepath='sock.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='pending_zcopy' type-id='c894953d' visibility='default' filepath='sock.h' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='addrinfo' is-struct='yes' visibility='default' size-in-bits='384' filepath='netdb.h' line='565' column='1' hash='48abe09dffa0d298' id='9194f5e2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='95e97e5e' visibility='default' filepath='netdb.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='95e97e5e' visibility='default' filepath='netdb.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='95e97e5e' visibility='default' filepath='netdb.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='95e97e5e' visibility='default' filepath='netdb.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='6b2697b0' visibility='default' filepath='netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='5c0abad8' visibility='default' filepath='netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='26a90f95' visibility='default' filepath='netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='61e7b2c0' visibility='default' filepath='netdb.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='iovec' is-struct='yes' visibility='default' size-in-bits='128' filepath='struct_iovec.h' line='26' column='1' hash='1e0571bd6dce7043' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='socket.h' line='184' column='1' hash='17b889f8dd08e00f' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default' filepath='socket.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default' filepath='socket.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_net_impl' is-struct='yes' visibility='default' size-in-bits='2112' filepath='sock_module.h' line='79' column='1' hash='a4fd423109fb16b3' id='7828460a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default' filepath='sock_module.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init' type-id='61c8db7b' visibility='default' filepath='sock_module.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='getaddr' type-id='62f1518f' visibility='default' filepath='sock_module.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_interface_name' type-id='369639b5' visibility='default' filepath='sock_module.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_numa_id' type-id='e9d5fadf' visibility='default' filepath='sock_module.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='connect' type-id='a3075764' visibility='default' filepath='sock_module.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='connect_async' type-id='42064bab' visibility='default' filepath='sock_module.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='listen' type-id='a3075764' visibility='default' filepath='sock_module.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='accept' type-id='f9456d5d' visibility='default' filepath='sock_module.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='close' type-id='f8919d3d' visibility='default' filepath='sock_module.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='recv' type-id='6dab9a51' visibility='default' filepath='sock_module.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='readv' type-id='596a8b54' visibility='default' filepath='sock_module.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='writev' type-id='596a8b54' visibility='default' filepath='sock_module.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='recv_next' type-id='eed74af1' visibility='default' filepath='sock_module.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='writev_async' type-id='d0d58ee7' visibility='default' filepath='sock_module.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='readv_async' type-id='d0d58ee7' visibility='default' filepath='sock_module.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='flush' type-id='f8919d3d' visibility='default' filepath='sock_module.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='set_recvlowat' type-id='fe5b785e' visibility='default' filepath='sock_module.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='set_recvbuf' type-id='fe5b785e' visibility='default' filepath='sock_module.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='set_sendbuf' type-id='fe5b785e' visibility='default' filepath='sock_module.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='is_ipv6' type-id='3679e5d6' visibility='default' filepath='sock_module.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='is_ipv4' type-id='3679e5d6' visibility='default' filepath='sock_module.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='is_connected' type-id='3679e5d6' visibility='default' filepath='sock_module.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='group_impl_get_optimal' type-id='2fa2737e' visibility='default' filepath='sock_module.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='group_impl_create' type-id='ca7c2c5f' visibility='default' filepath='sock_module.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='group_impl_add_sock' type-id='ee0c19b3' visibility='default' filepath='sock_module.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='group_impl_remove_sock' type-id='ee0c19b3' visibility='default' filepath='sock_module.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='group_impl_poll' type-id='332ce42e' visibility='default' filepath='sock_module.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='group_impl_get_interruptfd' type-id='0be80f1e' visibility='default' filepath='sock_module.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='group_impl_close' type-id='0be80f1e' visibility='default' filepath='sock_module.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='get_opts' type-id='54006923' visibility='default' filepath='sock_module.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='set_opts' type-id='6bd762fe' visibility='default' filepath='sock_module.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='link' type-id='e7f43f73' visibility='default' filepath='sock_module.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock' is-struct='yes' visibility='default' size-in-bits='1920' filepath='sock_module.h' line='34' column='1' hash='70518fa879016562' id='2fd26578'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='net_impl' type-id='5dabfc38' visibility='default' filepath='sock_module.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='opts' type-id='635566cb' visibility='default' filepath='sock_module.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='group_impl' type-id='ad1df54b' visibility='default' filepath='sock_module.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='link' type-id='e7f43f74' visibility='default' filepath='sock_module.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='queued_reqs' type-id='e7f43f75' visibility='default' filepath='sock_module.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='pending_reqs' type-id='e7f43f75' visibility='default' filepath='sock_module.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='read_req' type-id='7fb90480' visibility='default' filepath='sock_module.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='queued_iovcnt' type-id='95e97e5e' visibility='default' filepath='sock_module.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='cb_cnt' type-id='95e97e5e' visibility='default' filepath='sock_module.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='cb_fn' type-id='f24fbecd' visibility='default' filepath='sock_module.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='sock_module.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='flags' type-id='e7f43f76' visibility='default' filepath='sock_module.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='impl_opts' type-id='14471ec6' visibility='default' filepath='sock_module.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group' is-struct='yes' visibility='default' size-in-bits='384' filepath='sock_module.h' line='60' column='1' hash='2ac42da50a9d7286' id='9baacbac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='group_impls' type-id='e7f43f77' visibility='default' filepath='sock_module.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pool' type-id='e7f43f78' visibility='default' filepath='sock_module.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fgrp' type-id='eb7a8954' visibility='default' filepath='sock_module.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='sock_module.h' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group_impl' is-struct='yes' visibility='default' size-in-bits='320' filepath='sock_module.h' line='67' column='1' hash='7d3794fbb9f0fefd' id='00ed2c8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='net_impl' type-id='5dabfc38' visibility='default' filepath='sock_module.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='group' type-id='becb7f9a' visibility='default' filepath='sock_module.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='socks' type-id='e7f43f79' visibility='default' filepath='sock_module.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='link' type-id='e7f43f7a' visibility='default' filepath='sock_module.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_group_provided_buf' is-struct='yes' visibility='default' size-in-bits='192' filepath='sock_module.h' line='54' column='1' hash='01fe9c45fd6d5b90' id='b9665878'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='len' type-id='b59d7dce' visibility='default' filepath='sock_module.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default' filepath='sock_module.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='e7f43f7b' visibility='default' filepath='sock_module.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_impl_opts' is-struct='yes' visibility='default' size-in-bits='640' filepath='sock.h' line='92' column='1' hash='b25c6208e2c6f023' id='14471ec6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='recv_buf_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='send_buf_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='enable_recv_pipe' type-id='c894953d' visibility='default' filepath='sock.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='72'>
        <var-decl name='enable_zerocopy_send' type-id='c894953d' visibility='default' filepath='sock.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='enable_quickack' type-id='c894953d' visibility='default' filepath='sock.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='enable_placement_id' type-id='8f92235e' visibility='default' filepath='sock.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='enable_zerocopy_send_server' type-id='c894953d' visibility='default' filepath='sock.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136'>
        <var-decl name='enable_zerocopy_send_client' type-id='c894953d' visibility='default' filepath='sock.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='zerocopy_threshold' type-id='8f92235e' visibility='default' filepath='sock.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tls_version' type-id='8f92235e' visibility='default' filepath='sock.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='enable_ktls' type-id='c894953d' visibility='default' filepath='sock.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='psk_key' type-id='ae3e8ca6' visibility='default' filepath='sock.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='psk_key_size' type-id='8f92235e' visibility='default' filepath='sock.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='psk_identity' type-id='26a90f95' visibility='default' filepath='sock.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_key' type-id='1d0db890' visibility='default' filepath='sock.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_key_ctx' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tls_cipher_suites' type-id='80f4b756' visibility='default' filepath='sock.h' line='193' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_initialize_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='sock.h' line='266' column='1' hash='ed52bbe8ad46ba64' id='c579abea'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='sock.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='enable_interrupt_mode' type-id='c894953d' visibility='default' filepath='sock.h' line='277' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_map' is-struct='yes' visibility='default' size-in-bits='448' filepath='sock_module.h' line='74' column='1' hash='1c75920f5059ee34' id='a3b1dfd1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='entries' type-id='e7f43f7c' visibility='default' filepath='sock_module.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mtx' type-id='7a6844eb' visibility='default' filepath='sock_module.h' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_opts' is-struct='yes' visibility='default' size-in-bits='448' filepath='sock.h' line='202' column='1' hash='6c23d7c88ccf5e7f' id='635566cb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='sock.h' line='208' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='95e97e5e' visibility='default' filepath='sock.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zcopy' type-id='c894953d' visibility='default' filepath='sock.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='reserved13' type-id='d3490169' visibility='default' filepath='sock.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ack_timeout' type-id='8f92235e' visibility='default' filepath='sock.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='sock.h' line='229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='impl_opts' type-id='276545ec' visibility='default' filepath='sock.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='impl_opts_size' type-id='b59d7dce' visibility='default' filepath='sock.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='src_addr' type-id='80f4b756' visibility='default' filepath='sock.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='src_port' type-id='149c6638' visibility='default' filepath='sock.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='400'>
        <var-decl name='reserved50' type-id='0f4b9e74' visibility='default' filepath='sock.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='connect_timeout' type-id='8f92235e' visibility='default' filepath='sock.h' line='259' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_sock_request' is-struct='yes' visibility='default' size-in-bits='512' filepath='sock.h' line='36' column='1' hash='a4adcf9f7c640a75' id='6ddea8d2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='82328a76' visibility='default' filepath='sock.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='sock.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='683903f3' visibility='default' filepath='sock.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default' filepath='sock.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='sock_module.h' line='123' column='1' hash='8d85d0a64d3a7934' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='5dabfc38' visibility='default' filepath='sock_module.h' line='123' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='38' column='1' hash='f55b28771aea0d4a#2' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2301d53e' visibility='default' filepath='sock_module.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='2fe26e7c' visibility='default' filepath='sock_module.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='70' column='1' hash='b957026ecfca864b#3' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='2301d53e' visibility='default' filepath='sock_module.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='2fe26e7c' visibility='default' filepath='sock_module.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='sock_module.h' line='71' column='1' hash='bf8bb63882203e92#4' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='ad1df54b' visibility='default' filepath='sock_module.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='61' column='1' hash='81d954ec1bc4b151#5' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='ad1df54b' visibility='default' filepath='sock_module.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='e72947b3' visibility='default' filepath='sock_module.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='sock_module.h' line='57' column='1' hash='7e1ab2ca810917ce#6' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='8142ca8e' visibility='default' filepath='sock_module.h' line='57' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='62' column='1' hash='f50ffec7e0f219cb#7' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='8142ca8e' visibility='default' filepath='sock_module.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='2025002c' visibility='default' filepath='sock_module.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='75' column='1' hash='772e57a8a722d0ef#8' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='90ef5363' visibility='default' filepath='sock_module.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='71c01beb' visibility='default' filepath='sock_module.h' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock.h' line='48' column='1' hash='c41d0ed61bebdc35#9' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7fb90480' visibility='default' filepath='sock.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ba42579e' visibility='default' filepath='sock.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='sock_module.h' line='40' column='1' hash='8cee5a9af69e1551#10' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='7fb90480' visibility='default' filepath='sock_module.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ba42579e' visibility='default' filepath='sock_module.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' is-struct='yes' visibility='default' size-in-bits='8' is-anonymous='yes' filepath='sock_module.h' line='47' column='1' hash='50851560f30b9eb8#11' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='closed' type-id='b96825af' visibility='default' filepath='sock_module.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='b96825af' visibility='default' filepath='sock_module.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__int32_t' type-id='95e97e5e' size-in-bits='32' filepath='types.h' line='41' column='1' hash='09d17c08f594edc7' id='33f57a65'/>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' size-in-bits='128' filepath='thread-shared-types.h' line='55' column='1' id='518fb49c'/>
    <typedef-decl name='__socklen_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='210' column='1' hash='e66b43f97c38e87a' id='83f97a0a'/>
    <typedef-decl name='__ssize_t' type-id='95e97e5f' size-in-bits='64' filepath='types.h' line='194' column='1' hash='b119fe0931d2ee10' id='41060289'/>
    <typedef-decl name='__uint16_t' type-id='f0981eed' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='int32_t' type-id='33f57a65' size-in-bits='32' filepath='stdint-intn.h' line='26' column='1' hash='09d17c08f594edc7' id='3ff5601b'/>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' size-in-bits='320' filepath='pthreadtypes.h' line='72' column='1' id='7a6844eb'/>
    <typedef-decl name='sa_family_t' type-id='f0981eed' size-in-bits='16' filepath='sockaddr.h' line='28' column='1' hash='d7723bb93a30b11d' id='376fda66'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' size-in-bits='32' filepath='socket.h' line='33' column='1' hash='e66b43f97c38e87a' id='6b2697b0'/>
    <typedef-decl name='spdk_sock_cb' type-id='674c7299' size-in-bits='64' filepath='sock.h' line='623' column='1' hash='fd7a63c0c6c822c4' id='f24fbecd'/>
    <typedef-decl name='spdk_sock_connect_cb_fn' type-id='82328a76' size-in-bits='64' filepath='sock.h' line='375' column='1' hash='fd7a63c0c6c822c4' id='90e833ff'/>
    <typedef-decl name='ssize_t' type-id='41060289' size-in-bits='64' filepath='stdio.h' line='78' column='1' hash='b119fe0931d2ee10' id='79a0948f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' size-in-bits='8' filepath='stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='16' hash='92399eb84731c3e2' id='0f4b9e74'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' hash='5263bcb890c51214' id='d3490169'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='30d99d19f0f4b2ea' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' hash='7df313b77e5f7cf4' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='16fe7105'/>
    </array-type-def>
