<abi-corpus version='2.4' soname='libspdk_thread.so.12.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.8.0'/>
    <dependency name='libspdk_util.so.11.0'/>
    <dependency name='libspdk_trace.so.12.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_for_each_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_channel_continue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_is_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_fd_group_get_default_event_handler_opts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_get_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_nest' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_set_wrapper' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_unnest' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_fd_group_wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_log_register_flag' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_add_register_fn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_description_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_owner' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_trace_register_owner_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='timerfd_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='timerfd_settime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='g_trace_file' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_first_numa_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_last_numa_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_env_get_next_numa_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_get_ticks_hz' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_malloc' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mem_get_numa_id' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_get_bulk' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_mempool_put' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_count' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_create' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_dequeue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_enqueue' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='spdk_ring_free' type='no-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='iobuf.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='83557d2f' size-in-bits='1152' hash='8640d025ab97f573' id='c7587586'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='52f813b4'/>
    </array-type-def>
    <class-decl name='spdk_iobuf_buffer' is-struct='yes' visibility='default' size-in-bits='64' filepath='thread.h' line='1136' column='1' hash='efb1fa163f7c7507' id='9321bf74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stailq' type-id='e7f43f72' visibility='default' filepath='thread.h' line='1137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_buffer_stailq_t' is-struct='yes' naming-typedef-id='306e7691' visibility='default' size-in-bits='128' filepath='thread.h' line='1141' column='1' hash='ab07a5bcfa5575e1' id='79110b08'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='136d6f32' visibility='default' filepath='thread.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ad45e2c8' visibility='default' filepath='thread.h' line='1141' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_channel' is-struct='yes' visibility='default' size-in-bits='1280' filepath='thread.h' line='1175' column='1' hash='52b7f41d83b544f8' id='e8e2ad7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='parent' type-id='a7e01876' visibility='default' filepath='thread.h' line='1179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cache' type-id='c7587586' visibility='default' filepath='thread.h' line='1181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry' is-struct='yes' visibility='default' size-in-bits='192' filepath='thread.h' line='1130' column='1' hash='3823418d95fd487d' id='71e32ba2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='8b006695' visibility='default' filepath='thread.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module' type-id='eaa32e2f' visibility='default' filepath='thread.h' line='1132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stailq' type-id='e7f43f73' visibility='default' filepath='thread.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_entry_stailq_t' is-struct='yes' naming-typedef-id='da6a25d9' visibility='default' size-in-bits='128' filepath='thread.h' line='1140' column='1' hash='8b3084943765eb88' id='ce92b0c6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='29210180' visibility='default' filepath='thread.h' line='1140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='68f59e9e' visibility='default' filepath='thread.h' line='1140' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_module_stats' is-struct='yes' visibility='default' size-in-bits='448' filepath='thread.h' line='1119' column='1' hash='f01f5416b2ea93a7' id='c3a99cd6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small_pool' type-id='adee513c' visibility='default' filepath='thread.h' line='1120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='large_pool' type-id='adee513c' visibility='default' filepath='thread.h' line='1121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='module' type-id='80f4b756' visibility='default' filepath='thread.h' line='1122' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_node_cache' is-struct='yes' visibility='default' size-in-bits='1152' filepath='thread.h' line='1160' column='1' hash='4e737c923b695dc8' id='83557d2f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small' type-id='907b5035' visibility='default' filepath='thread.h' line='1162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='large' type-id='907b5035' visibility='default' filepath='thread.h' line='1164' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_opts' is-struct='yes' visibility='default' size-in-bits='320' filepath='thread.h' line='1088' column='1' hash='dfa7cb42fb9f7437' id='2b1f9788'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='small_pool_count' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1090' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='large_pool_count' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1092' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='small_bufsize' type-id='8f92235e' visibility='default' filepath='thread.h' line='1094' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='large_bufsize' type-id='8f92235e' visibility='default' filepath='thread.h' line='1096' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='thread.h' line='1104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='enable_numa' type-id='b96825af' visibility='default' filepath='thread.h' line='1107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool_cache' is-struct='yes' visibility='default' size-in-bits='576' filepath='thread.h' line='1143' column='1' hash='80666152020baba8' id='907b5035'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pool' type-id='b2192338' visibility='default' filepath='thread.h' line='1145' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cache' type-id='306e7691' visibility='default' filepath='thread.h' line='1147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cache_count' type-id='8f92235e' visibility='default' filepath='thread.h' line='1149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='cache_size' type-id='8f92235e' visibility='default' filepath='thread.h' line='1151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='queue' type-id='49599bfc' visibility='default' filepath='thread.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='bufsize' type-id='8f92235e' visibility='default' filepath='thread.h' line='1155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='stats' type-id='adee513c' visibility='default' filepath='thread.h' line='1157' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_iobuf_pool_stats' is-struct='yes' visibility='default' size-in-bits='192' filepath='thread.h' line='1110' column='1' hash='10641058b4271617' id='adee513c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cache' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='main' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='retry' type-id='9c313c2d' visibility='default' filepath='thread.h' line='1116' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='thread.h' line='1137' column='1' hash='847a447b977d48b2' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='136d6f32' visibility='default' filepath='thread.h' line='1137' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='64' is-anonymous='yes' filepath='thread.h' line='1133' column='1' hash='9d88403e96580dfc#2' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='29210180' visibility='default' filepath='thread.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_iobuf_buffer_stailq_t' type-id='79110b08' size-in-bits='128' filepath='thread.h' line='1141' column='1' id='306e7691'/>
    <typedef-decl name='spdk_iobuf_entry_stailq_t' type-id='ce92b0c6' size-in-bits='128' filepath='thread.h' line='1140' column='1' id='da6a25d9'/>
    <typedef-decl name='spdk_iobuf_finish_cb' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='1191' column='1' hash='fd7a63c0c6c822c4' id='54a757f6'/>
    <typedef-decl name='spdk_iobuf_for_each_entry_fn' type-id='b845eafb' size-in-bits='64' filepath='thread.h' line='1257' column='1' hash='fd7a63c0c6c822c4' id='acf1b6cc'/>
    <typedef-decl name='spdk_iobuf_get_cb' type-id='86c1c05e' size-in-bits='64' filepath='thread.h' line='1127' column='1' hash='fd7a63c0c6c822c4' id='8b006695'/>
    <typedef-decl name='spdk_iobuf_get_stats_cb' type-id='47f054e2' size-in-bits='64' filepath='thread.h' line='1310' column='1' hash='fd7a63c0c6c822c4' id='9d506da1'/>
    <qualified-type-def type-id='2b1f9788' const='yes' hash='13fca90fca8b9f3e' id='d9f751c7'/>
    <pointer-type-def type-id='d9f751c7' size-in-bits='64' hash='0ec2f2df1539920b' id='0d55f817'/>
    <pointer-type-def type-id='1a50f708' size-in-bits='64' hash='fd7a63c0c6c822c4' id='b845eafb'/>
    <pointer-type-def type-id='9321bf74' size-in-bits='64' hash='fcfecc06c3e6bc4e' id='136d6f32'/>
    <pointer-type-def type-id='136d6f32' size-in-bits='64' hash='b2b8a55b146d9011' id='ad45e2c8'/>
    <pointer-type-def type-id='e8e2ad7d' size-in-bits='64' hash='59a882b5a5a5ec0f' id='f905ec5d'/>
    <pointer-type-def type-id='71e32ba2' size-in-bits='64' hash='7a5ac91511c7d708' id='29210180'/>
    <pointer-type-def type-id='29210180' size-in-bits='64' hash='e9ec4a9354e6e83b' id='68f59e9e'/>
    <pointer-type-def type-id='da6a25d9' size-in-bits='64' hash='500283e43bd4c202' id='49599bfc'/>
    <pointer-type-def type-id='c3a99cd6' size-in-bits='64' hash='3777bb5077c02569' id='0e94382c'/>
    <pointer-type-def type-id='2b1f9788' size-in-bits='64' hash='f0965f87a638abe3' id='bd31792e'/>
    <pointer-type-def type-id='84d13285' size-in-bits='64' hash='fd7a63c0c6c822c4' id='86c1c05e'/>
    <pointer-type-def type-id='39bf6d87' size-in-bits='64' hash='fd7a63c0c6c822c4' id='47f054e2'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <function-decl name='spdk_iobuf_initialize' mangled-name='spdk_iobuf_initialize' filepath='iobuf.c' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_initialize' hash='388da3fa973fde78'>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_finish' mangled-name='spdk_iobuf_finish' filepath='iobuf.c' line='270' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_finish' hash='5695f5ce05a4c55f'>
      <parameter type-id='54a757f6' name='cb_fn' filepath='iobuf.c' line='270' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='iobuf.c' line='270' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_set_opts' mangled-name='spdk_iobuf_set_opts' filepath='iobuf.c' line='285' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_set_opts' hash='7fc43539450d268b'>
      <parameter type-id='0d55f817' name='opts' filepath='iobuf.c' line='285' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_get_opts' mangled-name='spdk_iobuf_get_opts' filepath='iobuf.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_get_opts' hash='5a4723771cb0be08'>
      <parameter type-id='bd31792e' name='opts' filepath='iobuf.c' line='349' column='1'/>
      <parameter type-id='b59d7dce' name='opts_size' filepath='iobuf.c' line='349' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_channel_init' mangled-name='spdk_iobuf_channel_init' filepath='iobuf.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_channel_init' hash='43a9b3b93cef05fb'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='460' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='iobuf.c' line='460' column='1'/>
      <parameter type-id='8f92235e' name='small_cache_size' filepath='iobuf.c' line='461' column='1'/>
      <parameter type-id='8f92235e' name='large_cache_size' filepath='iobuf.c' line='461' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_channel_fini' mangled-name='spdk_iobuf_channel_fini' filepath='iobuf.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_channel_fini' hash='83ea0cef7185b7fe'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='559' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_register_module' mangled-name='spdk_iobuf_register_module' filepath='iobuf.c' line='581' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_register_module' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='name' filepath='iobuf.c' line='608' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_unregister_module' mangled-name='spdk_iobuf_unregister_module' filepath='iobuf.c' line='608' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_unregister_module' hash='e9ea91a7eab8302c'>
      <parameter type-id='80f4b756' name='name' filepath='iobuf.c' line='608' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_for_each_entry' mangled-name='spdk_iobuf_for_each_entry' filepath='iobuf.c' line='647' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_for_each_entry' hash='b13f4523ade57cc0'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='647' column='1'/>
      <parameter type-id='acf1b6cc' name='cb_fn' filepath='iobuf.c' line='648' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_ctx' filepath='iobuf.c' line='648' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_iobuf_entry_abort' mangled-name='spdk_iobuf_entry_abort' filepath='iobuf.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_entry_abort' hash='2e148c6624d425c4'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='698' column='1'/>
      <parameter type-id='29210180' name='entry' filepath='iobuf.c' line='698' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='iobuf.c' line='699' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_get' mangled-name='spdk_iobuf_get' filepath='iobuf.c' line='711' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_get' hash='d5e55c6175860ee0'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='711' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='iobuf.c' line='711' column='1'/>
      <parameter type-id='29210180' name='entry' filepath='iobuf.c' line='712' column='1'/>
      <parameter type-id='8b006695' name='cb_fn' filepath='iobuf.c' line='712' column='1'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_put' mangled-name='spdk_iobuf_put' filepath='iobuf.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_put' hash='6b28dab096e7e9d7'>
      <parameter type-id='f905ec5d' name='ch' filepath='iobuf.c' line='766' column='1'/>
      <parameter type-id='eaa32e2f' name='buf' filepath='iobuf.c' line='766' column='1'/>
      <parameter type-id='9c313c2d' name='len' filepath='iobuf.c' line='766' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_iobuf_get_stats' mangled-name='spdk_iobuf_get_stats' filepath='iobuf.c' line='883' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_iobuf_get_stats' hash='a7f99494147764a8'>
      <parameter type-id='9d506da1' name='cb_fn' filepath='iobuf.c' line='883' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='iobuf.c' line='883' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' hash='4c0d580acb5bc91d' id='1a50f708'>
      <parameter type-id='f905ec5d'/>
      <parameter type-id='29210180'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' hash='07016b87e631b847' id='84d13285'>
      <parameter type-id='29210180'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='9c614a37b677247b' id='39bf6d87'>
      <parameter type-id='0e94382c'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='thread.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' hash='5ba96bb22f4237fb' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='a84c031d'/>
    <array-type-def dimensions='2' type-id='a84c031d' size-in-bits='131072' hash='3c5916f897c0fccc' id='2afe1b7d'>
      <subrange length='1024' lower-bound='0' upper-bound='1023' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='3d55c71eae25bbb8' id='c60446f8'/>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' hash='32c03ac42667596f' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='48882d96'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='192' hash='fff287cef34a1a32' id='6653bb13'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='fdd3342b'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' hash='85a15a68e9db1393' id='cd5f2f4f'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='72e246d7'/>
    </array-type-def>
    <enum-decl name='spdk_interrupt_event_types' size-in-bits='32' alignment-in-bits='32' filepath='thread.h' line='962' column='1' hash='8651242702a271f7' id='88d1abf7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_IN' value='1'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_OUT' value='4'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_ET' value='2147483648'/>
    </enum-decl>
    <enum-decl name='spdk_thread_op' size-in-bits='32' alignment-in-bits='32' filepath='thread.h' line='60' column='1' hash='44705a75251d62ce' id='1380717f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_THREAD_OP_NEW' value='0'/>
      <enumerator name='SPDK_THREAD_OP_RESCHED' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='e60ad0bd' size-in-bits='1024' hash='60ed9848ccb7031f' id='b82d72d1'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='0bd4cb79' size-in-bits='4096' hash='0f079d7129c3e1e4' id='9fd81fb6'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9de25536' size-in-bits='4096' hash='1ca77a0af0acdbdb' id='42417227'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='40439314' size-in-bits='1945600' hash='7c0b354302af8747' id='4ee141dd'>
      <subrange length='1280' lower-bound='0' upper-bound='1279' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='7da7205683a200f5' id='33dc94fc'/>
    </array-type-def>
    <class-decl name='spdk_cpuset' is-struct='yes' visibility='default' size-in-bits='3080' filepath='cpuset.h' line='25' column='1' hash='c4979574ded471d6' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default' filepath='cpuset.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default' filepath='cpuset.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_event_handler_opts' is-struct='yes' visibility='default' size-in-bits='128' filepath='fd_group.h' line='36' column='1' hash='e7ab4467a2066d96' id='67302c12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default' filepath='fd_group.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='events' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='fd_type' type-id='8f92235e' visibility='default' filepath='fd_group.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_poller_stats' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread.h' line='14' column='1' hash='5728cb13165dc9e3' id='cb2c3d4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='run_count' type-id='9c313c2d' visibility='default' filepath='thread.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='busy_count' type-id='9c313c2d' visibility='default' filepath='thread.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_spinlock' is-struct='yes' visibility='default' size-in-bits='256' filepath='thread.h' line='1044' column='1' hash='f3654a830a369375' id='d02a8f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='spinlock' type-id='6d44fa69' visibility='default' filepath='thread.h' line='1045' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default' filepath='thread.h' line='1046' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='e7041c49' visibility='default' filepath='thread.h' line='1047' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initialized' type-id='c894953d' visibility='default' filepath='thread.h' line='1048' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='destroyed' type-id='c894953d' visibility='default' filepath='thread.h' line='1049' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_thread_stats' is-struct='yes' visibility='default' size-in-bits='128' filepath='thread.h' line='475' column='1' hash='2aa08a1a07e79c20' id='06899014'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='busy_tsc' type-id='9c313c2d' visibility='default' filepath='thread.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idle_tsc' type-id='9c313c2d' visibility='default' filepath='thread.h' line='477' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_argument' is-struct='yes' visibility='default' size-in-bits='128' filepath='trace.h' line='76' column='1' hash='80b9ee8812159e6b' id='e60ad0bd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='f01a039e' visibility='default' filepath='trace.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='size' type-id='b96825af' visibility='default' filepath='trace.h' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_file' is-struct='yes' visibility='default' size-in-bits='2151936' filepath='trace.h' line='125' column='1' hash='8233947ec35f6520' id='a6dc9de4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='file_size' type-id='9c313c2d' visibility='default' filepath='trace.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tsc_rate' type-id='9c313c2d' visibility='default' filepath='trace.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tpoint_mask' type-id='38ce06c2' visibility='default' filepath='trace.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tname' type-id='2afe1b7d' visibility='default' filepath='trace.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='132480'>
        <var-decl name='owner_type' type-id='42417227' visibility='default' filepath='trace.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='136576'>
        <var-decl name='object' type-id='9fd81fb6' visibility='default' filepath='trace.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='140672'>
        <var-decl name='tpoint' type-id='4ee141dd' visibility='default' filepath='trace.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086272'>
        <var-decl name='num_owners' type-id='149c6638' visibility='default' filepath='trace.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086288'>
        <var-decl name='owner_description_size' type-id='149c6638' visibility='default' filepath='trace.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086304'>
        <var-decl name='reserved' type-id='d351502e' visibility='default' filepath='trace.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2086336'>
        <var-decl name='lcore_history_offsets' type-id='4dee7a71' visibility='default' filepath='trace.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151872'>
        <var-decl name='owner_offset' type-id='9c313c2d' visibility='default' filepath='trace.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2151936'>
        <var-decl name='data' type-id='048fe7bc' visibility='default' filepath='trace.h' line='147' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_object' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='59' column='1' hash='4cb7e9f800eb3922' id='0bd4cb79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_owner_type' is-struct='yes' visibility='default' size-in-bits='16' filepath='trace.h' line='45' column='1' hash='3a844a43fe71e62c' id='9de25536'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='b96825af' visibility='default' filepath='trace.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='id_prefix' type-id='a84c031d' visibility='default' filepath='trace.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_trace_tpoint' is-struct='yes' visibility='default' size-in-bits='1520' filepath='trace.h' line='82' column='1' hash='6811ef216b2d907d' id='40439314'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='6653bb13' visibility='default' filepath='trace.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tpoint_id' type-id='149c6638' visibility='default' filepath='trace.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='owner_type' type-id='b96825af' visibility='default' filepath='trace.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='216'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='new_object' type-id='b96825af' visibility='default' filepath='trace.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='232'>
        <var-decl name='num_args' type-id='b96825af' visibility='default' filepath='trace.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='240'>
        <var-decl name='args' type-id='b82d72d1' visibility='default' filepath='trace.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1264'>
        <var-decl name='related_objects' type-id='4cb10997' visibility='default' filepath='trace.h' line='94' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='16' is-anonymous='yes' filepath='trace.h' line='91' column='1' hash='674f82d2e91b52ab#3' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='object_type' type-id='b96825af' visibility='default' filepath='trace.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='arg_index' type-id='b96825af' visibility='default' filepath='trace.h' line='93' column='1'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='e7f43f74' size-in-bits='256' hash='835df774c3307f8b' id='4cb10997'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='f0981eeb' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='848d0938'/>
    </array-type-def>
    <typedef-decl name='__uint16_t' type-id='f0981eec' size-in-bits='16' filepath='types.h' line='40' column='1' hash='d7723bb93a30b11d' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' size-in-bits='32' filepath='types.h' line='42' column='1' hash='e66b43f97c38e87a' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eeb' size-in-bits='64' filepath='types.h' line='45' column='1' hash='8fdc5eea2983a729' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' size-in-bits='8' filepath='types.h' line='38' column='1' hash='6ebac62b3366db68' id='c51d6389'/>
    <typedef-decl name='pthread_spinlock_t' type-id='e024ff18' size-in-bits='32' filepath='pthreadtypes.h' line='103' column='1' hash='ae69415523d5e788' id='6d44fa69'/>
    <typedef-decl name='size_t' type-id='f0981eeb' size-in-bits='64' filepath='stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='b59d7dce'/>
    <typedef-decl name='spdk_channel_for_each_cpl' type-id='2f4d5fde' size-in-bits='64' filepath='thread.h' line='171' column='1' hash='fd7a63c0c6c822c4' id='38c48f04'/>
    <typedef-decl name='spdk_channel_msg' type-id='71711fbd' size-in-bits='64' filepath='thread.h' line='163' column='1' hash='fd7a63c0c6c822c4' id='fce5caf0'/>
    <typedef-decl name='spdk_interrupt_fn' type-id='c04372aa' size-in-bits='64' filepath='thread.h' line='860' column='1' hash='fd7a63c0c6c822c4' id='d841131b'/>
    <typedef-decl name='spdk_io_channel_create_cb' type-id='67230494' size-in-bits='64' filepath='thread.h' line='141' column='1' hash='fd7a63c0c6c822c4' id='7c63ffcc'/>
    <typedef-decl name='spdk_io_channel_destroy_cb' type-id='30f9af41' size-in-bits='64' filepath='thread.h' line='149' column='1' hash='fd7a63c0c6c822c4' id='7e998c02'/>
    <typedef-decl name='spdk_io_device_unregister_cb' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='156' column='1' hash='fd7a63c0c6c822c4' id='ee92dcdf'/>
    <typedef-decl name='spdk_msg_fn' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='87' column='1' hash='fd7a63c0c6c822c4' id='de128c99'/>
    <typedef-decl name='spdk_new_thread_fn' type-id='273f9155' size-in-bits='64' filepath='thread.h' line='55' column='1' hash='fd7a63c0c6c822c4' id='cf6adfe1'/>
    <typedef-decl name='spdk_poller_fn' type-id='c04372aa' size-in-bits='64' filepath='thread.h' line='106' column='1' hash='fd7a63c0c6c822c4' id='6aa9ba7a'/>
    <typedef-decl name='spdk_poller_set_interrupt_mode_cb' type-id='0e02a660' size-in-bits='64' filepath='thread.h' line='115' column='1' hash='fd7a63c0c6c822c4' id='5d15a824'/>
    <typedef-decl name='spdk_post_poller_fn' type-id='61359e15' size-in-bits='64' filepath='thread.h' line='1323' column='1' hash='fd7a63c0c6c822c4' id='dc9b0e69'/>
    <typedef-decl name='spdk_thread_op_fn' type-id='0a96cec0' size-in-bits='64' filepath='thread.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='fd7a9268'/>
    <typedef-decl name='spdk_thread_op_supported_fn' type-id='127c0016' size-in-bits='64' filepath='thread.h' line='80' column='1' hash='fd7a63c0c6c822c4' id='34a4e98f'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' size-in-bits='16' filepath='stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' size-in-bits='32' filepath='stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='8f92235e'/>
