<abi-corpus version='2.0' soname='libspdk_bdev.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libspdk_util.so.5.0'/>
    <dependency name='libspdk_thread.so.7.0'/>
    <dependency name='libspdk_json.so.4.0'/>
    <dependency name='libspdk_jsonrpc.so.4.0'/>
    <dependency name='libspdk_rpc.so.4.0'/>
    <dependency name='libspdk_notify.so.4.0'/>
    <dependency name='libspdk_trace.so.6.0'/>
    <dependency name='libspdk_dma.so.2.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_bdev_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_alias_del_all' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_compare_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_bdev_unregister' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_unregister_by_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_wait_for_examine' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_blocks_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_zeroes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_write_zeroes_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_writev_blocks_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zcopy_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zcopy_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_append' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_append_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_appendv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_appendv_with_md' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_bdev_zone_management' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_bdev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_bdev_leaf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_nvme_translate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='bdev.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='4096' id='d0b1608e'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <array-type-def dimensions='1' type-id='10d33c5b' size-in-bits='1280' id='a122b85b'>
      <subrange length='4' type-id='7359adad' id='16fe7105'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='24' id='d3490169'>
      <subrange length='3' type-id='7359adad' id='56f209d2'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='7359adad' id='16fc326e'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='infinite' id='048fe7bc'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <enum-decl name='spdk_bdev_event_type' id='3add6f5a'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_EVENT_REMOVE' value='0'/>
      <enumerator name='SPDK_BDEV_EVENT_RESIZE' value='1'/>
      <enumerator name='SPDK_BDEV_EVENT_MEDIA_MANAGEMENT' value='2'/>
    </enum-decl>
    <class-decl name='spdk_bdev_media_event' size-in-bits='128' is-struct='yes' visibility='default' id='66579779'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_event_cb_t' type-id='dfce451f' id='3de10a34'/>
    <enum-decl name='spdk_bdev_status' id='7f167725'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_STATUS_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_STATUS_READY' value='1'/>
      <enumerator name='SPDK_BDEV_STATUS_UNREGISTERING' value='2'/>
      <enumerator name='SPDK_BDEV_STATUS_REMOVING' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_io_type' id='9cd6c10c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_INVALID' value='0'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_READ' value='1'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE' value='2'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_UNMAP' value='3'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_FLUSH' value='4'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_RESET' value='5'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_ADMIN' value='6'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO' value='7'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_NVME_IO_MD' value='8'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_WRITE_ZEROES' value='9'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZCOPY' value='10'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_GET_ZONE_INFO' value='11'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_MANAGEMENT' value='12'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ZONE_APPEND' value='13'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE' value='14'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_COMPARE_AND_WRITE' value='15'/>
      <enumerator name='SPDK_BDEV_IO_TYPE_ABORT' value='16'/>
      <enumerator name='SPDK_BDEV_NUM_IO_TYPES' value='17'/>
    </enum-decl>
    <enum-decl name='spdk_bdev_qos_rate_limit_type' id='3270d5b4'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_QOS_RW_IOPS_RATE_LIMIT' value='0'/>
      <enumerator name='SPDK_BDEV_QOS_RW_BPS_RATE_LIMIT' value='1'/>
      <enumerator name='SPDK_BDEV_QOS_R_BPS_RATE_LIMIT' value='2'/>
      <enumerator name='SPDK_BDEV_QOS_W_BPS_RATE_LIMIT' value='3'/>
      <enumerator name='SPDK_BDEV_QOS_NUM_RATE_LIMIT_TYPES' value='4'/>
    </enum-decl>
    <typedef-decl name='spdk_bdev_io_completion_cb' type-id='0818f3c5' id='a720f07e'/>
    <class-decl name='spdk_bdev_io_stat' size-in-bits='640' is-struct='yes' visibility='default' id='21c89d01'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bytes_read' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_read_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='bytes_written' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='num_write_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='bytes_unmapped' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_unmap_ops' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='read_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='write_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unmap_latency_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ticks_rate' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_opts' size-in-bits='256' is-struct='yes' visibility='default' id='60908454'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev_io_pool_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bdev_io_cache_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev_auto_examine' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='opts_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='small_buf_pool_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='large_buf_pool_size' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_ext_io_opts' size-in-bits='256' is-struct='yes' visibility='default' id='b07aafe1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='memory_domain' type-id='e5ecc906' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='memory_domain_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='metadata' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_wait_for_examine_cb' type-id='b7f9d8e6' id='0cadf036'/>
    <typedef-decl name='spdk_bdev_init_cb' type-id='1ed1e4cd' id='549b7513'/>
    <typedef-decl name='spdk_bdev_fini_cb' type-id='b7f9d8e6' id='c0b39e85'/>
    <typedef-decl name='spdk_bdev_get_device_stat_cb' type-id='a82436b9' id='75d8d625'/>
    <typedef-decl name='spdk_bdev_io_timeout_cb' type-id='8a3a2bff' id='85d4a35d'/>
    <typedef-decl name='spdk_for_each_bdev_fn' type-id='dcd53af5' id='8e1b2c43'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' id='065af103'/>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__54' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_histogram_status_cb' type-id='1ed1e4cd' id='7598a612'/>
    <typedef-decl name='spdk_bdev_histogram_data_cb' type-id='cbfe2c2f' id='fb45a108'/>
    <class-decl name='spdk_bdev_module' size-in-bits='832' is-struct='yes' visibility='default' id='3384ef92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='init_complete' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fini_start' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='module_fini' type-id='953b12f8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='config_json' type-id='eb9d423e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_ctx_size' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='examine_config' type-id='f1f36be0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='examine_disk' type-id='f1f36be0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='async_init' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='584'>
        <var-decl name='async_fini' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='async_fini_start' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='internal' type-id='d8b852eb' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_module_internal_fields' size-in-bits='192' is-struct='yes' visibility='default' id='d8b852eb'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='action_in_progress' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='68341ede' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_unregister_cb' type-id='1ed1e4cd' id='10afdbb3'/>
    <class-decl name='spdk_bdev_fn_table' size-in-bits='576' is-struct='yes' visibility='default' id='bcf92cc1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='destruct' type-id='b9b212f5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='submit_request' type-id='ce046974' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='io_type_supported' type-id='dd06e335' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_io_channel' type-id='ddc2673d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dump_info_json' type-id='4184f7d2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_config_json' type-id='e4c0e0eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='get_spin_time' type-id='9429a36d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_module_ctx' type-id='5ad9edb6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='get_memory_domains' type-id='19c4f5a3' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='spdk_bdev_io_status' id='11906e0e'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_AIO_ERROR' value='-8'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_ABORTED' value='-7'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FIRST_FUSED_FAILED' value='-6'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_MISCOMPARE' value='-5'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NOMEM' value='-4'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SCSI_ERROR' value='-3'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_NVME_ERROR' value='-2'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_FAILED' value='-1'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_PENDING' value='0'/>
      <enumerator name='SPDK_BDEV_IO_STATUS_SUCCESS' value='1'/>
    </enum-decl>
    <class-decl name='spdk_bdev_name' size-in-bits='320' is-struct='yes' visibility='default' id='5baf3205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='b0e2c7a5' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_alias' size-in-bits='448' is-struct='yes' visibility='default' id='5b4f6d22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='alias' type-id='5baf3205' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='6e513b50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='23e0a10e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='bdev_io_tailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='676e6b2f' visibility='default' id='a79da5e0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='ab7fe902' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bdev_io_tailq_t' type-id='a79da5e0' id='676e6b2f'/>
    <class-decl name='bdev_io_stailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='24ac0566' visibility='default' id='01a797bf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqh_first' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stqh_last' type-id='ab7fe902' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='bdev_io_stailq_t' type-id='01a797bf' id='24ac0566'/>
    <class-decl name='lba_range_tailq_t' size-in-bits='128' is-struct='yes' naming-typedef-id='905ae936' visibility='default' id='088b1745'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='65b579a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='a8ae5764' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='lba_range_tailq_t' type-id='088b1745' id='905ae936'/>
    <class-decl name='spdk_bdev' size-in-bits='4160' is-struct='yes' visibility='default' id='f6507fdd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ctxt' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='aliases' type-id='ad35c6ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='product_name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='write_cache' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='phys_blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='write_unit_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='acwu' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='required_alignment' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='568'>
        <var-decl name='split_on_optimal_io_boundary' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='optimal_io_boundary' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='max_segment_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='max_num_segments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='max_unmap' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='max_unmap_segments' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='max_write_zeroes' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='md_len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='dif_type' type-id='388e2dcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='dif_is_head_of_md' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dif_check_flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='zoned' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='zone_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='max_zone_append_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1184'>
        <var-decl name='max_open_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='max_active_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1248'>
        <var-decl name='optimal_open_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='media_events' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='module' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='fn_table' type-id='9750090a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='internal' type-id='0dc6d312' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_aliases_list' size-in-bits='128' is-struct='yes' visibility='default' id='ad35c6ef'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='6e513b50' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='23e0a10e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_internal_fields' size-in-bits='2688' is-struct='yes' visibility='default' id='0dc6d312'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qos' type-id='c0bd1bdf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='qos_mod_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='status' type-id='7f167725' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='claim_module' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='unregister_cb' type-id='10afdbb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='unregister_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='open_descs' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='link' type-id='e7f43f77' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='reset_in_progress' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='qd_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='period' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='temporary_queue_depth' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='measured_queue_depth' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='io_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='weighted_io_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='stat' type-id='21c89d01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='histogram_enabled' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='histogram_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='locked_ranges' type-id='905ae936' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='pending_locked_ranges' type-id='905ae936' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='bdev_name' type-id='5baf3205' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__67' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='3ecde4cf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__68' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7cbf4535' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_bdev_io_get_buf_cb' type-id='adc98f44' id='cb1f5f5e'/>
    <typedef-decl name='spdk_bdev_io_get_aux_buf_cb' type-id='47423596' id='030e7a71'/>
    <class-decl name='spdk_bdev_io' size-in-bits='7616' is-struct='yes' visibility='default' id='68ee9836'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='num_retries' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='child_iov' type-id='d0b1608e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4352'>
        <var-decl name='u' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5184'>
        <var-decl name='module_link' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5312'>
        <var-decl name='internal' type-id='e7a9259f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7616'>
        <var-decl name='driver_ctx' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='832' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='bdev' type-id='e7f43f79' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='reset' type-id='e7f43f7a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43f7b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='nvme_passthru' type-id='e7f43f7c' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='zone_mgmt' type-id='e7f43f7d' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='832' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f79'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fused_iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fused_iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ext_opts' type-id='faf6ec89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stored_user_cb' type-id='a720f07e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='split_remaining_num_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='split_current_offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='split_outstanding' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='zcopy' type-id='e7f43f7e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='abort' type-id='e7f43f7f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='populate' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='commit' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='start' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch_ref' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bio_to_abort' type-id='378e9c1c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='768' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cmd' type-id='a0e8c12d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nbytes' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='md_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='md_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__50' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f7d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='num_zones' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='zone_action' type-id='85264f60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__51' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='378e9c1c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='ab7fe902' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__bdev_io_internal_fields' size-in-bits='2304' is-struct='yes' visibility='default' id='e7a9259f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_submit_ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='cb' type-id='a720f07e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='caller_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='submit_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='error' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='in_submit_request' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='456'>
        <var-decl name='status' type-id='ee31ee44' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='buf_len' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='bounce_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='bounce_md_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='orig_md_iov' type-id='0f042891' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='orig_iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='orig_iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='get_aux_buf_cb' type-id='030e7a71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='get_buf_cb' type-id='cb1f5f5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='link' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='buf_link' type-id='e7f43f80' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='ch_link' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='waitq_entry' type-id='56e41d71' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='ext_opts' type-id='faf6ec89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='ext_opts_copy' type-id='b07aafe1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='data_transfer_cpl' type-id='1ed1e4cd' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__6' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='nvme' type-id='e7f43f81' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scsi' type-id='e7f43f82' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='aio_result' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__62' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cdw0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='sct' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='sc' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__63' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sk' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='asc' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='ascq' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__65' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='stqe_next' type-id='378e9c1c' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='spdk_bdev_zone_action' id='85264f60'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_CLOSE' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_FINISH' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_OPEN' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_RESET' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_OFFLINE' value='4'/>
    </enum-decl>
    <enum-decl name='spdk_dif_type' id='388e2dcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_DISABLE' value='0'/>
      <enumerator name='SPDK_DIF_TYPE1' value='1'/>
      <enumerator name='SPDK_DIF_TYPE2' value='2'/>
      <enumerator name='SPDK_DIF_TYPE3' value='3'/>
    </enum-decl>
    <enum-decl name='spdk_dif_check_type' id='91a2c9e2'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_REFTAG' value='1'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_APPTAG' value='2'/>
      <enumerator name='SPDK_DIF_CHECK_TYPE_GUARD' value='3'/>
    </enum-decl>
    <class-decl name='spdk_histogram_data' size-in-bits='128' is-struct='yes' visibility='default' id='9e5a028f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bucket_shift' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bucket' type-id='5d6479ae' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_sgl_descriptor' size-in-bits='128' is-struct='yes' visibility='default' id='7e1641d1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='generic' type-id='e7f43f83' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='unkeyed' type-id='e7f43f84' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='keyed' type-id='e7f43f85' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='d3490169' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='key' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='56'>
        <var-decl name='subtype' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='60'>
        <var-decl name='type' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_arbitration' size-in-bits='32' visibility='default' id='9f1a58c0'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f86' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__33' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ab' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='mpw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='hpw' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_power_management' size-in-bits='32' visibility='default' id='64feb306'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f87' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__34' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ps' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='wh' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_lba_range_type' size-in-bits='32' visibility='default' id='4d6b2a7f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f88' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__35' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_temperature_threshold' size-in-bits='32' visibility='default' id='e946a617'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f89' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__36' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tmpth' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='tmpsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='20'>
        <var-decl name='thsel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='22'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_error_recovery' size-in-bits='32' visibility='default' id='af85b2af'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8a' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__37' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tler' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dulbe' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_volatile_write_cache' size-in-bits='32' visibility='default' id='c6a65caa'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8b' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__38' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='wce' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_number_of_queues' size-in-bits='32' visibility='default' id='59e17753'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8c' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__39' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nsqr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='ncqr' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_interrupt_coalescing' size-in-bits='32' visibility='default' id='4694c65f'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8d' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__40' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='time' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_interrupt_vector_configuration' size-in-bits='32' visibility='default' id='505edc3d'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8e' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__41' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cd' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_write_atomicity' size-in-bits='32' visibility='default' id='ccc4bc8a'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f8f' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__42' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f8f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dn' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_critical_warning_state' size-in-bits='8' visibility='default' id='186e44ae'>
      <data-member access='public'>
        <var-decl name='raw' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f90' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__44' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='available_spare' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='temperature' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='device_reliability' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='read_only' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='volatile_memory_backup' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5'>
        <var-decl name='reserved' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_async_event_configuration' size-in-bits='32' visibility='default' id='8a1225db'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f91' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__43' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='crit_warn' type-id='186e44ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='ns_attr_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9'>
        <var-decl name='fw_activation_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='telemetry_log_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='ana_change_notice' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved1' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='discovery_log_change_notice' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_keep_alive_timer' size-in-bits='32' visibility='default' id='47966266'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f92' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__45' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='kato' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_host_identifier' size-in-bits='32' visibility='default' id='46a6ccf9'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f93' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__46' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='exhid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_reservation_notification_mask' size-in-bits='32' visibility='default' id='07297148'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f94' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__47' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='regpre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='resrel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='respre' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_feat_reservation_persistence' size-in-bits='32' visibility='default' id='885540cf'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='bits' type-id='e7f43f95' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__48' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_cmd_cdw10' size-in-bits='32' visibility='default' id='9383a150'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43f96' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43f97' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='abort' type-id='e7f43f98' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sec_send_recv' type-id='e7f43f99' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_q' type-id='e7f43f9a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='delete_io_q' type-id='e7f43f9b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_features' type-id='e7f43f9c' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='set_features' type-id='e7f43f9d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_attach' type-id='e7f43f9e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='ns_manage' type-id='e7f43f9e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43f9f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_register' type-id='e7f43fa0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_release' type-id='e7f43fa1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_acquire' type-id='e7f43fa2' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cns' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cntid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='lsp' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='12'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15'>
        <var-decl name='rae' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='numdl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sqid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nssf' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='spsp0' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='spsp1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='secp' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='qsize' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='qid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='11'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <var-decl name='sv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sel' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f9f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrega' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='30'>
        <var-decl name='cptpl' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rrela' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='racqa' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='iekey' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4'>
        <var-decl name='reserved1' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='rtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved2' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='spdk_nvme_cmd_cdw11' size-in-bits='32' visibility='default' id='9483a2e3'>
      <data-member access='public'>
        <var-decl name='raw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='identify' type-id='e7f43fa3' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_sq' type-id='e7f43fa4' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='create_io_cq' type-id='e7f43fa5' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='directive' type-id='e7f43fa6' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='get_log_page' type-id='e7f43fa7' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='resv_report' type-id='e7f43fa8' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_arbitration' type-id='9f1a58c0' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_power_management' type-id='64feb306' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_lba_range_type' type-id='4d6b2a7f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_temp_threshold' type-id='e946a617' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_error_recovery' type-id='af85b2af' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_volatile_write_cache' type-id='c6a65caa' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_num_of_queues' type-id='59e17753' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_coalescing' type-id='4694c65f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_interrupt_vector_configuration' type-id='505edc3d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_write_atomicity' type-id='ccc4bc8a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_async_event_cfg' type-id='8a1225db' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_keep_alive_timer' type-id='47966266' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_host_identifier' type-id='46a6ccf9' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_notification_mask' type-id='07297148' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='feat_rsv_persistence' type-id='885540cf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dsm' type-id='e7f43fa9' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvmsetid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='csi' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='qprio' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cqid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='ien' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='iv' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doper' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='dtype' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='dspec' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__31' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='numdu' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='lsid' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__32' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='eds' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__49' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fa9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='idr' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='idw' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='ad' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_nvme_cmd' size-in-bits='512' is-struct='yes' visibility='default' id='a0e8c12d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='opc' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='fuse' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10'>
        <var-decl name='rsvd1' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='14'>
        <var-decl name='psdt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='cid' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nsid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rsvd2' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='rsvd3' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mptr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dptr' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='' type-id='ac5ab59a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cdw12' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='cdw13' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='cdw14' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='cdw15' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='prp' type-id='e7f43faa' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sgl1' type-id='7e1641d1' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faa'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prp1' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prp2' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='cdw10' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw10_bits' type-id='9383a150' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__5' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab59a'>
      <data-member access='public'>
        <var-decl name='cdw11' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='cdw11_bits' type-id='9483a2e3' visibility='default'/>
      </data-member>
    </union-decl>
    <enum-decl name='spdk_scsi_status' id='aabad29c'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_STATUS_GOOD' value='0'/>
      <enumerator name='SPDK_SCSI_STATUS_CHECK_CONDITION' value='2'/>
      <enumerator name='SPDK_SCSI_STATUS_CONDITION_MET' value='4'/>
      <enumerator name='SPDK_SCSI_STATUS_BUSY' value='8'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE' value='16'/>
      <enumerator name='SPDK_SCSI_STATUS_INTERMEDIATE_CONDITION_MET' value='20'/>
      <enumerator name='SPDK_SCSI_STATUS_RESERVATION_CONFLICT' value='24'/>
      <enumerator name='SPDK_SCSI_STATUS_Obsolete' value='34'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_SET_FULL' value='40'/>
      <enumerator name='SPDK_SCSI_STATUS_ACA_ACTIVE' value='48'/>
      <enumerator name='SPDK_SCSI_STATUS_TASK_ABORTED' value='64'/>
    </enum-decl>
    <enum-decl name='spdk_scsi_sense' id='00418730'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_SCSI_SENSE_NO_SENSE' value='0'/>
      <enumerator name='SPDK_SCSI_SENSE_RECOVERED_ERROR' value='1'/>
      <enumerator name='SPDK_SCSI_SENSE_NOT_READY' value='2'/>
      <enumerator name='SPDK_SCSI_SENSE_MEDIUM_ERROR' value='3'/>
      <enumerator name='SPDK_SCSI_SENSE_HARDWARE_ERROR' value='4'/>
      <enumerator name='SPDK_SCSI_SENSE_ILLEGAL_REQUEST' value='5'/>
      <enumerator name='SPDK_SCSI_SENSE_UNIT_ATTENTION' value='6'/>
      <enumerator name='SPDK_SCSI_SENSE_DATA_PROTECT' value='7'/>
      <enumerator name='SPDK_SCSI_SENSE_BLANK_CHECK' value='8'/>
      <enumerator name='SPDK_SCSI_SENSE_VENDOR_SPECIFIC' value='9'/>
      <enumerator name='SPDK_SCSI_SENSE_COPY_ABORTED' value='10'/>
      <enumerator name='SPDK_SCSI_SENSE_ABORTED_COMMAND' value='11'/>
      <enumerator name='SPDK_SCSI_SENSE_VOLUME_OVERFLOW' value='13'/>
      <enumerator name='SPDK_SCSI_SENSE_MISCOMPARE' value='14'/>
    </enum-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab59b' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab59b'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='lba_range' size-in-bits='384' is-struct='yes' visibility='default' id='55c06e10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='locked_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='owner_ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43fab' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fab'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='65b579a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='a8ae5764' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_qos_limit' size-in-bits='320' is-struct='yes' visibility='default' id='10d33c5b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='limit' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='remaining_this_timeslice' type-id='9da381c4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='min_per_timeslice' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='max_per_timeslice' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='queue_io' type-id='10a19ea6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='update_quota' type-id='2a39cd93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_qos' size-in-bits='1728' is-struct='yes' visibility='default' id='eb57c427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rate_limits' type-id='a122b85b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='ch' type-id='63c91ce9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='queued' type-id='676e6b2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='timeslice_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='last_timeslice' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='poller' type-id='bf13de54' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_mgmt_channel' size-in-bits='704' is-struct='yes' visibility='default' id='58cfb15f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='need_buf_small' type-id='24ac0566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='need_buf_large' type-id='24ac0566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='per_thread_cache' type-id='24ac0566' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='per_thread_cache_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='bdev_io_cache_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='shared_resources' type-id='e7f43fac' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='io_wait_queue' type-id='e7f43fad' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__52' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fac'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='7d9a2586' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='65a94dc4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__53' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fad'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='2c737c29' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='fccc38b9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_shared_resource' size-in-bits='576' is-struct='yes' visibility='default' id='dc1938c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mgmt_ch' type-id='b3a3b0a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_outstanding' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nomem_io' type-id='676e6b2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nomem_threshold' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='shared_ch' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='link' type-id='e7f43fae' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__55' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fae'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='7d9a2586' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='65a94dc4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_channel' size-in-bits='1536' is-struct='yes' visibility='default' id='b8a34da1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='shared_resource' type-id='7d9a2586' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='stat' type-id='21c89d01' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='io_outstanding' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='io_submitted' type-id='676e6b2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='io_locked' type-id='676e6b2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='histogram' type-id='72176057' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='queued_resets' type-id='676e6b2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='locked_ranges' type-id='905ae936' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='media_event_entry' size-in-bits='256' is-struct='yes' visibility='default' id='786b8f0f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event' type-id='66579779' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tailq' type-id='e7f43faf' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__59' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43faf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='ecb2ec17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='daa9e407' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_desc' size-in-bits='1408' is-struct='yes' visibility='default' id='43454627'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='callback' type-id='e7f43fb0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='write' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='memory_domains_supported' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='refs' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='pending_media_events' type-id='e7f43fb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='free_media_events' type-id='e7f43fb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='media_events_buffer' type-id='ecb2ec17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='link' type-id='e7f43fb2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='timeout_in_sec' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='cb_fn' type-id='85d4a35d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='io_timeout_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__57' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='event_fn' type-id='3de10a34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__58' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb1'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='ecb2ec17' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='daa9e407' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__61' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='3ecde4cf' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='int8_t' type-id='2171a512' id='ee31ee44'/>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__int8_t' type-id='28577a57' id='2171a512'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__int64_t' type-id='bd54fe1a' id='0c9942d2'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='8d213c54' size-in-bits='64' id='10a19ea6'/>
    <pointer-type-def type-id='083b2f99' size-in-bits='64' id='dd06e335'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='f6507fdd' const='yes' id='778a632a'/>
    <pointer-type-def type-id='778a632a' size-in-bits='64' id='2ed9d900'/>
    <qualified-type-def type-id='ad35c6ef' const='yes' id='fc18994a'/>
    <pointer-type-def type-id='fc18994a' size-in-bits='64' id='3ab97220'/>
    <qualified-type-def type-id='bcf92cc1' const='yes' id='73f42124'/>
    <pointer-type-def type-id='73f42124' size-in-bits='64' id='9750090a'/>
    <qualified-type-def type-id='68ee9836' const='yes' id='0f6d3567'/>
    <pointer-type-def type-id='0f6d3567' size-in-bits='64' id='95eae837'/>
    <qualified-type-def type-id='66579779' const='yes' id='a9077006'/>
    <pointer-type-def type-id='a9077006' size-in-bits='64' id='42b59544'/>
    <qualified-type-def type-id='10d33c5b' const='yes' id='00c74b30'/>
    <pointer-type-def type-id='00c74b30' size-in-bits='64' id='53bb39ee'/>
    <qualified-type-def type-id='a0e8c12d' const='yes' id='9fe70d7e'/>
    <pointer-type-def type-id='9fe70d7e' size-in-bits='64' id='0cb9fb3c'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='276427e1' size-in-bits='64' id='1db260e5'/>
    <pointer-type-def type-id='ad11f404' size-in-bits='64' id='eb9d423e'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='35697d21' size-in-bits='64' id='dcd53af5'/>
    <pointer-type-def type-id='bbbd7ee8' size-in-bits='64' id='4184f7d2'/>
    <pointer-type-def type-id='4c7d72bf' size-in-bits='64' id='19c4f5a3'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='cc4b1be9' size-in-bits='64' id='5d3cb3f9'/>
    <pointer-type-def type-id='55c06e10' size-in-bits='64' id='65b579a6'/>
    <pointer-type-def type-id='65b579a6' size-in-bits='64' id='a8ae5764'/>
    <pointer-type-def type-id='786b8f0f' size-in-bits='64' id='ecb2ec17'/>
    <pointer-type-def type-id='ecb2ec17' size-in-bits='64' id='daa9e407'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7b7cfb3d' size-in-bits='64' id='7cbf4535'/>
    <pointer-type-def type-id='5b4f6d22' size-in-bits='64' id='6e513b50'/>
    <pointer-type-def type-id='6e513b50' size-in-bits='64' id='23e0a10e'/>
    <pointer-type-def type-id='b8a34da1' size-in-bits='64' id='63c91ce9'/>
    <pointer-type-def type-id='43454627' size-in-bits='64' id='0094857f'/>
    <pointer-type-def type-id='0094857f' size-in-bits='64' id='3ecde4cf'/>
    <pointer-type-def type-id='b07aafe1' size-in-bits='64' id='faf6ec89'/>
    <pointer-type-def type-id='68ee9836' size-in-bits='64' id='378e9c1c'/>
    <pointer-type-def type-id='378e9c1c' size-in-bits='64' id='ab7fe902'/>
    <pointer-type-def type-id='21c89d01' size-in-bits='64' id='08cc63f9'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='66579779' size-in-bits='64' id='5ed322e1'/>
    <pointer-type-def type-id='58cfb15f' size-in-bits='64' id='b3a3b0a7'/>
    <pointer-type-def type-id='3384ef92' size-in-bits='64' id='b509a840'/>
    <pointer-type-def type-id='b509a840' size-in-bits='64' id='68341ede'/>
    <pointer-type-def type-id='5baf3205' size-in-bits='64' id='b0e2c7a5'/>
    <pointer-type-def type-id='60908454' size-in-bits='64' id='f495ac72'/>
    <pointer-type-def type-id='eb57c427' size-in-bits='64' id='c0bd1bdf'/>
    <pointer-type-def type-id='10d33c5b' size-in-bits='64' id='6e54d3fb'/>
    <pointer-type-def type-id='dc1938c0' size-in-bits='64' id='7d9a2586'/>
    <pointer-type-def type-id='7d9a2586' size-in-bits='64' id='65a94dc4'/>
    <pointer-type-def type-id='9e5a028f' size-in-bits='64' id='72176057'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='ff41ade1' size-in-bits='64' id='ddc2673d'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='3e1ba880' size-in-bits='64' id='e5ecc906'/>
    <pointer-type-def type-id='e5ecc906' size-in-bits='64' id='1fc0b044'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='398c9a31' size-in-bits='64' id='9429a36d'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='e46f9253' size-in-bits='64' id='dfce451f'/>
    <pointer-type-def type-id='ce3367a6' size-in-bits='64' id='f1f36be0'/>
    <pointer-type-def type-id='0ea372f5' size-in-bits='64' id='a82436b9'/>
    <pointer-type-def type-id='8e4c24e7' size-in-bits='64' id='e4c0e0eb'/>
    <pointer-type-def type-id='8e4e1999' size-in-bits='64' id='0818f3c5'/>
    <pointer-type-def type-id='e6b8983f' size-in-bits='64' id='2a39cd93'/>
    <pointer-type-def type-id='6e648722' size-in-bits='64' id='ce046974'/>
    <pointer-type-def type-id='340a4f32' size-in-bits='64' id='adc98f44'/>
    <pointer-type-def type-id='6f151b7c' size-in-bits='64' id='47423596'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='1b3c02f3' size-in-bits='64' id='cbfe2c2f'/>
    <pointer-type-def type-id='44b9313b' size-in-bits='64' id='8a3a2bff'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='cd5d79f4' size-in-bits='64' id='5ad9edb6'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_memory_domain' is-struct='yes' visibility='default' is-declaration-only='yes' id='3e1ba880'/>
    <class-decl name='spdk_poller' is-struct='yes' visibility='default' is-declaration-only='yes' id='8921c3fe'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <function-decl name='spdk_bdev_get_opts' mangled-name='spdk_bdev_get_opts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_opts'>
      <parameter type-id='f495ac72' name='opts'/>
      <parameter type-id='b59d7dce' name='opts_size'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_opts' mangled-name='spdk_bdev_set_opts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_opts'>
      <parameter type-id='f495ac72' name='opts'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_by_name' mangled-name='spdk_bdev_get_by_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_by_name'>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_wait_for_examine' mangled-name='spdk_bdev_wait_for_examine' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_wait_for_examine'>
      <parameter type-id='0cadf036' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_examine' mangled-name='spdk_bdev_examine' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_examine'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_first' mangled-name='spdk_bdev_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next' mangled-name='spdk_bdev_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next'>
      <parameter type-id='7b7cfb3d' name='prev'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_first_leaf' mangled-name='spdk_bdev_first_leaf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_first_leaf'>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_next_leaf' mangled-name='spdk_bdev_next_leaf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_next_leaf'>
      <parameter type-id='7b7cfb3d' name='prev'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_buf' mangled-name='spdk_bdev_io_set_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_set_md_buf' mangled-name='spdk_bdev_io_set_md_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_set_md_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_put_aux_buf' mangled-name='spdk_bdev_io_put_aux_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_put_aux_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_buf' mangled-name='spdk_bdev_io_get_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='cb1f5f5e' name='cb'/>
      <parameter type-id='9c313c2d' name='len'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aux_buf' mangled-name='spdk_bdev_io_get_aux_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aux_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='030e7a71' name='cb'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_subsystem_config_json' mangled-name='spdk_bdev_subsystem_config_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_subsystem_config_json'>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_init_done' mangled-name='spdk_bdev_module_init_done' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_init_done'>
      <parameter type-id='b509a840' name='module'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_examine_done' mangled-name='spdk_bdev_module_examine_done' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_examine_done'>
      <parameter type-id='b509a840' name='module'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_initialize' mangled-name='spdk_bdev_initialize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_initialize'>
      <parameter type-id='549b7513' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_done' mangled-name='spdk_bdev_module_fini_done' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_done'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_fini_start_done' mangled-name='spdk_bdev_module_fini_start_done' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_fini_start_done'>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_finish' mangled-name='spdk_bdev_finish' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_finish'>
      <parameter type-id='c0b39e85' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_free_io' mangled-name='spdk_bdev_free_io' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_free_io'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_type_supported' mangled-name='spdk_bdev_io_type_supported' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_type_supported'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='9cd6c10c' name='io_type'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_dump_info_json' mangled-name='spdk_bdev_dump_info_json' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_dump_info_json'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_timeout' mangled-name='spdk_bdev_set_timeout' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_timeout'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='9c313c2d' name='timeout_in_sec'/>
      <parameter type-id='85d4a35d' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_add' mangled-name='spdk_bdev_alias_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_add'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='80f4b756' name='alias'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del' mangled-name='spdk_bdev_alias_del' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='80f4b756' name='alias'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_alias_del_all' mangled-name='spdk_bdev_alias_del_all' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_alias_del_all'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_channel' mangled-name='spdk_bdev_get_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_channel'>
      <parameter type-id='0094857f' name='desc'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_ctx' mangled-name='spdk_bdev_get_module_ctx' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_ctx'>
      <parameter type-id='0094857f' name='desc'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_module_name' mangled-name='spdk_bdev_get_module_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_module_name'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_name' mangled-name='spdk_bdev_get_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_name'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_product_name' mangled-name='spdk_bdev_get_product_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_product_name'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_aliases' mangled-name='spdk_bdev_get_aliases' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_aliases'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='3ab97220'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_block_size' mangled-name='spdk_bdev_get_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_block_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_write_unit_size' mangled-name='spdk_bdev_get_write_unit_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_write_unit_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_num_blocks' mangled-name='spdk_bdev_get_num_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_num_blocks'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rpc_type' mangled-name='spdk_bdev_get_qos_rpc_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rpc_type'>
      <parameter type-id='3270d5b4' name='type'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qos_rate_limits' mangled-name='spdk_bdev_get_qos_rate_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qos_rate_limits'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='5d6479ae' name='limits'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_buf_align' mangled-name='spdk_bdev_get_buf_align' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_buf_align'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_optimal_io_boundary' mangled-name='spdk_bdev_get_optimal_io_boundary' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_optimal_io_boundary'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_has_write_cache' mangled-name='spdk_bdev_has_write_cache' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_has_write_cache'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_uuid' mangled-name='spdk_bdev_get_uuid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_uuid'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_acwu' mangled-name='spdk_bdev_get_acwu' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_acwu'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_md_size' mangled-name='spdk_bdev_get_md_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_md_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_interleaved' mangled-name='spdk_bdev_is_md_interleaved' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_interleaved'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_md_separate' mangled-name='spdk_bdev_is_md_separate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_md_separate'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_zoned' mangled-name='spdk_bdev_is_zoned' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_zoned'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_data_block_size' mangled-name='spdk_bdev_get_data_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_data_block_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_physical_block_size' mangled-name='spdk_bdev_get_physical_block_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_physical_block_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_dif_type' mangled-name='spdk_bdev_get_dif_type' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_dif_type'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='388e2dcf'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_head_of_md' mangled-name='spdk_bdev_is_dif_head_of_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_head_of_md'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_is_dif_check_enabled' mangled-name='spdk_bdev_is_dif_check_enabled' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_is_dif_check_enabled'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <parameter type-id='91a2c9e2' name='check_type'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd' mangled-name='spdk_bdev_get_qd' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_qd_sampling_period' mangled-name='spdk_bdev_get_qd_sampling_period' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_qd_sampling_period'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_weighted_io_time' mangled-name='spdk_bdev_get_weighted_io_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_weighted_io_time'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_time' mangled-name='spdk_bdev_get_io_time' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_time'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_qd_sampling_period' mangled-name='spdk_bdev_set_qd_sampling_period' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_qd_sampling_period'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='9c313c2d' name='period'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_notify_blockcnt_change' mangled-name='spdk_bdev_notify_blockcnt_change' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_notify_blockcnt_change'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='9c313c2d' name='size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read' mangled-name='spdk_bdev_read' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks' mangled-name='spdk_bdev_read_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_read_blocks_with_md' mangled-name='spdk_bdev_read_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_read_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv' mangled-name='spdk_bdev_readv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks' mangled-name='spdk_bdev_readv_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_with_md' mangled-name='spdk_bdev_readv_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_readv_blocks_ext' mangled-name='spdk_bdev_readv_blocks_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_readv_blocks_ext'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <parameter type-id='faf6ec89' name='opts'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write' mangled-name='spdk_bdev_write' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks' mangled-name='spdk_bdev_write_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_blocks_with_md' mangled-name='spdk_bdev_write_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev' mangled-name='spdk_bdev_writev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='len'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks' mangled-name='spdk_bdev_writev_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_with_md' mangled-name='spdk_bdev_writev_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_writev_blocks_ext' mangled-name='spdk_bdev_writev_blocks_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_writev_blocks_ext'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <parameter type-id='faf6ec89' name='opts'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks' mangled-name='spdk_bdev_comparev_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_blocks_with_md' mangled-name='spdk_bdev_comparev_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks' mangled-name='spdk_bdev_compare_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_compare_blocks_with_md' mangled-name='spdk_bdev_compare_blocks_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_compare_blocks_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_comparev_and_writev_blocks' mangled-name='spdk_bdev_comparev_and_writev_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_comparev_and_writev_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='compare_iov'/>
      <parameter type-id='95e97e5e' name='compare_iovcnt'/>
      <parameter type-id='cc4b1be9' name='write_iov'/>
      <parameter type-id='95e97e5e' name='write_iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_start' mangled-name='spdk_bdev_zcopy_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_start'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='c894953d' name='populate'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zcopy_end' mangled-name='spdk_bdev_zcopy_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zcopy_end'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='c894953d' name='commit'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes' mangled-name='spdk_bdev_write_zeroes' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='len'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_write_zeroes_blocks' mangled-name='spdk_bdev_write_zeroes_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_write_zeroes_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap' mangled-name='spdk_bdev_unmap' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_unmap_blocks' mangled-name='spdk_bdev_unmap_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unmap_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush' mangled-name='spdk_bdev_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='length'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_flush_blocks' mangled-name='spdk_bdev_flush_blocks' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_flush_blocks'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_reset' mangled-name='spdk_bdev_reset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_reset'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_io_stat' mangled-name='spdk_bdev_get_io_stat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_io_stat'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='08cc63f9' name='stat'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_device_stat' mangled-name='spdk_bdev_get_device_stat' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_device_stat'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='08cc63f9' name='stat'/>
      <parameter type-id='75d8d625' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_admin_passthru' mangled-name='spdk_bdev_nvme_admin_passthru' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_admin_passthru'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='0cb9fb3c' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru' mangled-name='spdk_bdev_nvme_io_passthru' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='0cb9fb3c' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='nbytes'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_nvme_io_passthru_md' mangled-name='spdk_bdev_nvme_io_passthru_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_nvme_io_passthru_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='0cb9fb3c' name='cmd'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='b59d7dce' name='nbytes'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='b59d7dce' name='md_len'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_abort' mangled-name='spdk_bdev_abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_abort'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='bio_cb_arg'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_queue_io_wait' mangled-name='spdk_bdev_queue_io_wait' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_queue_io_wait'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='2c737c29' name='entry'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete' mangled-name='spdk_bdev_io_complete' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='11906e0e' name='status'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_scsi_status' mangled-name='spdk_bdev_io_complete_scsi_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_scsi_status'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='aabad29c' name='sc'/>
      <parameter type-id='00418730' name='sk'/>
      <parameter type-id='b96825af' name='asc'/>
      <parameter type-id='b96825af' name='ascq'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_scsi_status' mangled-name='spdk_bdev_io_get_scsi_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_scsi_status'>
      <parameter type-id='95eae837' name='bdev_io'/>
      <parameter type-id='7292109c' name='sc'/>
      <parameter type-id='7292109c' name='sk'/>
      <parameter type-id='7292109c' name='asc'/>
      <parameter type-id='7292109c' name='ascq'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_aio_status' mangled-name='spdk_bdev_io_complete_aio_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_aio_status'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='95e97e5e' name='aio_result'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_aio_status' mangled-name='spdk_bdev_io_get_aio_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_aio_status'>
      <parameter type-id='95eae837' name='bdev_io'/>
      <parameter type-id='7292109c' name='aio_result'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_complete_nvme_status' mangled-name='spdk_bdev_io_complete_nvme_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_complete_nvme_status'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='8f92235e' name='cdw0'/>
      <parameter type-id='95e97e5e' name='sct'/>
      <parameter type-id='95e97e5e' name='sc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_status' mangled-name='spdk_bdev_io_get_nvme_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_status'>
      <parameter type-id='95eae837' name='bdev_io'/>
      <parameter type-id='90421557' name='cdw0'/>
      <parameter type-id='7292109c' name='sct'/>
      <parameter type-id='7292109c' name='sc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_nvme_fused_status' mangled-name='spdk_bdev_io_get_nvme_fused_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_nvme_fused_status'>
      <parameter type-id='95eae837' name='bdev_io'/>
      <parameter type-id='90421557' name='cdw0'/>
      <parameter type-id='7292109c' name='first_sct'/>
      <parameter type-id='7292109c' name='first_sc'/>
      <parameter type-id='7292109c' name='second_sct'/>
      <parameter type-id='7292109c' name='second_sc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_thread' mangled-name='spdk_bdev_io_get_thread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_thread'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_io_channel' mangled-name='spdk_bdev_io_get_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_io_channel'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_bdev_register' mangled-name='spdk_bdev_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_register'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_destruct_done' mangled-name='spdk_bdev_destruct_done' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_destruct_done'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='95e97e5e' name='bdeverrno'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister' mangled-name='spdk_bdev_unregister' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='10afdbb3' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_unregister_by_name' mangled-name='spdk_bdev_unregister_by_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_unregister_by_name'>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <parameter type-id='b509a840' name='module'/>
      <parameter type-id='10afdbb3' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_open_ext' mangled-name='spdk_bdev_open_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_open_ext'>
      <parameter type-id='80f4b756' name='bdev_name'/>
      <parameter type-id='c894953d' name='write'/>
      <parameter type-id='3de10a34' name='event_cb'/>
      <parameter type-id='eaa32e2f' name='event_ctx'/>
      <parameter type-id='3ecde4cf' name='_desc'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_close' mangled-name='spdk_bdev_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_close'>
      <parameter type-id='0094857f' name='desc'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_claim_bdev' mangled-name='spdk_bdev_module_claim_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_claim_bdev'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='b509a840' name='module'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_release_bdev' mangled-name='spdk_bdev_module_release_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_release_bdev'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_desc_get_bdev' mangled-name='spdk_bdev_desc_get_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_desc_get_bdev'>
      <parameter type-id='0094857f' name='desc'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev' mangled-name='spdk_for_each_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev'>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <parameter type-id='8e1b2c43' name='fn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_for_each_bdev_leaf' mangled-name='spdk_for_each_bdev_leaf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_for_each_bdev_leaf'>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <parameter type-id='8e1b2c43' name='fn'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_iovec' mangled-name='spdk_bdev_io_get_iovec' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_iovec'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <parameter type-id='5d3cb3f9' name='iovp'/>
      <parameter type-id='7292109c' name='iovcntp'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_md_buf' mangled-name='spdk_bdev_io_get_md_buf' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_md_buf'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_cb_arg' mangled-name='spdk_bdev_io_get_cb_arg' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_cb_arg'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_list_add' mangled-name='spdk_bdev_module_list_add' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_list_add'>
      <parameter type-id='b509a840' name='bdev_module'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_module_list_find' mangled-name='spdk_bdev_module_list_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_module_list_find'>
      <parameter type-id='80f4b756' name='name'/>
      <return type-id='b509a840'/>
    </function-decl>
    <function-decl name='spdk_bdev_set_qos_rate_limits' mangled-name='spdk_bdev_set_qos_rate_limits' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_set_qos_rate_limits'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='5d6479ae' name='limits'/>
      <parameter type-id='1ed1e4cd' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_histogram_enable' mangled-name='spdk_bdev_histogram_enable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_histogram_enable'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='7598a612' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <parameter type-id='c894953d' name='enable'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_histogram_get' mangled-name='spdk_bdev_histogram_get' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_histogram_get'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='72176057' name='histogram'/>
      <parameter type-id='fb45a108' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_media_events' mangled-name='spdk_bdev_get_media_events' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_media_events'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='5ed322e1' name='events'/>
      <parameter type-id='b59d7dce' name='max_events'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_bdev_push_media_events' mangled-name='spdk_bdev_push_media_events' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_push_media_events'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='42b59544' name='events'/>
      <parameter type-id='b59d7dce' name='num_events'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_notify_media_management' mangled-name='spdk_bdev_notify_media_management' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_notify_media_management'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_memory_domains' mangled-name='spdk_bdev_get_memory_domains' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_memory_domains'>
      <parameter type-id='7b7cfb3d' name='bdev'/>
      <parameter type-id='1fc0b044' name='domains'/>
      <parameter type-id='95e97e5e' name='array_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='8d213c54'>
      <parameter type-id='53bb39ee'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='083b2f99'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9cd6c10c'/>
      <return type-id='c894953d'/>
    </function-type>
    <function-type size-in-bits='64' id='276427e1'>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ad11f404'>
      <parameter type-id='b8e14bfe'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='9efbfb11'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='35697d21'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='bbbd7ee8'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='4c7d72bf'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='1fc0b044'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='ff41ade1'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='a7e01876'/>
    </function-type>
    <function-type size-in-bits='64' id='398c9a31'>
      <parameter type-id='a7e01876'/>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' id='ee076206'>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='e46f9253'>
      <parameter type-id='3add6f5a'/>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='ce3367a6'>
      <parameter type-id='7b7cfb3d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0ea372f5'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='08cc63f9'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='8e4c24e7'>
      <parameter type-id='7b7cfb3d'/>
      <parameter type-id='b8e14bfe'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='8e4e1999'>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='c894953d'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='e6b8983f'>
      <parameter type-id='6e54d3fb'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6e648722'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='340a4f32'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='c894953d'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6f151b7c'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='378e9c1c'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='1b3c02f3'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='72176057'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='44b9313b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='378e9c1c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cd5d79f4'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='eaa32e2f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='bdev_zone.c' language='LANG_C99'>
    <enum-decl name='spdk_bdev_zone_state' id='71661f17'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_EMPTY' value='0'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_IMP_OPEN' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_OPEN' value='1'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_FULL' value='2'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_CLOSED' value='3'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_READ_ONLY' value='4'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_OFFLINE' value='5'/>
      <enumerator name='SPDK_BDEV_ZONE_STATE_EXP_OPEN' value='6'/>
    </enum-decl>
    <class-decl name='spdk_bdev_zone_info' size-in-bits='256' is-struct='yes' visibility='default' id='2099fa15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='zone_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_pointer' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='capacity' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='state' type-id='71661f17' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='2099fa15' size-in-bits='64' id='7cdde6d5'/>
    <function-decl name='spdk_bdev_get_zone_size' mangled-name='spdk_bdev_get_zone_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_num_zones' mangled-name='spdk_bdev_get_num_zones' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_num_zones'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_zone_id' mangled-name='spdk_bdev_get_zone_id' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_id'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <parameter type-id='9c313c2d' name='offset_blocks'/>
      <return type-id='9c313c2d'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_zone_append_size' mangled-name='spdk_bdev_get_max_zone_append_size' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_zone_append_size'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_open_zones' mangled-name='spdk_bdev_get_max_open_zones' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_open_zones'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_max_active_zones' mangled-name='spdk_bdev_get_max_active_zones' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_max_active_zones'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_optimal_open_zones' mangled-name='spdk_bdev_get_optimal_open_zones' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_optimal_open_zones'>
      <parameter type-id='2ed9d900' name='bdev'/>
      <return type-id='8f92235e'/>
    </function-decl>
    <function-decl name='spdk_bdev_get_zone_info' mangled-name='spdk_bdev_get_zone_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_get_zone_info'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='zone_id'/>
      <parameter type-id='b59d7dce' name='num_zones'/>
      <parameter type-id='7cdde6d5' name='info'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_management' mangled-name='spdk_bdev_zone_management' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_management'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='9c313c2d' name='zone_id'/>
      <parameter type-id='85264f60' name='action'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_append' mangled-name='spdk_bdev_zone_append' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_append'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='9c313c2d' name='start_lba'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_append_with_md' mangled-name='spdk_bdev_zone_append_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_append_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='buf'/>
      <parameter type-id='eaa32e2f' name='md'/>
      <parameter type-id='9c313c2d' name='start_lba'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_appendv_with_md' mangled-name='spdk_bdev_zone_appendv_with_md' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_appendv_with_md'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='eaa32e2f' name='md_buf'/>
      <parameter type-id='9c313c2d' name='zone_id'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_zone_appendv' mangled-name='spdk_bdev_zone_appendv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_zone_appendv'>
      <parameter type-id='0094857f' name='desc'/>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='zone_id'/>
      <parameter type-id='9c313c2d' name='num_blocks'/>
      <parameter type-id='a720f07e' name='cb'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_io_get_append_location' mangled-name='spdk_bdev_io_get_append_location' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_io_get_append_location'>
      <parameter type-id='378e9c1c' name='bdev_io'/>
      <return type-id='9c313c2d'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='part.c' language='LANG_C99'>
    <typedef-decl name='spdk_bdev_remove_cb_t' type-id='b7f9d8e6' id='1f14c83e'/>
    <typedef-decl name='spdk_bdev_part_base_free_fn' type-id='b7f9d8e6' id='79353cea'/>
    <class-decl name='spdk_bdev_part' size-in-bits='4416' is-struct='yes' visibility='default' id='5d5897ff'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43fb3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='internal' type-id='a0706784' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43fb3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b2d359d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='7fb6a947' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='bdev_part_internal_fields' size-in-bits='4288' is-struct='yes' visibility='default' id='a0706784'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='f6507fdd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4160'>
        <var-decl name='base' type-id='948e8325' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4224'>
        <var-decl name='offset_blocks' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_part_channel' size-in-bits='128' is-struct='yes' visibility='default' id='424b838b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='part' type-id='b2d359d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='base_ch' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='bdev_part_tailq' size-in-bits='128' is-struct='yes' visibility='default' id='57aace16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='b2d359d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='7fb6a947' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_io_channel_create_cb' type-id='585e1de9' id='7c63ffcc'/>
    <typedef-decl name='spdk_io_channel_destroy_cb' type-id='debb4ee8' id='7e998c02'/>
    <class-decl name='spdk_bdev_part_base' size-in-bits='832' is-struct='yes' visibility='default' id='2c424625'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='0094857f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='channel_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='base_free_fn' type-id='79353cea' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='claimed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='module' type-id='b509a840' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='fn_table' type-id='2cac5009' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tailq' type-id='aa57e01c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ch_create_cb' type-id='7c63ffcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='ch_destroy_cb' type-id='7e998c02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='remove_cb' type-id='1f14c83e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='57aace16' size-in-bits='64' id='aa57e01c'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='bcf92cc1' size-in-bits='64' id='2cac5009'/>
    <pointer-type-def type-id='5d5897ff' size-in-bits='64' id='b2d359d7'/>
    <pointer-type-def type-id='b2d359d7' size-in-bits='64' id='7fb6a947'/>
    <pointer-type-def type-id='2c424625' size-in-bits='64' id='948e8325'/>
    <pointer-type-def type-id='948e8325' size-in-bits='64' id='eb58509d'/>
    <pointer-type-def type-id='424b838b' size-in-bits='64' id='5f7b130b'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <function-decl name='spdk_bdev_part_base_get_bdev' mangled-name='spdk_bdev_part_base_get_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_bdev'>
      <parameter type-id='948e8325' name='part_base'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_desc' mangled-name='spdk_bdev_part_base_get_desc' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_desc'>
      <parameter type-id='948e8325' name='part_base'/>
      <return type-id='0094857f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_tailq' mangled-name='spdk_bdev_part_base_get_tailq' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_tailq'>
      <parameter type-id='948e8325' name='part_base'/>
      <return type-id='aa57e01c'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_ctx' mangled-name='spdk_bdev_part_base_get_ctx' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_ctx'>
      <parameter type-id='948e8325' name='part_base'/>
      <return type-id='eaa32e2f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_get_bdev_name' mangled-name='spdk_bdev_part_base_get_bdev_name' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_get_bdev_name'>
      <parameter type-id='948e8325' name='part_base'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_free' mangled-name='spdk_bdev_part_base_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_free'>
      <parameter type-id='948e8325' name='base'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_free' mangled-name='spdk_bdev_part_free' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_free'>
      <parameter type-id='b2d359d7' name='part'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_base_hotremove' mangled-name='spdk_bdev_part_base_hotremove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_base_hotremove'>
      <parameter type-id='948e8325' name='part_base'/>
      <parameter type-id='aa57e01c' name='tailq'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_get_bdev' mangled-name='spdk_bdev_part_get_bdev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_get_bdev'>
      <parameter type-id='b2d359d7' name='part'/>
      <return type-id='7b7cfb3d'/>
    </function-decl>
    <function-decl name='spdk_bdev_part_get_base' mangled-name='spdk_bdev_part_get_base' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_bdev_part_get_base'>
      <parameter type-id='b2d359d7' name='part'/>
      <return type-id='948e8325'/>
    </function-decl>
