<abi-corpus version='2.0' soname='libspdk_accel.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libspdk_util.so.5.0'/>
    <dependency name='libspdk_thread.so.7.0'/>
    <dependency name='libspdk_json.so.4.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_accel_engine_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_engine_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_engine_initialize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_engine_module_finish' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_engine_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_module_list_add' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compare' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_compress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_copy_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32c' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_crc32cv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_decompress' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_dualcast' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_submit_fill' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_task_complete' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_accel_write_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='accel_engine.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <array-type-def dimensions='1' type-id='a7e01876' size-in-bits='512' id='31383d20'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='16384' id='11c598cc'>
      <subrange length='1024' type-id='7359adad' id='c60446f8'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='20224' id='2758a92e'>
      <subrange length='1264' type-id='7359adad' id='6c711092'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='4112' id='c5093f6b'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='480' id='51819310'>
      <subrange length='30' type-id='7359adad' id='6a6183a4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='1280' id='28afca19'>
      <subrange length='80' type-id='7359adad' id='b4129fbd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='149c6638' size-in-bits='131072' id='e4115699'>
      <subrange length='8192' type-id='7359adad' id='c88f397d'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='8192' id='162aff9c'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='64' id='337c1cdd'>
      <subrange length='2' type-id='7359adad' id='52efc4ef'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='8f92235e' size-in-bits='131072' id='3696d58e'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2056' id='1e9639e4'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='240' id='94f5df85'>
      <subrange length='30' type-id='7359adad' id='6a6183a4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='2624' id='bdabc3bb'>
      <subrange length='328' type-id='7359adad' id='95e79a9c'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='526592' id='a84f77b1'>
      <subrange length='65824' type-id='7359adad' id='5f12f39e'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <enum-decl name='isal_zstate_state' id='5e2dd8af'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ZSTATE_NEW_HDR' value='0'/>
      <enumerator name='ZSTATE_HDR' value='1'/>
      <enumerator name='ZSTATE_CREATE_HDR' value='2'/>
      <enumerator name='ZSTATE_BODY' value='3'/>
      <enumerator name='ZSTATE_FLUSH_READ_BUFFER' value='4'/>
      <enumerator name='ZSTATE_FLUSH_ICF_BUFFER' value='5'/>
      <enumerator name='ZSTATE_TYPE0_HDR' value='6'/>
      <enumerator name='ZSTATE_TYPE0_BODY' value='7'/>
      <enumerator name='ZSTATE_SYNC_FLUSH' value='8'/>
      <enumerator name='ZSTATE_FLUSH_WRITE_BUFFER' value='9'/>
      <enumerator name='ZSTATE_TRL' value='10'/>
      <enumerator name='ZSTATE_END' value='11'/>
      <enumerator name='ZSTATE_TMP_NEW_HDR' value='12'/>
      <enumerator name='ZSTATE_TMP_HDR' value='13'/>
      <enumerator name='ZSTATE_TMP_CREATE_HDR' value='14'/>
      <enumerator name='ZSTATE_TMP_BODY' value='15'/>
      <enumerator name='ZSTATE_TMP_FLUSH_READ_BUFFER' value='16'/>
      <enumerator name='ZSTATE_TMP_FLUSH_ICF_BUFFER' value='17'/>
      <enumerator name='ZSTATE_TMP_TYPE0_HDR' value='18'/>
      <enumerator name='ZSTATE_TMP_TYPE0_BODY' value='19'/>
      <enumerator name='ZSTATE_TMP_SYNC_FLUSH' value='20'/>
      <enumerator name='ZSTATE_TMP_FLUSH_WRITE_BUFFER' value='21'/>
      <enumerator name='ZSTATE_TMP_TRL' value='22'/>
      <enumerator name='ZSTATE_TMP_END' value='23'/>
    </enum-decl>
    <enum-decl name='isal_block_state' id='1279ee81'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ISAL_BLOCK_NEW_HDR' value='0'/>
      <enumerator name='ISAL_BLOCK_HDR' value='1'/>
      <enumerator name='ISAL_BLOCK_TYPE0' value='2'/>
      <enumerator name='ISAL_BLOCK_CODED' value='3'/>
      <enumerator name='ISAL_BLOCK_INPUT_DONE' value='4'/>
      <enumerator name='ISAL_BLOCK_FINISH' value='5'/>
      <enumerator name='ISAL_GZIP_EXTRA_LEN' value='6'/>
      <enumerator name='ISAL_GZIP_EXTRA' value='7'/>
      <enumerator name='ISAL_GZIP_NAME' value='8'/>
      <enumerator name='ISAL_GZIP_COMMENT' value='9'/>
      <enumerator name='ISAL_GZIP_HCRC' value='10'/>
      <enumerator name='ISAL_ZLIB_DICT' value='11'/>
      <enumerator name='ISAL_CHECKSUM_CHECK' value='12'/>
    </enum-decl>
    <class-decl name='BitBuf2' size-in-bits='320' is-struct='yes' visibility='default' id='1573a815'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='m_bits' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='m_bit_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='m_out_buf' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='m_out_end' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='m_out_start' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='isal_zstate' size-in-bits='658560' is-struct='yes' visibility='default' id='470c4c6e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='total_in_start' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='block_next' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='block_end' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='dist_mask' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hash_mask' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='state' type-id='5e2dd8af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bitbuf' type-id='1573a815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='crc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='has_wrap_hdr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='552'>
        <var-decl name='has_eob_hdr' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='560'>
        <var-decl name='has_eob' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='568'>
        <var-decl name='has_hist' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='has_level_buf_init' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tmp_out_buff' type-id='fa9986a5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tmp_out_start' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='tmp_out_end' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='b_bytes_valid' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='864'>
        <var-decl name='b_bytes_processed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='buffer' type-id='a84f77b1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='527488'>
        <var-decl name='head' type-id='e4115699' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='isal_hufftables' size-in-bits='17856' is-struct='yes' visibility='default' id='4e82f1cf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='deflate_hdr' type-id='bdabc3bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='deflate_hdr_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2656'>
        <var-decl name='deflate_hdr_extra_bits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='dist_table' type-id='337c1cdd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='len_table' type-id='162aff9c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='10944'>
        <var-decl name='lit_table' type-id='c5093f6b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='15056'>
        <var-decl name='lit_table_sizes' type-id='1e9639e4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17120'>
        <var-decl name='dcodes' type-id='51819310' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='17600'>
        <var-decl name='dcodes_sizes' type-id='94f5df85' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='isal_zstream' size-in-bits='659072' is-struct='yes' visibility='default' id='8cd3077d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_in' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avail_in' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='total_in' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next_out' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='avail_out' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='total_out' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hufftables' type-id='c3c3abf7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='level' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='level_buf_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='level_buf' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='end_of_stream' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='464'>
        <var-decl name='flush' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='gzip_flag' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='496'>
        <var-decl name='hist_bits' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='internal_state' type-id='470c4c6e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='inflate_huff_code_large' size-in-bits='151296' is-struct='yes' visibility='default' id='d101cb2a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='short_code_lookup' type-id='3696d58e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='131072'>
        <var-decl name='long_code_lookup' type-id='2758a92e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='inflate_huff_code_small' size-in-bits='17664' is-struct='yes' visibility='default' id='698aa4be'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='short_code_lookup' type-id='11c598cc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16384'>
        <var-decl name='long_code_lookup' type-id='28afca19' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='inflate_state' size-in-bits='698944' is-struct='yes' visibility='default' id='9b6a6f7a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next_out' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='avail_out' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='total_out' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='next_in' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read_in' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='avail_in' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='read_in_length' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='lit_huff_code' type-id='d101cb2a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='151616'>
        <var-decl name='dist_huff_code' type-id='698aa4be' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169280'>
        <var-decl name='block_state' type-id='1279ee81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169312'>
        <var-decl name='dict_length' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169344'>
        <var-decl name='bfinal' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169376'>
        <var-decl name='crc_flag' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169408'>
        <var-decl name='crc' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169440'>
        <var-decl name='hist_bits' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169472'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169504'>
        <var-decl name='write_overflow_lits' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169536'>
        <var-decl name='write_overflow_len' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169568'>
        <var-decl name='copy_overflow_length' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169600'>
        <var-decl name='copy_overflow_distance' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169632'>
        <var-decl name='wrapper_flag' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169648'>
        <var-decl name='tmp_in_size' type-id='23bd8cb5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169664'>
        <var-decl name='tmp_out_valid' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169696'>
        <var-decl name='tmp_out_processed' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='169728'>
        <var-decl name='tmp_in_buffer' type-id='bdabc3bb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='172352'>
        <var-decl name='tmp_out_buffer' type-id='a84f77b1' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='32' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='type0_block_len' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='count' type-id='3ff5601b' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dict_id' type-id='8f92235e' visibility='default'/>
      </data-member>
    </union-decl>
    <enum-decl name='accel_opcode' id='83b0f1c7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='ACCEL_OPC_COPY' value='0'/>
      <enumerator name='ACCEL_OPC_FILL' value='1'/>
      <enumerator name='ACCEL_OPC_DUALCAST' value='2'/>
      <enumerator name='ACCEL_OPC_COMPARE' value='3'/>
      <enumerator name='ACCEL_OPC_CRC32C' value='4'/>
      <enumerator name='ACCEL_OPC_COPY_CRC32C' value='5'/>
      <enumerator name='ACCEL_OPC_COMPRESS' value='6'/>
      <enumerator name='ACCEL_OPC_DECOMPRESS' value='7'/>
      <enumerator name='ACCEL_OPC_LAST' value='8'/>
    </enum-decl>
    <typedef-decl name='spdk_accel_completion_cb' type-id='1ed1e4cd' id='e2a47d34'/>
    <typedef-decl name='spdk_accel_fini_cb' type-id='b7f9d8e6' id='e5aecfa2'/>
    <class-decl name='accel_io_channel' size-in-bits='1358720' is-struct='yes' visibility='default' id='7d858f4c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='engine_ch' type-id='31383d20' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='stream' type-id='8cd3077d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='659584'>
        <var-decl name='state' type-id='9b6a6f7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1358528'>
        <var-decl name='task_pool_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1358592'>
        <var-decl name='task_pool' type-id='e7f43f72' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='10ebab0a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='c2fe6360' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_task' size-in-bits='896' is-struct='yes' visibility='default' id='a817e78c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='accel_ch' type-id='4d4d5eba' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='e2a47d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='' type-id='ac5ab599' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='op_code' type-id='83b0f1c7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nbytes' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nbytes_dst' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='flags' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='status' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='link' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='v' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='src' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iovcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='dst' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='src2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='dst2' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='seed' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fill_pattern' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab599'>
      <data-member access='public'>
        <var-decl name='crc_dst' type-id='90421557' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='output_size' type-id='90421557' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='10ebab0a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c2fe6360' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_engine' size-in-bits='384' is-struct='yes' visibility='default' id='ba12cf5b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='supports_opcode' type-id='161d0d48' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_io_channel' type-id='94a5300d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='submit_tasks' type-id='17aa1e6d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='3228235b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='662fcae3' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_accel_module_if' size-in-bits='384' is-struct='yes' visibility='default' id='c7a04c81'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='module_init' type-id='1db260e5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='module_fini' type-id='b7f9d8e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='write_config_json' type-id='582528d7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_ctx_size' type-id='b2161495' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tailq' type-id='e7f43f76' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b78a11b9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='8159aa69' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int16_t' type-id='03896e23' id='23bd8cb5'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__int16_t' type-id='a2185560' id='03896e23'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='7d858f4c' size-in-bits='64' id='4d4d5eba'/>
    <pointer-type-def type-id='6aeec1b6' size-in-bits='64' id='161d0d48'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='276427e1' size-in-bits='64' id='1db260e5'/>
    <pointer-type-def type-id='2a0300f1' size-in-bits='64' id='17aa1e6d'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='4e82f1cf' size-in-bits='64' id='c3c3abf7'/>
    <pointer-type-def type-id='ba12cf5b' size-in-bits='64' id='3228235b'/>
    <pointer-type-def type-id='3228235b' size-in-bits='64' id='662fcae3'/>
    <pointer-type-def type-id='c7a04c81' size-in-bits='64' id='b78a11b9'/>
    <pointer-type-def type-id='b78a11b9' size-in-bits='64' id='8159aa69'/>
    <pointer-type-def type-id='a817e78c' size-in-bits='64' id='10ebab0a'/>
    <pointer-type-def type-id='10ebab0a' size-in-bits='64' id='c2fe6360'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='e76af571' size-in-bits='64' id='94a5300d'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='865cc949' size-in-bits='64' id='b2161495'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='9ed8cfeb' size-in-bits='64' id='582528d7'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_accel_engine_register' mangled-name='spdk_accel_engine_register' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_accel_engine_register'>
      <parameter type-id='3228235b' name='engine'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_accel_task_complete' mangled-name='spdk_accel_task_complete' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_accel_task_complete'>
      <parameter type-id='10ebab0a' name='accel_task'/>
      <parameter type-id='95e97e5e' name='status'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_accel_submit_copy' mangled-name='spdk_accel_submit_copy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_accel_submit_copy'>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='95e97e5e' name='flags'/>
      <parameter type-id='e2a47d34' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_accel_submit_dualcast' mangled-name='spdk_accel_submit_dualcast' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_accel_submit_dualcast'>
      <parameter type-id='a7e01876' name='ch'/>
      <parameter type-id='eaa32e2f' name='dst1'/>
      <parameter type-id='eaa32e2f' name='dst2'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='9c313c2d' name='nbytes'/>
      <parameter type-id='95e97e5e' name='flags'/>
