<abi-corpus version='2.0' soname='libspdk_json.so.4.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.5.0'/>
    <dependency name='libspdk_util.so.5.0'/>
    <dependency name='libgcc_s.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_json_array_first' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_bool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_object' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_object_relaxed' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_decode_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_json_write_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_name_raw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_array_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_bool' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_bytearray' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_int64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_string_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_string_fmt_v' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_uint128' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_named_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_null' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_object_begin' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_object_end' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string_fmt_v' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string_raw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string_utf16le' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_string_utf16le_raw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_uint128' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_val' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_json_write_val_raw' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='json_parse.c' language='LANG_C99'>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <enum-decl name='spdk_json_val_type' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__ssize_t' type-id='bd54fe1a' id='41060289'/>
    <typedef-decl name='ssize_t' type-id='41060289' id='79a0948f'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='9fc5272e' size-in-bits='64' id='8505e504'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <function-decl name='spdk_json_parse' mangled-name='spdk_json_parse' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_parse'>
      <parameter type-id='eaa32e2f' name='json'/>
      <parameter type-id='b59d7dce' name='size'/>
      <parameter type-id='8505e504' name='values'/>
      <parameter type-id='b59d7dce' name='num_values'/>
      <parameter type-id='63e171df' name='end'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='79a0948f'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='json_util.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <typedef-decl name='spdk_json_decode_fn' type-id='d607d3d1' id='66f76fb1'/>
    <class-decl name='spdk_json_object_decoder' size-in-bits='256' is-struct='yes' visibility='default' id='6295b483'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='80f4b756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='offset' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decode_func' type-id='66f76fb1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='optional' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='6295b483' const='yes' id='4a3cb5a2'/>
    <pointer-type-def type-id='4a3cb5a2' size-in-bits='64' id='6591c518'/>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <pointer-type-def type-id='225921ed' size-in-bits='64' id='d607d3d1'/>
    <pointer-type-def type-id='3ff5601b' size-in-bits='64' id='4aafb922'/>
    <pointer-type-def type-id='b59d7dce' size-in-bits='64' id='78c01427'/>
    <pointer-type-def type-id='8505e504' size-in-bits='64' id='9647c76a'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <function-decl name='spdk_json_val_len' mangled-name='spdk_json_val_len' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_val_len'>
      <parameter type-id='3ee1fff1' name='val'/>
      <return type-id='b59d7dce'/>
    </function-decl>
    <function-decl name='spdk_json_strequal' mangled-name='spdk_json_strequal' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_strequal'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='80f4b756' name='str'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_json_strdup' mangled-name='spdk_json_strdup' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_strdup'>
      <parameter type-id='3ee1fff1' name='val'/>
      <return type-id='26a90f95'/>
    </function-decl>
    <function-decl name='spdk_json_number_to_uint8' mangled-name='spdk_json_number_to_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_number_to_uint8'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='ae3e8ca6' name='num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_number_to_uint16' mangled-name='spdk_json_number_to_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_number_to_uint16'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='8a121f49' name='num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_number_to_int32' mangled-name='spdk_json_number_to_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_number_to_int32'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='4aafb922' name='num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_number_to_uint32' mangled-name='spdk_json_number_to_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_number_to_uint32'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='90421557' name='num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_number_to_uint64' mangled-name='spdk_json_number_to_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_number_to_uint64'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='5d6479ae' name='num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_free_object' mangled-name='spdk_json_free_object' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_free_object'>
      <parameter type-id='6591c518' name='decoders'/>
      <parameter type-id='b59d7dce' name='num_decoders'/>
      <parameter type-id='eaa32e2f' name='obj'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_json_decode_object' mangled-name='spdk_json_decode_object' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_object'>
      <parameter type-id='3ee1fff1' name='values'/>
      <parameter type-id='6591c518' name='decoders'/>
      <parameter type-id='b59d7dce' name='num_decoders'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_object_relaxed' mangled-name='spdk_json_decode_object_relaxed' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_object_relaxed'>
      <parameter type-id='3ee1fff1' name='values'/>
      <parameter type-id='6591c518' name='decoders'/>
      <parameter type-id='b59d7dce' name='num_decoders'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_array' mangled-name='spdk_json_decode_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_array'>
      <parameter type-id='3ee1fff1' name='values'/>
      <parameter type-id='66f76fb1' name='decode_func'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <parameter type-id='b59d7dce' name='max_size'/>
      <parameter type-id='78c01427' name='out_size'/>
      <parameter type-id='b59d7dce' name='stride'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_bool' mangled-name='spdk_json_decode_bool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_bool'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_uint8' mangled-name='spdk_json_decode_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_uint8'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_uint16' mangled-name='spdk_json_decode_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_uint16'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_int32' mangled-name='spdk_json_decode_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_int32'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_uint32' mangled-name='spdk_json_decode_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_uint32'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_uint64' mangled-name='spdk_json_decode_uint64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_uint64'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_decode_string' mangled-name='spdk_json_decode_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_decode_string'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_find' mangled-name='spdk_json_find' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_find'>
      <parameter type-id='8505e504' name='object'/>
      <parameter type-id='80f4b756' name='key_name'/>
      <parameter type-id='9647c76a' name='key'/>
      <parameter type-id='9647c76a' name='val'/>
      <parameter type-id='18f471ce' name='type'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_find_string' mangled-name='spdk_json_find_string' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_find_string'>
      <parameter type-id='8505e504' name='object'/>
      <parameter type-id='80f4b756' name='key_name'/>
      <parameter type-id='9647c76a' name='key'/>
      <parameter type-id='9647c76a' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_find_array' mangled-name='spdk_json_find_array' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_find_array'>
      <parameter type-id='8505e504' name='object'/>
      <parameter type-id='80f4b756' name='key_name'/>
      <parameter type-id='9647c76a' name='key'/>
      <parameter type-id='9647c76a' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_object_first' mangled-name='spdk_json_object_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_object_first'>
      <parameter type-id='8505e504' name='object'/>
      <return type-id='8505e504'/>
    </function-decl>
    <function-decl name='spdk_json_array_first' mangled-name='spdk_json_array_first' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_array_first'>
      <parameter type-id='8505e504' name='array_begin'/>
      <return type-id='8505e504'/>
    </function-decl>
    <function-decl name='spdk_json_next' mangled-name='spdk_json_next' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_next'>
      <parameter type-id='8505e504' name='it'/>
      <return type-id='8505e504'/>
    </function-decl>
    <function-type size-in-bits='64' id='225921ed'>
      <parameter type-id='3ee1fff1' name='val'/>
      <parameter type-id='eaa32e2f' name='out'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='json_write.c' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='d5027220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32768' id='2b55acb1'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <typedef-decl name='spdk_json_write_cb' type-id='02a757da' id='f0a32ff7'/>
    <class-decl name='spdk_json_write_ctx' size-in-bits='33088' is-struct='yes' visibility='default' id='2ae61988'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='write_cb' type-id='f0a32ff7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='flags' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='indent' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='new_indent' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='200'>
        <var-decl name='first_value' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='208'>
        <var-decl name='failed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='buf_filled' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='buf' type-id='2b55acb1' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='int64_t' type-id='0c9942d2' id='9da381c4'/>
    <typedef-decl name='__int64_t' type-id='bd54fe1a' id='0c9942d2'/>
    <pointer-type-def type-id='d5027220' size-in-bits='64' id='b7f2d5e6'/>
    <qualified-type-def type-id='149c6638' const='yes' id='b01a5ac8'/>
    <pointer-type-def type-id='b01a5ac8' size-in-bits='64' id='1b7d11c6'/>
    <pointer-type-def type-id='bc6e6178' size-in-bits='64' id='02a757da'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <function-decl name='spdk_json_write_begin' mangled-name='spdk_json_write_begin' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_begin'>
      <parameter type-id='f0a32ff7' name='write_cb'/>
      <parameter type-id='eaa32e2f' name='cb_ctx'/>
      <parameter type-id='8f92235e' name='flags'/>
      <return type-id='b8e14bfe'/>
    </function-decl>
    <function-decl name='spdk_json_write_end' mangled-name='spdk_json_write_end' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_end'>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_val_raw' mangled-name='spdk_json_write_val_raw' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_val_raw'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='eaa32e2f' name='data'/>
      <parameter type-id='b59d7dce' name='len'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_null' mangled-name='spdk_json_write_null' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_null'>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_bool' mangled-name='spdk_json_write_bool' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_bool'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='c894953d' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_uint8' mangled-name='spdk_json_write_uint8' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_uint8'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='b96825af' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_uint16' mangled-name='spdk_json_write_uint16' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_uint16'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='149c6638' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_int32' mangled-name='spdk_json_write_int32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_int32'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='3ff5601b' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_uint32' mangled-name='spdk_json_write_uint32' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_uint32'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='8f92235e' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_json_write_int64' mangled-name='spdk_json_write_int64' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_json_write_int64'>
      <parameter type-id='b8e14bfe' name='w'/>
      <parameter type-id='9da381c4' name='val'/>
      <return type-id='95e97e5e'/>
    </function-decl>
