<abi-corpus version='2.2' soname='libspdk_jsonrpc.so.6.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_util.so.9.0'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_jsonrpc_begin_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_begin_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_connect' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_create_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_free_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_get_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_client_send_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_conn_add_close_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_conn_del_close_cb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_end_request' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_end_result' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_get_conn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_bool_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_send_error_response_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_listen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_server_shutdown' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_set_log_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_jsonrpc_set_log_level' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='jsonrpc_client.c' language='LANG_C11'>
    <typedef-decl name='__int32_t' type-id='95e97e5e' filepath='types.h' line='41' column='1' id='33f57a65'/>
    <typedef-decl name='int32_t' type-id='33f57a65' filepath='stdint-intn.h' line='26' column='1' id='3ff5601b'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='658455c7' size-in-bits='64' id='63dc953f'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <function-decl name='spdk_jsonrpc_begin_request' mangled-name='spdk_jsonrpc_begin_request' filepath='jsonrpc_client.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_request'>
      <parameter type-id='63dc953f' name='request' filepath='jsonrpc_client.c' line='165' column='1'/>
      <parameter type-id='3ff5601b' name='id' filepath='jsonrpc_client.c' line='165' column='1'/>
      <parameter type-id='80f4b756' name='method' filepath='jsonrpc_client.c' line='166' column='1'/>
      <return type-id='b8e14bfe'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_request' mangled-name='spdk_jsonrpc_end_request' filepath='jsonrpc_client.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_request'>
      <parameter type-id='63dc953f' name='request' filepath='jsonrpc_client.c' line='190' column='1'/>
      <parameter type-id='b8e14bfe' name='w' filepath='jsonrpc_client.c' line='190' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client_request' is-struct='yes' visibility='default' filepath='jsonrpc_internal.h' line='81' column='1' is-declaration-only='yes' id='658455c7'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_client_tcp.c' language='LANG_C11'>
    <class-decl name='spdk_jsonrpc_client_response' size-in-bits='256' is-struct='yes' visibility='default' filepath='jsonrpc.h' line='43' column='1' id='1361d8dd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='result' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='error' type-id='8505e504' visibility='default' filepath='jsonrpc.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='9fc5272e' size-in-bits='64' id='8505e504'/>
    <pointer-type-def type-id='1361d8dd' size-in-bits='64' id='f9dbe2ed'/>
    <pointer-type-def type-id='9d9bbaf1' size-in-bits='64' id='6137db59'/>
    <pointer-type-def type-id='658455c7' size-in-bits='64' id='63dc9540'/>
    <function-decl name='spdk_jsonrpc_client_connect' mangled-name='spdk_jsonrpc_client_connect' filepath='jsonrpc_client_tcp.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_connect'>
      <parameter type-id='80f4b756' name='addr' filepath='jsonrpc_client_tcp.c' line='231' column='1'/>
      <parameter type-id='95e97e5e' name='addr_family' filepath='jsonrpc_client_tcp.c' line='231' column='1'/>
      <return type-id='6137db59'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_close' mangled-name='spdk_jsonrpc_client_close' filepath='jsonrpc_client_tcp.c' line='306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_close'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='306' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_create_request' mangled-name='spdk_jsonrpc_client_create_request' filepath='jsonrpc_client_tcp.c' line='321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_create_request'>
      <return type-id='63dc9540'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_request' mangled-name='spdk_jsonrpc_client_free_request' filepath='jsonrpc_client_tcp.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_request'>
      <parameter type-id='63dc9540' name='req' filepath='jsonrpc_client_tcp.c' line='343' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_poll' mangled-name='spdk_jsonrpc_client_poll' filepath='jsonrpc_client_tcp.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_poll'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='350' column='1'/>
      <parameter type-id='95e97e5e' name='timeout' filepath='jsonrpc_client_tcp.c' line='350' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_send_request' mangled-name='spdk_jsonrpc_client_send_request' filepath='jsonrpc_client_tcp.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_send_request'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='360' column='1'/>
      <parameter type-id='63dc9540' name='req' filepath='jsonrpc_client_tcp.c' line='361' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_get_response' mangled-name='spdk_jsonrpc_client_get_response' filepath='jsonrpc_client_tcp.c' line='372' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_get_response'>
      <parameter type-id='6137db59' name='client' filepath='jsonrpc_client_tcp.c' line='372' column='1'/>
      <return type-id='f9dbe2ed'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_client_free_response' mangled-name='spdk_jsonrpc_client_free_response' filepath='jsonrpc_client_tcp.c' line='386' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_client_free_response'>
      <parameter type-id='f9dbe2ed' name='resp' filepath='jsonrpc_client_tcp.c' line='386' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <class-decl name='spdk_jsonrpc_client' is-struct='yes' visibility='default' filepath='jsonrpc_internal.h' line='101' column='1' is-declaration-only='yes' id='9d9bbaf1'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='8' id='89feb1ec'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eeb' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='160' id='664ac0b7'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='f0981eeb' id='fdca39cf'/>
    </array-type-def>
    <enum-decl name='spdk_log_level' filepath='log.h' line='52' column='1' id='4271cbce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_LOG_DISABLED' value='-1'/>
      <enumerator name='SPDK_LOG_ERROR' value='0'/>
      <enumerator name='SPDK_LOG_WARN' value='1'/>
      <enumerator name='SPDK_LOG_NOTICE' value='2'/>
      <enumerator name='SPDK_LOG_INFO' value='3'/>
      <enumerator name='SPDK_LOG_DEBUG' value='4'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='95e97e5f'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='struct_FILE.h' line='49' column='1' id='ec1ed955'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='26a90f95' visibility='default' filepath='struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='e4c6fa61' visibility='default' filepath='struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='79989e9c' visibility='default' filepath='struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='f0981eec' visibility='default' filepath='struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='28577a57' visibility='default' filepath='struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='89feb1ec' visibility='default' filepath='struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='cecf4ea7' visibility='default' filepath='struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='724e4de6' visibility='default' filepath='struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='570f8c59' visibility='default' filepath='struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='c65a1f29' visibility='default' filepath='struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='dca988a5' visibility='default' filepath='struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='eaa32e2f' visibility='default' filepath='struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='b59d7dce' visibility='default' filepath='struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='95e97e5e' visibility='default' filepath='struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='664ac0b7' visibility='default' filepath='struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='ec1ed955' filepath='FILE.h' line='7' column='1' id='aa12d1ba'/>
    <typedef-decl name='_IO_lock_t' type-id='48b5725f' filepath='struct_FILE.h' line='43' column='1' id='bb4788fa'/>
    <typedef-decl name='__off64_t' type-id='95e97e5f' filepath='types.h' line='153' column='1' id='724e4de6'/>
    <typedef-decl name='__off_t' type-id='95e97e5f' filepath='types.h' line='152' column='1' id='79989e9c'/>
    <typedef-decl name='size_t' type-id='f0981eeb' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eeb'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eec'/>
    <pointer-type-def type-id='aa12d1ba' size-in-bits='64' id='822cd80b'/>
    <pointer-type-def type-id='ec1ed955' size-in-bits='64' id='dca988a5'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='a4036571' size-in-bits='64' id='570f8c59'/>
    <pointer-type-def type-id='bb4788fa' size-in-bits='64' id='cecf4ea7'/>
    <pointer-type-def type-id='010ae0b9' size-in-bits='64' id='e4c6fa61'/>
    <pointer-type-def type-id='79bd3751' size-in-bits='64' id='c65a1f29'/>
    <pointer-type-def type-id='2ae61989' size-in-bits='64' id='b8e14bff'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b637'/>
    <pointer-type-def type-id='c4c192e4' size-in-bits='64' id='7923cb22'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='a4036571'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='010ae0b9'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='79bd3751'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61989'/>
    <class-decl name='spdk_jsonrpc_request' is-struct='yes' visibility='default' filepath='jsonrpc_internal.h' line='23' column='1' is-declaration-only='yes' id='1c42476f'/>
    <class-decl name='spdk_jsonrpc_server_conn' is-struct='yes' visibility='default' filepath='jsonrpc_internal.h' line='48' column='1' is-declaration-only='yes' id='c4c192e4'/>
    <function-decl name='spdk_jsonrpc_set_log_level' mangled-name='spdk_jsonrpc_set_log_level' filepath='jsonrpc_server.c' line='21' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_set_log_level'>
      <parameter type-id='4271cbce' name='level' filepath='jsonrpc_server.c' line='21' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_set_log_file' mangled-name='spdk_jsonrpc_set_log_file' filepath='jsonrpc_server.c' line='29' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_set_log_file'>
      <parameter type-id='822cd80b' name='file' filepath='jsonrpc_server.c' line='29' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_get_conn' mangled-name='spdk_jsonrpc_get_conn' filepath='jsonrpc_server.c' line='276' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_get_conn'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='276' column='1'/>
      <return type-id='7923cb22'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_begin_result' mangled-name='spdk_jsonrpc_begin_result' filepath='jsonrpc_server.c' line='361' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_begin_result'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='361' column='1'/>
      <return type-id='b8e14bff'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_end_result' mangled-name='spdk_jsonrpc_end_result' filepath='jsonrpc_server.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_end_result'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='370' column='1'/>
      <parameter type-id='b8e14bff' name='w' filepath='jsonrpc_server.c' line='370' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_bool_response' mangled-name='spdk_jsonrpc_send_bool_response' filepath='jsonrpc_server.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_bool_response'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='384' column='1'/>
      <parameter type-id='c894953d' name='value' filepath='jsonrpc_server.c' line='384' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response' mangled-name='spdk_jsonrpc_send_error_response' filepath='jsonrpc_server.c' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='395' column='1'/>
      <parameter type-id='95e97e5e' name='error_code' filepath='jsonrpc_server.c' line='396' column='1'/>
      <parameter type-id='80f4b756' name='msg' filepath='jsonrpc_server.c' line='396' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_send_error_response_fmt' mangled-name='spdk_jsonrpc_send_error_response_fmt' filepath='jsonrpc_server.c' line='409' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_send_error_response_fmt'>
      <parameter type-id='42a6b637' name='request' filepath='jsonrpc_server.c' line='409' column='1'/>
      <parameter type-id='95e97e5e' name='error_code' filepath='jsonrpc_server.c' line='410' column='1'/>
      <parameter type-id='80f4b756' name='fmt' filepath='jsonrpc_server.c' line='410' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='2c1145c5'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
  </abi-instr>
  <abi-instr address-size='64' path='jsonrpc_server_tcp.c' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='112' id='f01a039e'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='f0981eeb' id='48882d96'/>
    </array-type-def>
    <enum-decl name='spdk_json_val_type' filepath='json.h' line='21' column='1' id='18f471ce'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_JSON_VAL_INVALID' value='0'/>
      <enumerator name='SPDK_JSON_VAL_NULL' value='2'/>
      <enumerator name='SPDK_JSON_VAL_TRUE' value='4'/>
      <enumerator name='SPDK_JSON_VAL_FALSE' value='8'/>
      <enumerator name='SPDK_JSON_VAL_NUMBER' value='16'/>
      <enumerator name='SPDK_JSON_VAL_STRING' value='32'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_BEGIN' value='64'/>
      <enumerator name='SPDK_JSON_VAL_ARRAY_END' value='128'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_BEGIN' value='256'/>
      <enumerator name='SPDK_JSON_VAL_OBJECT_END' value='512'/>
      <enumerator name='SPDK_JSON_VAL_NAME' value='1024'/>
    </enum-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='socket.h' line='183' column='1' id='5221b18a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='376fda66' visibility='default' filepath='socket.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='f01a039e' visibility='default' filepath='socket.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_json_val' size-in-bits='128' is-struct='yes' visibility='default' filepath='json.h' line='36' column='1' id='9fc5272e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='eaa32e2f' visibility='default' filepath='json.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='8f92235e' visibility='default' filepath='json.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='type' type-id='18f471ce' visibility='default' filepath='json.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__socklen_t' type-id='f0981eed' filepath='types.h' line='210' column='1' id='83f97a0a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eed' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='sa_family_t' type-id='f0981eec' filepath='sockaddr.h' line='28' column='1' id='376fda66'/>
    <typedef-decl name='socklen_t' type-id='83f97a0a' filepath='socket.h' line='33' column='1' id='6b2697b0'/>
    <typedef-decl name='spdk_jsonrpc_conn_closed_fn' type-id='6ebf3e6f' filepath='jsonrpc.h' line='67' column='1' id='36baf675'/>
    <typedef-decl name='spdk_jsonrpc_handle_request_fn' type-id='6bd53efe' filepath='jsonrpc.h' line='60' column='1' id='3effb642'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eed'/>
    <qualified-type-def type-id='9fc5272e' const='yes' id='f6adfac1'/>
    <pointer-type-def type-id='f6adfac1' size-in-bits='64' id='3ee1fff1'/>
    <pointer-type-def type-id='5221b18a' size-in-bits='64' id='5c0abad8'/>
    <pointer-type-def type-id='fef343e4' size-in-bits='64' id='6bd53efe'/>
    <pointer-type-def type-id='953077c3' size-in-bits='64' id='6ebf3e6f'/>
    <pointer-type-def type-id='1c42476f' size-in-bits='64' id='42a6b638'/>
    <pointer-type-def type-id='79c1ff35' size-in-bits='64' id='3c05c735'/>
    <pointer-type-def type-id='c4c192e4' size-in-bits='64' id='7923cb23'/>
    <class-decl name='spdk_jsonrpc_server' is-struct='yes' visibility='default' filepath='jsonrpc_internal.h' line='71' column='1' is-declaration-only='yes' id='79c1ff35'/>
    <function-decl name='spdk_jsonrpc_server_listen' mangled-name='spdk_jsonrpc_server_listen' filepath='jsonrpc_server_tcp.c' line='11' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_listen'>
      <parameter type-id='95e97e5e' name='domain' filepath='jsonrpc_server_tcp.c' line='11' column='1'/>
      <parameter type-id='95e97e5e' name='protocol' filepath='jsonrpc_server_tcp.c' line='11' column='1'/>
      <parameter type-id='5c0abad8' name='listen_addr' filepath='jsonrpc_server_tcp.c' line='12' column='1'/>
      <parameter type-id='6b2697b0' name='addrlen' filepath='jsonrpc_server_tcp.c' line='12' column='1'/>
      <parameter type-id='3effb642' name='handle_request' filepath='jsonrpc_server_tcp.c' line='13' column='1'/>
      <return type-id='3c05c735'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_server_shutdown' mangled-name='spdk_jsonrpc_server_shutdown' filepath='jsonrpc_server_tcp.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_server_shutdown'>
      <parameter type-id='3c05c735' name='server' filepath='jsonrpc_server_tcp.c' line='119' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_conn_add_close_cb' mangled-name='spdk_jsonrpc_conn_add_close_cb' filepath='jsonrpc_server_tcp.c' line='147' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_conn_add_close_cb'>
      <parameter type-id='7923cb23' name='conn' filepath='jsonrpc_server_tcp.c' line='147' column='1'/>
      <parameter type-id='36baf675' name='cb' filepath='jsonrpc_server_tcp.c' line='148' column='1'/>
      <parameter type-id='eaa32e2f' name='ctx' filepath='jsonrpc_server_tcp.c' line='148' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_jsonrpc_conn_del_close_cb' mangled-name='spdk_jsonrpc_conn_del_close_cb' filepath='jsonrpc_server_tcp.c' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_jsonrpc_conn_del_close_cb'>
