<abi-corpus version='2.2' soname='libspdk_scsi.so.9.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.7.0'/>
    <dependency name='libspdk_util.so.9.0'/>
    <dependency name='libspdk_thread.so.10.0'/>
    <dependency name='libspdk_json.so.6.0'/>
    <dependency name='libspdk_jsonrpc.so.6.0'/>
    <dependency name='libspdk_rpc.so.6.0'/>
    <dependency name='libspdk_trace.so.10.0'/>
    <dependency name='libspdk_bdev.so.15.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_scsi_dev_add_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_lun_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_add_port' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_allocate_io_channels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_construct_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_scsi_dev_delete_port' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_find_port_by_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_free_io_channels' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_first_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_get_next_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_has_pending_tasks' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_queue_mgmt_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_dev_queue_task' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_allocate_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_free_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_bdev_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_dev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_dif_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_id_fmt_to_int' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_id_int_to_fmt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_is_removing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_lun_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_port_set_iscsi_transport_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_sbc_opcode_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_build_sense_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_copy_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_gather_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_process_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_process_null_lun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_put' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_scatter_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_set_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_scsi_task_set_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='dev.c' language='LANG_C11'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' filepath='struct_iovec.h' line='26' column='1' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default' filepath='struct_iovec.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default' filepath='struct_iovec.h' line='29' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bdev_io_wait_entry' size-in-bits='320' is-struct='yes' visibility='default' filepath='bdev.h' line='1932' column='1' id='56e41d71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default' filepath='bdev.h' line='1933' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_fn' type-id='065af103' visibility='default' filepath='bdev.h' line='1934' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default' filepath='bdev.h' line='1935' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='link' type-id='e7f43f72' visibility='default' filepath='bdev.h' line='1936' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_scsi_task' size-in-bits='2048' is-struct='yes' visibility='default' filepath='scsi.h' line='65' column='1' id='806d5c76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='status' type-id='b96825af' visibility='default' filepath='scsi.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='function' type-id='b96825af' visibility='default' filepath='scsi.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='response' type-id='b96825af' visibility='default' filepath='scsi.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lun' type-id='ae62b094' visibility='default' filepath='scsi.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='target_port' type-id='bd4f4b0e' visibility='default' filepath='scsi.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='initiator_port' type-id='bd4f4b0e' visibility='default' filepath='scsi.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='cpl_fn' type-id='06438a61' visibility='default' filepath='scsi.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='free_fn' type-id='4d4c0ac2' visibility='default' filepath='scsi.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ref' type-id='8f92235e' visibility='default' filepath='scsi.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='transfer_len' type-id='8f92235e' visibility='default' filepath='scsi.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dxfer_dir' type-id='8f92235e' visibility='default' filepath='scsi.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='length' type-id='8f92235e' visibility='default' filepath='scsi.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='data_transferred' type-id='8f92235e' visibility='default' filepath='scsi.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default' filepath='scsi.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='cdb' type-id='ae3e8ca6' visibility='default' filepath='scsi.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='alloc_len' type-id='8f92235e' visibility='default' filepath='scsi.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='iov' type-id='0f042891' visibility='default' filepath='scsi.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='caw_iov' type-id='0f042891' visibility='default' filepath='scsi.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='iovs' type-id='cc4b1be9' visibility='default' filepath='scsi.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='iovcnt' type-id='149c6638' visibility='default' filepath='scsi.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1104'>
        <var-decl name='sense_data' type-id='d0f1c0cb' visibility='default' filepath='scsi.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='sense_data_len' type-id='b59d7dce' visibility='default' filepath='scsi.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='bdev_io' type-id='eaa32e2f' visibility='default' filepath='scsi.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='scsi_link' type-id='e7f43f73' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='abort_id' type-id='8f92235e' visibility='default' filepath='scsi.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='bdev_io_wait' type-id='56e41d71' visibility='default' filepath='scsi.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='bdev.h' line='1936' column='1' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='2c737c29' visibility='default' filepath='bdev.h' line='1936' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='fccc38b9' visibility='default' filepath='bdev.h' line='1936' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='scsi.h' line='111' column='1' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='12b36f7c' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c6784462' visibility='default' filepath='scsi.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint16_t' type-id='f0981eeb' filepath='types.h' line='40' column='1' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eec' filepath='types.h' line='42' column='1' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='f0981eed' filepath='types.h' line='45' column='1' id='8910171f'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' filepath='types.h' line='38' column='1' id='c51d6389'/>
    <typedef-decl name='size_t' type-id='f0981eed' filepath='stddef.h' line='214' column='1' id='b59d7dce'/>
    <typedef-decl name='spdk_bdev_io_wait_cb' type-id='b7f9d8e6' filepath='bdev.h' line='1927' column='1' id='065af103'/>
    <typedef-decl name='spdk_scsi_dev_destruct_cb_t' type-id='1ed1e4cd' filepath='scsi.h' line='123' column='1' id='d48d236f'/>
    <typedef-decl name='spdk_scsi_task_cpl' type-id='f32ed4d9' filepath='scsi.h' line='62' column='1' id='06438a61'/>
    <typedef-decl name='spdk_scsi_task_free' type-id='f32ed4d9' filepath='scsi.h' line='63' column='1' id='4d4c0ac2'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' filepath='stdint-uintn.h' line='25' column='1' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' filepath='stdint-uintn.h' line='26' column='1' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' filepath='stdint-uintn.h' line='27' column='1' id='9c313c2d'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' filepath='stdint-uintn.h' line='24' column='1' id='b96825af'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='256' id='d0f1c0cb'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='f0981eed' id='ae5bde82'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eec'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='f0981eed'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='f0981eeb'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='80f4b756' size-in-bits='64' id='7d3cd834'/>
    <pointer-type-def type-id='95e97e5e' size-in-bits='64' id='7292109c'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='56e41d71' size-in-bits='64' id='2c737c29'/>
    <pointer-type-def type-id='2c737c29' size-in-bits='64' id='fccc38b9'/>
    <pointer-type-def type-id='806d5c76' size-in-bits='64' id='12b36f7c'/>
    <pointer-type-def type-id='12b36f7c' size-in-bits='64' id='c6784462'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='bb054cbc' size-in-bits='64' id='03369d06'/>
    <pointer-type-def type-id='0ed3c515' size-in-bits='64' id='f32ed4d9'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <qualified-type-def type-id='74e6cc2e' const='yes' id='fef6abad'/>
    <pointer-type-def type-id='fef6abad' size-in-bits='64' id='e5500585'/>
    <qualified-type-def type-id='1677014e' const='yes' id='4db60f3d'/>
    <pointer-type-def type-id='4db60f3d' size-in-bits='64' id='6c99c135'/>
    <qualified-type-def type-id='ae540668' const='yes' id='3cb8ef61'/>
    <pointer-type-def type-id='3cb8ef61' size-in-bits='64' id='e220b311'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='74e6cc2e' size-in-bits='64' id='491ccef4'/>
    <pointer-type-def type-id='1677014e' size-in-bits='64' id='ae62b094'/>
    <pointer-type-def type-id='ae540668' size-in-bits='64' id='bd4f4b0e'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <function-decl name='spdk_scsi_dev_destruct' mangled-name='spdk_scsi_dev_destruct' filepath='dev.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_destruct'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='52' column='1'/>
      <parameter type-id='d48d236f' name='cb_fn' filepath='dev.c' line='53' column='1'/>
      <parameter type-id='eaa32e2f' name='cb_arg' filepath='dev.c' line='53' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun' mangled-name='spdk_scsi_dev_add_lun' filepath='dev.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='80f4b756' name='bdev_name' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='133' column='1'/>
      <parameter type-id='03369d06' name='hotremove_cb' filepath='dev.c' line='134' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='135' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_lun_ext' mangled-name='spdk_scsi_dev_add_lun_ext' filepath='dev.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_lun_ext'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='80f4b756' name='bdev_name' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='143' column='1'/>
      <parameter type-id='03369d06' name='resize_cb' filepath='dev.c' line='144' column='1'/>
      <parameter type-id='eaa32e2f' name='resize_ctx' filepath='dev.c' line='145' column='1'/>
      <parameter type-id='03369d06' name='hotremove_cb' filepath='dev.c' line='146' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='147' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_lun' mangled-name='spdk_scsi_dev_delete_lun' filepath='dev.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_lun'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='187' column='1'/>
      <parameter type-id='ae62b094' name='lun' filepath='dev.c' line='188' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct' mangled-name='spdk_scsi_dev_construct' filepath='dev.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct'>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='197' column='1'/>
      <parameter type-id='7d3cd834' name='bdev_name_list' filepath='dev.c' line='197' column='1'/>
      <parameter type-id='7292109c' name='lun_id_list' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='95e97e5e' name='num_luns' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='b96825af' name='protocol_id' filepath='dev.c' line='198' column='1'/>
      <parameter type-id='03369d06' name='hotremove_cb' filepath='dev.c' line='199' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='200' column='1'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_construct_ext' mangled-name='spdk_scsi_dev_construct_ext' filepath='dev.c' line='208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_construct_ext'>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='208' column='1'/>
      <parameter type-id='7d3cd834' name='bdev_name_list' filepath='dev.c' line='208' column='1'/>
      <parameter type-id='7292109c' name='lun_id_list' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='95e97e5e' name='num_luns' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='b96825af' name='protocol_id' filepath='dev.c' line='209' column='1'/>
      <parameter type-id='03369d06' name='resize_cb' filepath='dev.c' line='210' column='1'/>
      <parameter type-id='eaa32e2f' name='resize_ctx' filepath='dev.c' line='211' column='1'/>
      <parameter type-id='03369d06' name='hotremove_cb' filepath='dev.c' line='212' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='dev.c' line='213' column='1'/>
      <return type-id='491ccef4'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_mgmt_task' mangled-name='spdk_scsi_dev_queue_mgmt_task' filepath='dev.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_mgmt_task'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='277' column='1'/>
      <parameter type-id='12b36f7c' name='task' filepath='dev.c' line='278' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_queue_task' mangled-name='spdk_scsi_dev_queue_task' filepath='dev.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_queue_task'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='286' column='1'/>
      <parameter type-id='12b36f7c' name='task' filepath='dev.c' line='287' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_add_port' mangled-name='spdk_scsi_dev_add_port' filepath='dev.c' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_add_port'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='309' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='309' column='1'/>
      <parameter type-id='80f4b756' name='name' filepath='dev.c' line='309' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_delete_port' mangled-name='spdk_scsi_dev_delete_port' filepath='dev.c' line='341' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_delete_port'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='341' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='341' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_find_port_by_id' mangled-name='spdk_scsi_dev_find_port_by_id' filepath='dev.c' line='359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_find_port_by_id'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='359' column='1'/>
      <parameter type-id='9c313c2d' name='id' filepath='dev.c' line='359' column='1'/>
      <return type-id='bd4f4b0e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_free_io_channels' mangled-name='spdk_scsi_dev_free_io_channels' filepath='dev.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_free_io_channels'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='377' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_allocate_io_channels' mangled-name='spdk_scsi_dev_allocate_io_channels' filepath='dev.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_allocate_io_channels'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='387' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_name' mangled-name='spdk_scsi_dev_get_name' filepath='dev.c' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_name'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='404' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_id' mangled-name='spdk_scsi_dev_get_id' filepath='dev.c' line='410' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_id'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='410' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_lun' mangled-name='spdk_scsi_dev_get_lun' filepath='dev.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_lun'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='416' column='1'/>
      <parameter type-id='95e97e5e' name='lun_id' filepath='dev.c' line='416' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_first_lun' mangled-name='spdk_scsi_dev_get_first_lun' filepath='dev.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_first_lun'>
      <parameter type-id='491ccef4' name='dev' filepath='dev.c' line='434' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_get_next_lun' mangled-name='spdk_scsi_dev_get_next_lun' filepath='dev.c' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_get_next_lun'>
      <parameter type-id='ae62b094' name='prev_lun' filepath='dev.c' line='448' column='1'/>
      <return type-id='ae62b094'/>
    </function-decl>
    <function-decl name='spdk_scsi_dev_has_pending_tasks' mangled-name='spdk_scsi_dev_has_pending_tasks' filepath='dev.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_dev_has_pending_tasks'>
      <parameter type-id='e5500585' name='dev' filepath='dev.c' line='474' column='1'/>
      <parameter type-id='e220b311' name='initiator_port' filepath='dev.c' line='475' column='1'/>
      <return type-id='c894953d'/>
    </function-decl>
    <class-decl name='spdk_scsi_port' is-struct='yes' visibility='default' filepath='scsi_internal.h' line='28' column='1' is-declaration-only='yes' id='ae540668'/>
    <class-decl name='spdk_scsi_dev' is-struct='yes' visibility='default' filepath='scsi_internal.h' line='60' column='1' is-declaration-only='yes' id='74e6cc2e'/>
    <class-decl name='spdk_scsi_lun' is-struct='yes' visibility='default' filepath='scsi_internal.h' line='84' column='1' is-declaration-only='yes' id='1677014e'/>
    <type-decl name='void' id='48b5725f'/>
    <pointer-type-def type-id='48b5725f' id='eaa32e2f'/>
    <function-type size-in-bits='64' id='bb054cbc'>
      <parameter type-id='6c99c135'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0ed3c515'>
      <parameter type-id='12b36f7c'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='c5c76c9c'>
      <parameter type-id='eaa32e2f'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='lun.c' language='LANG_C11'>
    <class-decl name='spdk_dif_ctx' size-in-bits='512' is-struct='yes' visibility='default' filepath='dif.h' line='64' column='1' id='6e011169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='block_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='guard_interval' type-id='8f92235e' visibility='default' filepath='dif.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='md_size' type-id='8f92235e' visibility='default' filepath='dif.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='md_interleave' type-id='c894953d' visibility='default' filepath='dif.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='104'>
        <var-decl name='dif_type' type-id='b96825af' visibility='default' filepath='dif.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='dif_pi_format' type-id='b96825af' visibility='default' filepath='dif.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='120'>
        <var-decl name='rsvd' type-id='0f44e2af' visibility='default' filepath='dif.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dif_flags' type-id='8f92235e' visibility='default' filepath='dif.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='rsvd2' type-id='d351502e' visibility='default' filepath='dif.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='init_ref_tag' type-id='9c313c2d' visibility='default' filepath='dif.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='app_tag' type-id='149c6638' visibility='default' filepath='dif.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='apptag_mask' type-id='149c6638' visibility='default' filepath='dif.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='data_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ref_tag_offset' type-id='8f92235e' visibility='default' filepath='dif.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='remapped_init_ref_tag' type-id='8f92235e' visibility='default' filepath='dif.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='last_guard' type-id='9c313c2d' visibility='default' filepath='dif.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='guard_seed' type-id='9c313c2d' visibility='default' filepath='dif.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_scsi_lun_remove_cb_t' type-id='bfecde55' filepath='scsi.h' line='122' column='1' id='4a415871'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='8' id='0f44e2af'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='f0981eed' id='52f813b4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32' id='d351502e'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='f0981eed' id='16fe7105'/>
    </array-type-def>
    <pointer-type-def type-id='6e011169' size-in-bits='64' id='a3141401'/>
    <pointer-type-def type-id='dd5b8639' size-in-bits='64' id='bfecde55'/>
    <qualified-type-def type-id='74e6cc2e' const='yes' id='fef6abae'/>
    <pointer-type-def type-id='fef6abae' size-in-bits='64' id='e5500586'/>
    <qualified-type-def type-id='1677014e' const='yes' id='4db60f3e'/>
    <pointer-type-def type-id='4db60f3e' size-in-bits='64' id='6c99c136'/>
    <pointer-type-def type-id='1677014e' size-in-bits='64' id='ae62b095'/>
    <pointer-type-def type-id='544a7a5e' size-in-bits='64' id='0029b6e4'/>
    <pointer-type-def type-id='0029b6e4' size-in-bits='64' id='0faac64a'/>
    <function-decl name='spdk_scsi_lun_open' mangled-name='spdk_scsi_lun_open' filepath='lun.c' line='480' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_open'>
      <parameter type-id='ae62b095' name='lun' filepath='lun.c' line='480' column='1'/>
      <parameter type-id='4a415871' name='hotremove_cb' filepath='lun.c' line='480' column='1'/>
      <parameter type-id='eaa32e2f' name='hotremove_ctx' filepath='lun.c' line='481' column='1'/>
      <parameter type-id='0faac64a' name='_desc' filepath='lun.c' line='481' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_close' mangled-name='spdk_scsi_lun_close' filepath='lun.c' line='502' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_close'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='502' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_allocate_io_channel' mangled-name='spdk_scsi_lun_allocate_io_channel' filepath='lun.c' line='553' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_allocate_io_channel'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='553' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_free_io_channel' mangled-name='spdk_scsi_lun_free_io_channel' filepath='lun.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_free_io_channel'>
      <parameter type-id='0029b6e4' name='desc' filepath='lun.c' line='561' column='1'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_id' mangled-name='spdk_scsi_lun_get_id' filepath='lun.c' line='569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_id'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='569' column='1'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_scsi_lun_get_bdev_name' mangled-name='spdk_scsi_lun_get_bdev_name' filepath='lun.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_scsi_lun_get_bdev_name'>
      <parameter type-id='6c99c136' name='lun' filepath='lun.c' line='575' column='1'/>
      <return type-id='80f4b756'/>
    </function-decl>
