<abi-corpus version='2.0' soname='libspdk_thread.so.6.1'>
  <elf-needed>
    <dependency name='libspdk_log.so.4.1'/>
    <dependency name='libspdk_util.so.4.1'/>
    <dependency name='libspdk_trace.so.5.1'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_for_each_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_channel_continue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_for_each_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_enable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_mode_is_enabled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_interrupt_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='spdk_thread_get_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_active_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_paused_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_first_timed_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_from_ctx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_interrupt_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_last_tsc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_active_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_paused_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_next_timed_poller' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_get_stats' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_has_active_pollers' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_has_pollers' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_is_exited' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_is_idle' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_lib_init_ext' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_next_poller_expiration' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_poll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_send_critical_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_send_msg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_set_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_thread_set_interrupt_mode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='thread.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_fd_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='c8d12ece'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='7359adad' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='320' id='d7aacc58'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='infinite' id='048fe7bc'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_new_thread_fn' type-id='ced30f5e' id='cf6adfe1'/>
    <enum-decl name='spdk_thread_op' id='1380717f'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_THREAD_OP_NEW' value='0'/>
      <enumerator name='SPDK_THREAD_OP_RESCHED' value='1'/>
    </enum-decl>
    <typedef-decl name='spdk_thread_op_fn' type-id='6588d7a0' id='fd7a9268'/>
    <typedef-decl name='spdk_thread_op_supported_fn' type-id='24118130' id='34a4e98f'/>
    <typedef-decl name='spdk_msg_fn' type-id='b7f9d8e6' id='de128c99'/>
    <typedef-decl name='spdk_poller_fn' type-id='b9b212f5' id='6aa9ba7a'/>
    <typedef-decl name='spdk_poller_set_interrupt_mode_cb' type-id='32a99b79' id='5d15a824'/>
    <typedef-decl name='spdk_io_channel_create_cb' type-id='585e1de9' id='7c63ffcc'/>
    <typedef-decl name='spdk_io_channel_destroy_cb' type-id='debb4ee8' id='7e998c02'/>
    <typedef-decl name='spdk_io_device_unregister_cb' type-id='b7f9d8e6' id='ee92dcdf'/>
    <typedef-decl name='spdk_channel_msg' type-id='8ced1cce' id='fce5caf0'/>
    <typedef-decl name='spdk_channel_for_each_cpl' type-id='7957efd5' id='38c48f04'/>
    <class-decl name='spdk_thread_stats' size-in-bits='128' is-struct='yes' visibility='default' id='06899014'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='busy_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='idle_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_interrupt_fn' type-id='b9b212f5' id='d841131b'/>
    <enum-decl name='spdk_interrupt_event_types' id='88d1abf7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_IN' value='1'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_OUT' value='4'/>
      <enumerator name='SPDK_INTERRUPT_EVENT_ET' value='2147483648'/>
    </enum-decl>
    <class-decl name='spdk_poller_stats' size-in-bits='128' is-struct='yes' visibility='default' id='cb2c3d4e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='run_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='busy_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='spdk_poller_state' id='9fb9dcd7'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_POLLER_STATE_WAITING' value='0'/>
      <enumerator name='SPDK_POLLER_STATE_RUNNING' value='1'/>
      <enumerator name='SPDK_POLLER_STATE_UNREGISTERED' value='2'/>
      <enumerator name='SPDK_POLLER_STATE_PAUSING' value='3'/>
      <enumerator name='SPDK_POLLER_STATE_PAUSED' value='4'/>
    </enum-decl>
    <class-decl name='spdk_poller' size-in-bits='3200' is-struct='yes' visibility='default' id='8921c3fe'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='node' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='state' type-id='9fb9dcd7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='period_ticks' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next_run_tick' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='run_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='busy_count' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='fn' type-id='6aa9ba7a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='interruptfd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='set_intr_cb_fn' type-id='5d15a824' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='set_intr_cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='name' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='4a47405a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='bf13de54' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='spdk_thread_state' id='9a0fd79d'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_THREAD_STATE_RUNNING' value='0'/>
      <enumerator name='SPDK_THREAD_STATE_EXITING' value='1'/>
      <enumerator name='SPDK_THREAD_STATE_EXITED' value='2'/>
    </enum-decl>
    <class-decl name='spdk_thread' size-in-bits='6656' is-struct='yes' visibility='default' id='ef0f6b10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tsc_last' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='stats' type-id='06899014' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='active_pollers' type-id='7e47f6c2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='timed_pollers' type-id='ea89a109' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='first_timed_poller' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='paused_pollers' type-id='534fbc86' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='messages' type-id='b2192338' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='msg_fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='msg_cache' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='msg_cache_count' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='critical_msg' type-id='de128c99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='next_poller_id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='state' type-id='9a0fd79d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='pending_unregister_count' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='io_channels' type-id='46d13022' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='name' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3336'>
        <var-decl name='cpumask' type-id='aec5215a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6464'>
        <var-decl name='exit_timeout_tsc' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='in_interrupt' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6536'>
        <var-decl name='poller_unregistered' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='fgrp' type-id='eb7a8954' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='ctx' type-id='048fe7bc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='active_pollers_head' size-in-bits='128' is-struct='yes' visibility='default' id='7e47f6c2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='4a47405a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='timed_pollers_tree' size-in-bits='64' is-struct='yes' visibility='default' id='ea89a109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='bf13de54' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='paused_pollers_head' size-in-bits='128' is-struct='yes' visibility='default' id='534fbc86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='bf13de54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='4a47405a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='slh_first' type-id='46ebbe69' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='io_channel_tree' size-in-bits='64' is-struct='yes' visibility='default' id='46d13022'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbh_root' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='424451a4' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='io_device' size-in-bits='2752' is-struct='yes' visibility='default' id='0a8179f4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='io_device' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='create_cb' type-id='7c63ffcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='destroy_cb' type-id='7e998c02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='unregister_cb' type-id='ee92dcdf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='unregister_thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='ctx_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2464'>
        <var-decl name='for_each_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='node' type-id='e7f43f76' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='refcnt' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='unregistered' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='75c2ad82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='75c2ad82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='75c2ad82' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_msg' size-in-bits='192' is-struct='yes' visibility='default' id='eae7da31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fn' type-id='de128c99' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='link' type-id='e7f43f77' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f77'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sle_next' type-id='46ebbe69' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_io_channel_iter' size-in-bits='576' is-struct='yes' visibility='default' id='88fe287f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='io_device' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev' type-id='75c2ad82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fn' type-id='fce5caf0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='status' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ch' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='cur_thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='orig_thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='cpl' type-id='38c48f04' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_interrupt' size-in-bits='2240' is-struct='yes' visibility='default' id='b9eb5d13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='efd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='name' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_io_channel' size-in-bits='768' is-struct='yes' visibility='default' id='8de5f3c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dev' type-id='75c2ad82' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='destroy_ref' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='node' type-id='e7f43f78' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='destroy_cb' type-id='7e998c02' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_padding' type-id='d7aacc58' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rbe_left' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='rbe_right' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='rbe_parent' type-id='a7e01876' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='c11e252e' size-in-bits='64' id='24118130'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='ef0f6b10' const='yes' id='33b441b3'/>
    <pointer-type-def type-id='33b441b3' size-in-bits='64' id='fdc343db'/>
    <pointer-type-def type-id='c448161c' size-in-bits='64' id='ced30f5e'/>
    <pointer-type-def type-id='034ff13e' size-in-bits='64' id='6588d7a0'/>
    <pointer-type-def type-id='9efbfb11' size-in-bits='64' id='b9b212f5'/>
    <pointer-type-def type-id='96ee24a5' size-in-bits='64' id='585e1de9'/>
    <pointer-type-def type-id='0a8179f4' size-in-bits='64' id='75c2ad82'/>
    <pointer-type-def type-id='aec5215a' size-in-bits='64' id='d5319498'/>
    <pointer-type-def type-id='c8d12ece' size-in-bits='64' id='eb7a8954'/>
    <pointer-type-def type-id='b9eb5d13' size-in-bits='64' id='aaf85c13'/>
    <pointer-type-def type-id='aaf85c13' size-in-bits='64' id='5df92dbb'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='88fe287f' size-in-bits='64' id='1e5ee9f7'/>
    <pointer-type-def type-id='eae7da31' size-in-bits='64' id='46ebbe69'/>
    <pointer-type-def type-id='8921c3fe' size-in-bits='64' id='bf13de54'/>
    <pointer-type-def type-id='bf13de54' size-in-bits='64' id='4a47405a'/>
    <pointer-type-def type-id='cb2c3d4e' size-in-bits='64' id='6def6e14'/>
    <pointer-type-def type-id='f749e2ba' size-in-bits='64' id='b2192338'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='f8fcfe66' size-in-bits='64' id='424451a4'/>
    <pointer-type-def type-id='06899014' size-in-bits='64' id='16f014c2'/>
    <pointer-type-def type-id='4f915724' size-in-bits='64' id='8ced1cce'/>
    <pointer-type-def type-id='dee270c1' size-in-bits='64' id='7957efd5'/>
    <pointer-type-def type-id='0ae3ab65' size-in-bits='64' id='32a99b79'/>
    <pointer-type-def type-id='c5c76c9c' size-in-bits='64' id='b7f9d8e6'/>
    <pointer-type-def type-id='c039af2e' size-in-bits='64' id='debb4ee8'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_fd_group' is-struct='yes' visibility='default' is-declaration-only='yes' id='c8d12ece'/>
    <class-decl name='spdk_ring' is-struct='yes' visibility='default' is-declaration-only='yes' id='f749e2ba'/>
    <function-decl name='spdk_thread_lib_init' mangled-name='spdk_thread_lib_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_thread_lib_init'>
      <parameter type-id='cf6adfe1' name='new_thread_fn'/>
      <parameter type-id='b59d7dce' name='ctx_sz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_thread_lib_init_ext' mangled-name='spdk_thread_lib_init_ext' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_thread_lib_init_ext'>
      <parameter type-id='fd7a9268' name='thread_op_fn'/>
      <parameter type-id='34a4e98f' name='thread_op_supported_fn'/>
      <parameter type-id='b59d7dce' name='ctx_sz'/>
      <return type-id='95e97e5e'/>
    </function-decl>
