<abi-corpus version='2.0' soname='libspdk_vhost.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.4.1'/>
    <dependency name='libspdk_util.so.4.1'/>
    <dependency name='libspdk_thread.so.6.1'/>
    <dependency name='libspdk_json.so.3.3'/>
    <dependency name='libspdk_jsonrpc.so.3.0'/>
    <dependency name='libspdk_rpc.so.3.0'/>
    <dependency name='libspdk_bdev.so.8.1'/>
    <dependency name='libspdk_scsi.so.4.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_vhost_blk_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_config_json' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_find' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_cpumask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_get_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_dev_remove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_get_coalescing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_add_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_get_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_scsi_dev_remove_tgt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_set_coalescing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_set_socket_path' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_trylock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_vhost_unlock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='rte_vhost_user.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='256' id='16dc656a'>
      <subrange length='32' type-id='7359adad' id='ae5bde82'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <union-decl name='sem_t' size-in-bits='256' naming-typedef-id='dd95b0ec' visibility='default' id='83e2ba5c'>
      <data-member access='public'>
        <var-decl name='__size' type-id='16dc656a' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='sem_t' type-id='83e2ba5c' id='dd95b0ec'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <function-decl name='spdk_vhost_set_coalescing' mangled-name='spdk_vhost_set_coalescing' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_coalescing'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='8f92235e' name='delay_base_us'/>
      <parameter type-id='8f92235e' name='iops_threshold'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_vhost_get_coalescing' mangled-name='spdk_vhost_get_coalescing' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_get_coalescing'>
      <parameter type-id='05d247e6' name='vdev'/>
      <parameter type-id='90421557' name='delay_base_us'/>
      <parameter type-id='90421557' name='iops_threshold'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_vhost_set_socket_path' mangled-name='spdk_vhost_set_socket_path' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_vhost_set_socket_path'>
      <parameter type-id='80f4b756' name='basename'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <var-decl name='g_dpdk_sem' type-id='dd95b0ec' visibility='default'/>
    <var-decl name='g_vhost_user_dev_dirname' type-id='d16c6df4' visibility='default'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr address-size='64' path='vhost.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='b7a93b96' size-in-bits='infinite' id='5f759053'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2056' id='cd5f2f4f'>
      <subrange length='257' type-id='7359adad' id='72e246d7'/>
    </array-type-def>
    <class-decl name='spdk_interrupt' is-struct='yes' visibility='default' is-declaration-only='yes' id='b9eb5d13'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <array-type-def dimensions='1' type-id='d1b72e72' size-in-bits='infinite' id='5c71793a'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='6d73568a' size-in-bits='infinite' id='5d212a52'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='238d8f50' size-in-bits='infinite' id='4347ecbc'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='ef74dbbd' size-in-bits='262144' id='61351b9a'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='1024' id='c768f32d'>
      <subrange length='128' type-id='7359adad' id='1eb1687a'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='40' id='0f4ddd0b'>
      <subrange length='5' type-id='7359adad' id='53010e10'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='56' id='d3538ec5'>
      <subrange length='7' type-id='7359adad' id='16fc326e'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <array-type-def dimensions='1' type-id='f1f6cfe9' size-in-bits='infinite' id='59d36c99'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <class-decl name='rte_vhost_mem_region' size-in-bits='448' is-struct='yes' visibility='default' id='238d8f50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='guest_phys_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='guest_user_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='host_user_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mmap_addr' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mmap_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fd' type-id='95e97e5e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_memory' size-in-bits='64' is-struct='yes' visibility='default' id='35ae1539'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nregions' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='regions' type-id='4347ecbc' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_inflight_desc_split' size-in-bits='128' is-struct='yes' visibility='default' id='6d73568a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inflight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='padding' type-id='0f4ddd0b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='next' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_inflight_info_split' size-in-bits='128' is-struct='yes' visibility='default' id='89a7c5df'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='desc_num' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='last_inflight_io' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='used_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='desc' type-id='5d212a52' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_inflight_desc_packed' size-in-bits='256' is-struct='yes' visibility='default' id='d1b72e72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='inflight' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='padding' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='next' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='last' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='num' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='flags' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='len' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_inflight_info_packed' size-in-bits='256' is-struct='yes' visibility='default' id='1ffa2f05'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='version' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='desc_num' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='free_head' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='old_free_head' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='old_used_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='used_wrap_counter' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='168'>
        <var-decl name='old_used_wrap_counter' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='padding' type-id='d3538ec5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='desc' type-id='5c71793a' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_resubmit_desc' size-in-bits='128' is-struct='yes' visibility='default' id='338b2335'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='counter' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_resubmit_info' size-in-bits='128' is-struct='yes' visibility='default' id='645c5d48'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='resubmit_list' type-id='b5bbb505' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resubmit_num' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='rte_vhost_ring_inflight' size-in-bits='128' is-struct='yes' visibility='default' id='be204c60'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab595' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='resubmit_inflight' type-id='8331dc8e' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__3' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='inflight_split' type-id='6f356977' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='inflight_packed' type-id='5e91f7e5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='rte_vhost_vring' size-in-bits='384' is-struct='yes' visibility='default' id='147d6cd2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='' type-id='ac5ab596' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='' type-id='ac5ab597' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='' type-id='ac5ab598' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='log_guest_addr' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='callfd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='kickfd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='size' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab596'>
      <data-member access='public'>
        <var-decl name='desc' type-id='a5e666e1' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='desc_packed' type-id='fadbc84e' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab597'>
      <data-member access='public'>
        <var-decl name='avail' type-id='79c5fcaf' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='driver_event' type-id='df089387' visibility='default'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='64' is-anonymous='yes' visibility='default' id='ac5ab598'>
      <data-member access='public'>
        <var-decl name='used' type-id='00f2075d' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='device_event' type-id='df089387' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='vring_desc' size-in-bits='128' is-struct='yes' visibility='default' id='f0783229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='b7a6fcff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='43ae9528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='next' type-id='b7a93b96' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_avail' size-in-bits='32' is-struct='yes' visibility='default' id='b3f6da27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='5f759053' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_used_elem' size-in-bits='64' is-struct='yes' visibility='default' id='f1f6cfe9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='43ae9528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='43ae9528' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_used' size-in-bits='32' is-struct='yes' visibility='default' id='83e62d3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='59d36c99' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_packed_desc_event' size-in-bits='32' is-struct='yes' visibility='default' id='91f8a4bf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='off_wrap' type-id='23119536' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='flags' type-id='23119536' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_packed_desc' size-in-bits='128' is-struct='yes' visibility='default' id='0423ab78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='a30e8d1f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='2f162548' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='id' type-id='23119536' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='flags' type-id='23119536' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__virtio16' type-id='d315442e' id='b7a93b96'/>
    <typedef-decl name='__virtio32' type-id='3f1a6b60' id='43ae9528'/>
    <typedef-decl name='__virtio64' type-id='d3130597' id='b7a6fcff'/>
    <class-decl name='spdk_cpuset' size-in-bits='3080' is-struct='yes' visibility='default' id='aec5215a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='cd5f2f4f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='cpus' type-id='c768f32d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_vhost_init_cb' type-id='03347643' id='e7e0eab8'/>
    <typedef-decl name='spdk_vhost_fini_cb' type-id='953b12f8' id='c30658ee'/>
    <class-decl name='spdk_vhost_virtqueue' size-in-bits='1024' is-struct='yes' visibility='default' id='ef74dbbd'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vring' type-id='147d6cd2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vring_inflight' type-id='be204c60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='last_avail_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='528'>
        <var-decl name='last_used_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='packed' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tasks' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='req_cnt' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='used_req_cnt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='irq_delay_time' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='next_event_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vring_idx' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='vsession' type-id='f6ba6e2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='intr' type-id='aaf85c13' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='avail_phase' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1'>
        <var-decl name='used_phase' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2'>
        <var-decl name='padding' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7'>
        <var-decl name='packed_ring' type-id='c894953d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vhost_session' size-in-bits='263680' is-struct='yes' visibility='default' id='b1fd338b'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vdev' type-id='05d247e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vid' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='id' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='initialized' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='started' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='272'>
        <var-decl name='needs_restart' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='280'>
        <var-decl name='forced_polling' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='interrupt_mode' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mem' type-id='9f19d561' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='task_cnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='max_queues' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='negotiated_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='coalescing_delay_time_base' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='coalescing_io_rate_threshold' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next_stats_check_time' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='stats_check_interval' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='stop_retry_count' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='virtqueue' type-id='61351b9a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='263168'>
        <var-decl name='tailq' type-id='e7f43f73' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f6ba6e2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='687b2b93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vhost_dev' size-in-bits='960' is-struct='yes' visibility='default' id='4e8a23c0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='path' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='registered' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='virtio_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='disabled_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='protocol_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='backend' type-id='b7db1e6c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='coalescing_delay_us' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='coalescing_iops_threshold' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vsessions' type-id='e7f43f74' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='vsessions_num' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='active_session_num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='pending_async_op_num' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tailq' type-id='e7f43f75' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f6ba6e2b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='687b2b93' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='05d247e6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='f6070624' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_vhost_dev_backend' size-in-bits='512' is-struct='yes' visibility='default' id='3d671967'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='session_ctx_size' type-id='b59d7dce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='start_session' type-id='ff253ba5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stop_session' type-id='ff253ba5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='vhost_get_config' type-id='8a85dbc8' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vhost_set_config' type-id='60e00dcc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='dump_info_json' type-id='4abd9d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='write_config_json' type-id='4abd9d34' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='remove_device' type-id='7b272674' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__u16' type-id='8efea9e5' id='d315442e'/>
    <typedef-decl name='__u32' type-id='f0981eeb' id='3f1a6b60'/>
    <typedef-decl name='__u64' type-id='3a47d82b' id='d3130597'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <typedef-decl name='__le16' type-id='d315442e' id='23119536'/>
    <typedef-decl name='__le32' type-id='3f1a6b60' id='2f162548'/>
    <typedef-decl name='__le64' type-id='d3130597' id='a30e8d1f'/>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='aec5215a' const='yes' id='04ae283d'/>
    <pointer-type-def type-id='04ae283d' size-in-bits='64' id='75291c35'/>
    <qualified-type-def type-id='3d671967' const='yes' id='6b901b4e'/>
    <pointer-type-def type-id='6b901b4e' size-in-bits='64' id='b7db1e6c'/>
    <pointer-type-def type-id='a93a8ffa' size-in-bits='64' id='7b272674'/>
    <pointer-type-def type-id='9d3906ee' size-in-bits='64' id='8a85dbc8'/>
    <pointer-type-def type-id='50c0d11a' size-in-bits='64' id='60e00dcc'/>
    <pointer-type-def type-id='f935b141' size-in-bits='64' id='ff253ba5'/>
    <pointer-type-def type-id='1ffa2f05' size-in-bits='64' id='5e91f7e5'/>
    <pointer-type-def type-id='89a7c5df' size-in-bits='64' id='6f356977'/>
    <pointer-type-def type-id='35ae1539' size-in-bits='64' id='9f19d561'/>
    <pointer-type-def type-id='338b2335' size-in-bits='64' id='b5bbb505'/>
    <pointer-type-def type-id='645c5d48' size-in-bits='64' id='8331dc8e'/>
    <pointer-type-def type-id='b9eb5d13' size-in-bits='64' id='aaf85c13'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='4e8a23c0' size-in-bits='64' id='05d247e6'/>
    <pointer-type-def type-id='05d247e6' size-in-bits='64' id='f6070624'/>
    <pointer-type-def type-id='b1fd338b' size-in-bits='64' id='f6ba6e2b'/>
    <pointer-type-def type-id='f6ba6e2b' size-in-bits='64' id='687b2b93'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='ee076206' size-in-bits='64' id='953b12f8'/>
    <pointer-type-def type-id='f712e2b7' size-in-bits='64' id='03347643'/>
    <pointer-type-def type-id='9b4d63a2' size-in-bits='64' id='4abd9d34'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='b3f6da27' size-in-bits='64' id='79c5fcaf'/>
    <pointer-type-def type-id='f0783229' size-in-bits='64' id='a5e666e1'/>
    <pointer-type-def type-id='0423ab78' size-in-bits='64' id='fadbc84e'/>
    <pointer-type-def type-id='91f8a4bf' size-in-bits='64' id='df089387'/>
    <pointer-type-def type-id='83e62d3d' size-in-bits='64' id='00f2075d'/>
    <class-decl name='spdk_interrupt' is-struct='yes' visibility='default' is-declaration-only='yes' id='b9eb5d13'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
