<abi-corpus version='2.0' soname='libspdk_reduce.so.3.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.4.1'/>
    <dependency name='libspdk_util.so.4.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_reduce_vol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_params' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_get_uuid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_print_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_readv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_reduce_vol_writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='reduce.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='cfe40fb1'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='0f042891' size-in-bits='2432' id='66e4651b'>
      <subrange length='19' type-id='7359adad' id='448ee30f'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='9c313c2d' size-in-bits='infinite' id='f3b77084'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='32384' id='3897ac24'>
      <subrange length='4048' type-id='7359adad' id='c71099dd'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='64' id='13339fda'>
      <subrange length='8' type-id='7359adad' id='56e0c0b1'/>
    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <class-decl name='spdk_reduce_vol_params' size-in-bits='320' is-struct='yes' visibility='default' id='0b287997'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backing_io_unit_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='logical_block_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='chunk_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='vol_size' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_reduce_vol_op_complete' type-id='1ed1e4cd' id='3d61569b'/>
    <typedef-decl name='spdk_reduce_vol_op_with_handle_complete' type-id='dfc70b88' id='3eca1faf'/>
    <typedef-decl name='spdk_reduce_dev_cpl' type-id='1ed1e4cd' id='f73e6af3'/>
    <class-decl name='spdk_reduce_vol_cb_args' size-in-bits='128' is-struct='yes' visibility='default' id='e8c5eb18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='f73e6af3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_backing_dev' size-in-bits='448' is-struct='yes' visibility='default' id='cac77be0'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='readv' type-id='10bf7d32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='writev' type-id='10bf7d32' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unmap' type-id='1eafb33f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='compress' type-id='a0eaa756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='decompress' type-id='a0eaa756' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='spdk_reduce_vol_superblock' size-in-bits='32768' is-struct='yes' visibility='default' id='21e698f9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='signature' type-id='13339fda' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='params' type-id='0b287997' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='reserved' type-id='3897ac24' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_pm_file' size-in-bits='32960' is-struct='yes' visibility='default' id='32e69baf'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='path' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32768'>
        <var-decl name='pm_buf' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32832'>
        <var-decl name='pm_is_pmem' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32896'>
        <var-decl name='size' type-id='9c313c2d' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_chunk_map' size-in-bits='64' is-struct='yes' visibility='default' id='9237e7e9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='compressed_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='reserved' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='io_unit_index' type-id='f3b77084' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol_request' size-in-bits='3840' is-struct='yes' visibility='default' id='54915d16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='decomp_buf' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='decomp_buf_iov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='decomp_iov' type-id='66e4651b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='decomp_iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='comp_buf' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='comp_buf_iov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='iov' type-id='cc4b1be9' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='rmw' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='vol' type-id='28881962' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='type' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2976'>
        <var-decl name='reduce_errno' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='iovcnt' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='num_backing_ops' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='num_io_units' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='chunk_is_compressed' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='offset' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='logical_map_index' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='length' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='chunk_map_index' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='chunk' type-id='5ab15041' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3456'>
        <var-decl name='cb_fn' type-id='3d61569b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3520'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='tailq' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3712'>
        <var-decl name='backing_cb_args' type-id='e8c5eb18' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='f12675bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='358b1b22' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_reduce_vol' size-in-bits='34432' is-struct='yes' visibility='default' id='cc95dfe4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='params' type-id='0b287997' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='backing_io_units_per_chunk' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='backing_lba_per_io_unit' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='logical_blocks_per_chunk' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='pm_file' type-id='32e69baf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33408'>
        <var-decl name='backing_dev' type-id='5822c6f6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33472'>
        <var-decl name='backing_super' type-id='6991d551' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33536'>
        <var-decl name='pm_super' type-id='6991d551' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33600'>
        <var-decl name='pm_logical_map' type-id='5d6479ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33664'>
        <var-decl name='pm_chunk_maps' type-id='5d6479ae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33728'>
        <var-decl name='allocated_chunk_maps' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33792'>
        <var-decl name='allocated_backing_io_units' type-id='6ef42d89' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33856'>
        <var-decl name='request_mem' type-id='f12675bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='33920'>
        <var-decl name='free_requests' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34048'>
        <var-decl name='executing_requests' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34176'>
        <var-decl name='queued_requests' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34304'>
        <var-decl name='buf_mem' type-id='ae3e8ca6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='34368'>
        <var-decl name='buf_iov_mem' type-id='cc4b1be9' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='f12675bc' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='358b1b22' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='0b287997' const='yes' id='67adba22'/>
    <pointer-type-def type-id='67adba22' size-in-bits='64' id='3e7bda98'/>
    <qualified-type-def type-id='429c70d3' const='yes' id='2ecf4438'/>
    <pointer-type-def type-id='2ecf4438' size-in-bits='64' id='c2482856'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='cfe40fb1' size-in-bits='64' id='6ef42d89'/>
    <pointer-type-def type-id='cac77be0' size-in-bits='64' id='5822c6f6'/>
    <pointer-type-def type-id='9237e7e9' size-in-bits='64' id='5ab15041'/>
    <pointer-type-def type-id='cc95dfe4' size-in-bits='64' id='28881962'/>
    <pointer-type-def type-id='e8c5eb18' size-in-bits='64' id='a41aa92e'/>
    <pointer-type-def type-id='0b287997' size-in-bits='64' id='e453fa8f'/>
    <pointer-type-def type-id='54915d16' size-in-bits='64' id='f12675bc'/>
    <pointer-type-def type-id='f12675bc' size-in-bits='64' id='358b1b22'/>
    <pointer-type-def type-id='21e698f9' size-in-bits='64' id='6991d551'/>
    <pointer-type-def type-id='9c313c2d' size-in-bits='64' id='5d6479ae'/>
    <pointer-type-def type-id='b96825af' size-in-bits='64' id='ae3e8ca6'/>
    <pointer-type-def type-id='df337ec4' size-in-bits='64' id='a0eaa756'/>
    <pointer-type-def type-id='9ec89368' size-in-bits='64' id='10bf7d32'/>
    <pointer-type-def type-id='4e0baffb' size-in-bits='64' id='1eafb33f'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='cb78485e' size-in-bits='64' id='dfc70b88'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_bit_array' is-struct='yes' visibility='default' is-declaration-only='yes' id='cfe40fb1'/>
    <function-decl name='spdk_reduce_vol_get_uuid' mangled-name='spdk_reduce_vol_get_uuid' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_uuid'>
      <parameter type-id='28881962' name='vol'/>
      <return type-id='c2482856'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_init' mangled-name='spdk_reduce_vol_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_init'>
      <parameter type-id='e453fa8f' name='params'/>
      <parameter type-id='5822c6f6' name='backing_dev'/>
      <parameter type-id='80f4b756' name='pm_file_dir'/>
      <parameter type-id='3eca1faf' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_load' mangled-name='spdk_reduce_vol_load' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_load'>
      <parameter type-id='5822c6f6' name='backing_dev'/>
      <parameter type-id='3eca1faf' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_unload' mangled-name='spdk_reduce_vol_unload' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_unload'>
      <parameter type-id='28881962' name='vol'/>
      <parameter type-id='3d61569b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_destroy' mangled-name='spdk_reduce_vol_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_destroy'>
      <parameter type-id='5822c6f6' name='backing_dev'/>
      <parameter type-id='3d61569b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_readv' mangled-name='spdk_reduce_vol_readv' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_readv'>
      <parameter type-id='28881962' name='vol'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='length'/>
      <parameter type-id='3d61569b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_writev' mangled-name='spdk_reduce_vol_writev' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_writev'>
      <parameter type-id='28881962' name='vol'/>
      <parameter type-id='cc4b1be9' name='iov'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <parameter type-id='9c313c2d' name='offset'/>
      <parameter type-id='9c313c2d' name='length'/>
      <parameter type-id='3d61569b' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_get_params' mangled-name='spdk_reduce_vol_get_params' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_get_params'>
      <parameter type-id='28881962' name='vol'/>
      <return type-id='3e7bda98'/>
    </function-decl>
    <function-decl name='spdk_reduce_vol_print_info' mangled-name='spdk_reduce_vol_print_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_reduce_vol_print_info'>
      <parameter type-id='28881962' name='vol'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='df337ec4'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='9ec89368'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='4e0baffb'>
      <parameter type-id='5822c6f6'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='a41aa92e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='cb78485e'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='28881962'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
