<abi-corpus version='2.0' soname='libspdk_lvol.so.5.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.4.1'/>
    <dependency name='libspdk_util.so.4.1'/>
    <dependency name='libspdk_blob.so.6.0'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='spdk_lvol_close' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_clone' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_create_snapshot' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_decouple_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_deletable' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_get_io_channel' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_inflate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_open' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_rename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_resize' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvol_set_read_only' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_destroy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_load' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_opts_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_rename' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='spdk_lvs_unload' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='lvol.c' language='LANG_C99'>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='296' id='12e4ade3'>
      <subrange length='37' type-id='7359adad' id='aa6426fb'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='464' id='64ad9dae'>
      <subrange length='58' type-id='7359adad' id='fc047456'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='512' id='59daf3ef'>
      <subrange length='64' type-id='7359adad' id='b10be967'/>
    </array-type-def>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_blob' is-struct='yes' visibility='default' is-declaration-only='yes' id='396cf9f3'/>
    <class-decl name='spdk_blob_store' is-struct='yes' visibility='default' is-declaration-only='yes' id='90246e15'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <array-type-def dimensions='1' type-id='b96825af' size-in-bits='128' id='fa9986a5'>
      <subrange length='16' type-id='7359adad' id='848d0938'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='void' id='48b5725f'/>
    <typedef-decl name='spdk_blob_id' type-id='9c313c2d' id='533eb244'/>
    <enum-decl name='blob_clear_method' id='6486fbcf'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='BLOB_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='BLOB_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='BLOB_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='BLOB_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <typedef-decl name='spdk_bs_dev_cpl' type-id='6e11a86a' id='7683f572'/>
    <class-decl name='spdk_bs_dev_cb_args' size-in-bits='192' is-struct='yes' visibility='default' id='c0d240d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cb_fn' type-id='7683f572' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='channel' type-id='a7e01876' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cb_arg' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_bs_dev' size-in-bits='832' is-struct='yes' visibility='default' id='c7372297'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='create_channel' type-id='d013fa97' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='destroy_channel' type-id='264c8cbd' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='destroy' type-id='21f143ce' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='read' type-id='58f9cf40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='write' type-id='58f9cf40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='readv' type-id='d623a815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='writev' type-id='d623a815' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='flush' type-id='2ce17223' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='write_zeroes' type-id='2c0ca573' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='unmap' type-id='2c0ca573' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='get_base_bdev' type-id='4c29f0d0' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='blockcnt' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='blocklen' type-id='8f92235e' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='lvol_clear_method' id='78195891'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVOL_CLEAR_WITH_DEFAULT' value='0'/>
      <enumerator name='LVOL_CLEAR_WITH_NONE' value='1'/>
      <enumerator name='LVOL_CLEAR_WITH_UNMAP' value='2'/>
      <enumerator name='LVOL_CLEAR_WITH_WRITE_ZEROES' value='3'/>
    </enum-decl>
    <enum-decl name='lvs_clear_method' id='b9d2071b'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='LVS_CLEAR_WITH_UNMAP' value='0'/>
      <enumerator name='LVS_CLEAR_WITH_WRITE_ZEROES' value='1'/>
      <enumerator name='LVS_CLEAR_WITH_NONE' value='2'/>
    </enum-decl>
    <class-decl name='spdk_lvs_opts' size-in-bits='576' is-struct='yes' visibility='default' id='3543c05e'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cluster_sz' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='clear_method' type-id='b9d2071b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='spdk_lvs_op_with_handle_complete' type-id='6cb69b9f' id='5d9bdc8a'/>
    <typedef-decl name='spdk_lvs_op_complete' type-id='1ed1e4cd' id='1405f9e6'/>
    <typedef-decl name='spdk_lvol_op_with_handle_complete' type-id='ef8691f1' id='7c4e9e6e'/>
    <typedef-decl name='spdk_lvol_op_complete' type-id='1ed1e4cd' id='d6a4099a'/>
    <class-decl name='spdk_uuid' size-in-bits='128' is-struct='yes' visibility='default' id='429c70d3'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='u' type-id='ac5ab595' visibility='default'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' id='ac5ab595'>
      <data-member access='public'>
        <var-decl name='raw' type-id='fa9986a5' visibility='default'/>
      </data-member>
    </union-decl>
    <class-decl name='spdk_lvol_store' size-in-bits='1984' is-struct='yes' visibility='default' id='78ce766f'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bs_dev' type-id='44388ddf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blobstore' type-id='07fd40b5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='super_blob' type-id='89e1f283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='super_blob_id' type-id='533eb244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lvol_count' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvols_opened' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='destruct' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='lvols' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='pending_lvols' type-id='e7f43f72' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='on_list' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='link' type-id='e7f43f73' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='new_name' type-id='59daf3ef' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqh_first' type-id='b1c2c545' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqh_last' type-id='449ccdbd' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='4c655657' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='c08726c7' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='spdk_lvol' size-in-bits='1920' is-struct='yes' visibility='default' id='7b976e75'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='lvol_store' type-id='4c655657' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='blob' type-id='89e1f283' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='blob_id' type-id='533eb244' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='unique_id' type-id='64ad9dae' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='656'>
        <var-decl name='name' type-id='59daf3ef' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1168'>
        <var-decl name='uuid' type-id='429c70d3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1296'>
        <var-decl name='uuid_str' type-id='12e4ade3' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1592'>
        <var-decl name='thin_provision' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='bdev' type-id='7b7cfb3d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='ref_count' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1696'>
        <var-decl name='action_in_progress' type-id='c894953d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='clear_method' type-id='6486fbcf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='link' type-id='e7f43f74' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' id='e7f43f74'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tqe_next' type-id='b1c2c545' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tqe_prev' type-id='449ccdbd' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='f6507fdd' size-in-bits='64' id='7b7cfb3d'/>
    <pointer-type-def type-id='7f5edace' size-in-bits='64' id='4c29f0d0'/>
    <pointer-type-def type-id='396cf9f3' size-in-bits='64' id='89e1f283'/>
    <pointer-type-def type-id='90246e15' size-in-bits='64' id='07fd40b5'/>
    <pointer-type-def type-id='c7372297' size-in-bits='64' id='44388ddf'/>
    <pointer-type-def type-id='c0d240d3' size-in-bits='64' id='d8768e33'/>
    <pointer-type-def type-id='8de5f3c0' size-in-bits='64' id='a7e01876'/>
    <pointer-type-def type-id='5f1f8343' size-in-bits='64' id='d013fa97'/>
    <pointer-type-def type-id='7b976e75' size-in-bits='64' id='b1c2c545'/>
    <pointer-type-def type-id='b1c2c545' size-in-bits='64' id='449ccdbd'/>
    <pointer-type-def type-id='78ce766f' size-in-bits='64' id='4c655657'/>
    <pointer-type-def type-id='4c655657' size-in-bits='64' id='c08726c7'/>
    <pointer-type-def type-id='3543c05e' size-in-bits='64' id='96eba214'/>
    <pointer-type-def type-id='faef6e24' size-in-bits='64' id='21f143ce'/>
    <pointer-type-def type-id='d8775801' size-in-bits='64' id='264c8cbd'/>
    <pointer-type-def type-id='e26e4709' size-in-bits='64' id='d623a815'/>
    <pointer-type-def type-id='aa39dfd7' size-in-bits='64' id='2ce17223'/>
    <pointer-type-def type-id='f8e9e347' size-in-bits='64' id='2c0ca573'/>
    <pointer-type-def type-id='7c54d78e' size-in-bits='64' id='58f9cf40'/>
    <pointer-type-def type-id='72d56e00' size-in-bits='64' id='6e11a86a'/>
    <pointer-type-def type-id='2922fb19' size-in-bits='64' id='1ed1e4cd'/>
    <pointer-type-def type-id='6144871d' size-in-bits='64' id='ef8691f1'/>
    <pointer-type-def type-id='87f1997b' size-in-bits='64' id='6cb69b9f'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <class-decl name='spdk_bdev' is-struct='yes' visibility='default' is-declaration-only='yes' id='f6507fdd'/>
    <class-decl name='spdk_blob' is-struct='yes' visibility='default' is-declaration-only='yes' id='396cf9f3'/>
    <class-decl name='spdk_blob_store' is-struct='yes' visibility='default' is-declaration-only='yes' id='90246e15'/>
    <class-decl name='spdk_io_channel' is-struct='yes' visibility='default' is-declaration-only='yes' id='8de5f3c0'/>
    <function-decl name='spdk_lvol_open' mangled-name='spdk_lvol_open' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_open'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='7c4e9e6e' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvs_load' mangled-name='spdk_lvs_load' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_load'>
      <parameter type-id='44388ddf' name='bs_dev'/>
      <parameter type-id='5d9bdc8a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvs_opts_init' mangled-name='spdk_lvs_opts_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_opts_init'>
      <parameter type-id='96eba214' name='o'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvs_init' mangled-name='spdk_lvs_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_init'>
      <parameter type-id='44388ddf' name='bs_dev'/>
      <parameter type-id='96eba214' name='o'/>
      <parameter type-id='5d9bdc8a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_lvs_rename' mangled-name='spdk_lvs_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_rename'>
      <parameter type-id='4c655657' name='lvs'/>
      <parameter type-id='80f4b756' name='new_name'/>
      <parameter type-id='1405f9e6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvs_unload' mangled-name='spdk_lvs_unload' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_unload'>
      <parameter type-id='4c655657' name='lvs'/>
      <parameter type-id='1405f9e6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_lvs_destroy' mangled-name='spdk_lvs_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvs_destroy'>
      <parameter type-id='4c655657' name='lvs'/>
      <parameter type-id='1405f9e6' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_lvol_deletable' mangled-name='spdk_lvol_deletable' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_deletable'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='spdk_lvol_create' mangled-name='spdk_lvol_create' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_create'>
      <parameter type-id='4c655657' name='lvs'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='9c313c2d' name='sz'/>
      <parameter type-id='c894953d' name='thin_provision'/>
      <parameter type-id='78195891' name='clear_method'/>
      <parameter type-id='7c4e9e6e' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='spdk_lvol_create_snapshot' mangled-name='spdk_lvol_create_snapshot' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_create_snapshot'>
      <parameter type-id='b1c2c545' name='origlvol'/>
      <parameter type-id='80f4b756' name='snapshot_name'/>
      <parameter type-id='7c4e9e6e' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_create_clone' mangled-name='spdk_lvol_create_clone' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_create_clone'>
      <parameter type-id='b1c2c545' name='origlvol'/>
      <parameter type-id='80f4b756' name='clone_name'/>
      <parameter type-id='7c4e9e6e' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_resize' mangled-name='spdk_lvol_resize' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_resize'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='9c313c2d' name='sz'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_set_read_only' mangled-name='spdk_lvol_set_read_only' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_set_read_only'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_rename' mangled-name='spdk_lvol_rename' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_rename'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='80f4b756' name='new_name'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_destroy' mangled-name='spdk_lvol_destroy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_destroy'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_close' mangled-name='spdk_lvol_close' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_close'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_get_io_channel' mangled-name='spdk_lvol_get_io_channel' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_get_io_channel'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <return type-id='a7e01876'/>
    </function-decl>
    <function-decl name='spdk_lvol_inflate' mangled-name='spdk_lvol_inflate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_inflate'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='spdk_lvol_decouple_parent' mangled-name='spdk_lvol_decouple_parent' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='spdk_lvol_decouple_parent'>
      <parameter type-id='b1c2c545' name='lvol'/>
      <parameter type-id='d6a4099a' name='cb_fn'/>
      <parameter type-id='eaa32e2f' name='cb_arg'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='7f5edace'>
      <parameter type-id='44388ddf'/>
      <return type-id='7b7cfb3d'/>
    </function-type>
    <function-type size-in-bits='64' id='5f1f8343'>
      <parameter type-id='44388ddf'/>
      <return type-id='a7e01876'/>
    </function-type>
    <function-type size-in-bits='64' id='faef6e24'>
      <parameter type-id='44388ddf'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='d8775801'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='e26e4709'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='cc4b1be9'/>
      <parameter type-id='95e97e5e'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='aa39dfd7'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='f8e9e347'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='7c54d78e'>
      <parameter type-id='44388ddf'/>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='9c313c2d'/>
      <parameter type-id='8f92235e'/>
      <parameter type-id='d8768e33'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='72d56e00'>
      <parameter type-id='a7e01876'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='2922fb19'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='6144871d'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='b1c2c545'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='87f1997b'>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='4c655657'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
</abi-corpus>
