<abi-corpus version='2.0' soname='libspdk_virtio.so.3.0'>
  <elf-needed>
    <dependency name='libspdk_log.so.4.1'/>
    <dependency name='libspdk_util.so.4.1'/>
    <dependency name='libspdk_json.so.3.3'/>
    <dependency name='libspdk_thread.so.6.1'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='virtio_dev_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_backend_ops' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_construct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_destruct' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_dump_json_info' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_find_and_acquire_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_get_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_queue_get_thread' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_queue_is_acquired' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_read_dev_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_release_queue' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_set_status' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_stop' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_dev_write_dev_config' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_attach' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_enumerate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_event_process' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_pci_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_recv_pkts' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtio_user_dev_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_abort' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_add_iovs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_flush' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='virtqueue_req_start' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='vhost_user.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='32768' id='d16c6df4'>
      <subrange length='4096' type-id='7359adad' id='bc1b5ddc'/>
    </array-type-def>
    <class-decl name='spdk_mem_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='ba933a44'/>
    <array-type-def dimensions='1' type-id='95e97e5e' size-in-bits='8192' id='15cefd37'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='83eac9f7' size-in-bits='65536' id='71aabfc4'>
      <subrange length='256' type-id='7359adad' id='36e5b9fa'/>
    </array-type-def>
    <enum-decl name='vhost_user_request' id='033e2994'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='VHOST_USER_NONE' value='0'/>
      <enumerator name='VHOST_USER_GET_FEATURES' value='1'/>
      <enumerator name='VHOST_USER_SET_FEATURES' value='2'/>
      <enumerator name='VHOST_USER_SET_OWNER' value='3'/>
      <enumerator name='VHOST_USER_RESET_OWNER' value='4'/>
      <enumerator name='VHOST_USER_SET_MEM_TABLE' value='5'/>
      <enumerator name='VHOST_USER_SET_LOG_BASE' value='6'/>
      <enumerator name='VHOST_USER_SET_LOG_FD' value='7'/>
      <enumerator name='VHOST_USER_SET_VRING_NUM' value='8'/>
      <enumerator name='VHOST_USER_SET_VRING_ADDR' value='9'/>
      <enumerator name='VHOST_USER_SET_VRING_BASE' value='10'/>
      <enumerator name='VHOST_USER_GET_VRING_BASE' value='11'/>
      <enumerator name='VHOST_USER_SET_VRING_KICK' value='12'/>
      <enumerator name='VHOST_USER_SET_VRING_CALL' value='13'/>
      <enumerator name='VHOST_USER_SET_VRING_ERR' value='14'/>
      <enumerator name='VHOST_USER_GET_PROTOCOL_FEATURES' value='15'/>
      <enumerator name='VHOST_USER_SET_PROTOCOL_FEATURES' value='16'/>
      <enumerator name='VHOST_USER_GET_QUEUE_NUM' value='17'/>
      <enumerator name='VHOST_USER_SET_VRING_ENABLE' value='18'/>
      <enumerator name='VHOST_USER_SEND_RARP' value='19'/>
      <enumerator name='VHOST_USER_NET_SET_MTU' value='20'/>
      <enumerator name='VHOST_USER_SET_SLAVE_REQ_FD' value='21'/>
      <enumerator name='VHOST_USER_IOTLB_MSG' value='22'/>
      <enumerator name='VHOST_USER_GET_CONFIG' value='24'/>
      <enumerator name='VHOST_USER_SET_CONFIG' value='25'/>
      <enumerator name='VHOST_USER_CRYPTO_CREATE_SESS' value='26'/>
      <enumerator name='VHOST_USER_CRYPTO_CLOSE_SESS' value='27'/>
      <enumerator name='VHOST_USER_POSTCOPY_ADVISE' value='28'/>
      <enumerator name='VHOST_USER_POSTCOPY_LISTEN' value='29'/>
      <enumerator name='VHOST_USER_POSTCOPY_END' value='30'/>
      <enumerator name='VHOST_USER_MAX' value='31'/>
    </enum-decl>
    <class-decl name='virtio_user_dev' size-in-bits='115008' is-struct='yes' visibility='default' id='a58f89d4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vhostfd' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='callfds' type-id='15cefd37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8224'>
        <var-decl name='kickfds' type-id='15cefd37' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16416'>
        <var-decl name='queue_size' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16448'>
        <var-decl name='status' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16456'>
        <var-decl name='path' type-id='d16c6df4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49280'>
        <var-decl name='protocol_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='49344'>
        <var-decl name='vrings' type-id='71aabfc4' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='114880'>
        <var-decl name='ops' type-id='1f389bb2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='114944'>
        <var-decl name='mem_map' type-id='73c19462' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_user_backend_ops' size-in-bits='128' is-struct='yes' visibility='default' id='c0a2ae14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='setup' type-id='99ec2192' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_request' type-id='9bcf7947' visibility='default'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='a2d00280' size-in-bits='64' id='99ec2192'/>
    <pointer-type-def type-id='0614b43b' size-in-bits='64' id='9bcf7947'/>
    <pointer-type-def type-id='ba933a44' size-in-bits='64' id='73c19462'/>
    <pointer-type-def type-id='c0a2ae14' size-in-bits='64' id='1f389bb2'/>
    <pointer-type-def type-id='a58f89d4' size-in-bits='64' id='a1647992'/>
    <class-decl name='spdk_mem_map' is-struct='yes' visibility='default' is-declaration-only='yes' id='ba933a44'/>
    <var-decl name='ops_user' type-id='c0a2ae14' visibility='default'/>
    <function-type size-in-bits='64' id='a2d00280'>
      <parameter type-id='a1647992'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='0614b43b'>
      <parameter type-id='a1647992'/>
      <parameter type-id='033e2994'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
  </abi-instr>
  <abi-instr address-size='64' path='virtio.c' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='b7a93b96' size-in-bits='infinite' id='5f759053'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <type-decl name='bool' size-in-bits='8' id='c894953d'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='320' id='36c46961'>
      <subrange length='40' type-id='7359adad' id='8f80b239'/>
    </array-type-def>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long int' size-in-bits='64' id='bd54fe1a'/>
    <type-decl name='long long unsigned int' size-in-bits='64' id='3a47d82b'/>
    <type-decl name='short int' size-in-bits='16' id='a2185560'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='9cac1fee'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='7359adad'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='8efea9e5'/>
    <type-decl name='void' id='48b5725f'/>
    <array-type-def dimensions='1' type-id='fb448689' size-in-bits='infinite' id='f3c55529'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='f1f6cfe9' size-in-bits='infinite' id='59d36c99'>
      <subrange length='infinite' type-id='7359adad' id='031f2035'/>
    </array-type-def>
    <class-decl name='vring_desc' size-in-bits='128' is-struct='yes' visibility='default' id='f0783229'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='addr' type-id='b7a6fcff' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='43ae9528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='next' type-id='b7a93b96' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_avail' size-in-bits='32' is-struct='yes' visibility='default' id='b3f6da27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='5f759053' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_used_elem' size-in-bits='64' is-struct='yes' visibility='default' id='f1f6cfe9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='id' type-id='43ae9528' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='len' type-id='43ae9528' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring_used' size-in-bits='32' is-struct='yes' visibility='default' id='83e62d3d'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='flags' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='idx' type-id='b7a93b96' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ring' type-id='59d36c99' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vring' size-in-bits='256' is-struct='yes' visibility='default' id='83eac9f7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='desc' type-id='a5e666e1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='avail' type-id='79c5fcaf' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='used' type-id='00f2075d' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__virtio16' type-id='d315442e' id='b7a93b96'/>
    <typedef-decl name='__virtio32' type-id='3f1a6b60' id='43ae9528'/>
    <typedef-decl name='__virtio64' type-id='d3130597' id='b7a6fcff'/>
    <class-decl name='virtio_dev' size-in-bits='768' is-struct='yes' visibility='default' id='220c9082'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vqs' type-id='06ce3ba1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='26a90f95' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='fixed_queues_num' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='144'>
        <var-decl name='max_queues' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='negotiated_features' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='is_hw' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='modern' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='mutex' type-id='7a6844eb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='backend_ops' type-id='7fd10606' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='ctx' type-id='eaa32e2f' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='virtio_dev_ops' size-in-bits='832' is-struct='yes' visibility='default' id='eca1d791'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='read_dev_cfg' type-id='80d5ec40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='write_dev_cfg' type-id='80d5ec40' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_status' type-id='0d4ba885' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='set_status' type-id='5d58cff1' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='get_features' type-id='0c31978b' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='set_features' type-id='231998da' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='destruct_dev' type-id='ea4b0ff5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='get_queue_size' type-id='ca0db7d5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='setup_queue' type-id='c53a950e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='del_queue' type-id='3dd6b921' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_queue' type-id='3dd6b921' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dump_json_info' type-id='715d4cd2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='write_json_config' type-id='715d4cd2' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='vq_desc_extra' size-in-bits='128' is-struct='yes' visibility='default' id='fb448689'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cookie' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ndescs' type-id='149c6638' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='virtqueue' size-in-bits='832' is-struct='yes' visibility='default' id='d7c60ba9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vdev' type-id='c4ba6c30' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vq_ring' type-id='83eac9f7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='vq_used_cons_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='336'>
        <var-decl name='vq_nentries' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='vq_free_cnt' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='368'>
        <var-decl name='vq_avail_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='vq_ring_virt_mem' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vq_ring_size' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='vq_ring_mem' type-id='9c313c2d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='vq_desc_head_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='592'>
        <var-decl name='vq_desc_tail_idx' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='vq_queue_index' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='notify_addr' type-id='8a121f49' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='owner_thread' type-id='f8fcfe66' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='req_start' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='784'>
        <var-decl name='req_end' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='800'>
        <var-decl name='reqs_finished' type-id='149c6638' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='vq_descx' type-id='f3c55529' visibility='default'/>
      </data-member>
    </class-decl>
    <enum-decl name='spdk_virtio_desc_type' id='82458b79'>
      <underlying-type type-id='9cac1fee'/>
      <enumerator name='SPDK_VIRTIO_DESC_RO' value='0'/>
      <enumerator name='SPDK_VIRTIO_DESC_WR' value='2'/>
    </enum-decl>
    <typedef-decl name='__u16' type-id='8efea9e5' id='d315442e'/>
    <typedef-decl name='__u32' type-id='f0981eeb' id='3f1a6b60'/>
    <typedef-decl name='__u64' type-id='3a47d82b' id='d3130597'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='7a6844eb' visibility='default' id='70681f9b'>
      <data-member access='public'>
        <var-decl name='__data' type-id='4c734837' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='36c46961' visibility='default'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='bd54fe1a' visibility='default'/>
      </data-member>
    </union-decl>
    <typedef-decl name='pthread_mutex_t' type-id='70681f9b' id='7a6844eb'/>
    <typedef-decl name='int32_t' type-id='33f57a65' id='3ff5601b'/>
    <typedef-decl name='uint8_t' type-id='c51d6389' id='b96825af'/>
    <typedef-decl name='uint16_t' type-id='253c2d2a' id='149c6638'/>
    <typedef-decl name='uint32_t' type-id='62f1140c' id='8f92235e'/>
    <typedef-decl name='uint64_t' type-id='8910171f' id='9c313c2d'/>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' id='4c734837'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='a2185560' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='518fb49c' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' id='0e01899c'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='4d98cd5a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='4d98cd5a' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='0e01899c' id='518fb49c'/>
    <typedef-decl name='__uint8_t' type-id='002ac4a6' id='c51d6389'/>
    <typedef-decl name='__uint16_t' type-id='8efea9e5' id='253c2d2a'/>
    <typedef-decl name='__int32_t' type-id='95e97e5e' id='33f57a65'/>
    <typedef-decl name='__uint32_t' type-id='f0981eeb' id='62f1140c'/>
    <typedef-decl name='__uint64_t' type-id='7359adad' id='8910171f'/>
    <class-decl name='iovec' size-in-bits='128' is-struct='yes' visibility='default' id='0f042891'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='iov_base' type-id='eaa32e2f' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iov_len' type-id='b59d7dce' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='size_t' type-id='7359adad' id='b59d7dce'/>
    <pointer-type-def type-id='0e01899c' size-in-bits='64' id='4d98cd5a'/>
    <pointer-type-def type-id='a84c031d' size-in-bits='64' id='26a90f95'/>
    <qualified-type-def type-id='a84c031d' const='yes' id='9b45d938'/>
    <pointer-type-def type-id='9b45d938' size-in-bits='64' id='80f4b756'/>
    <qualified-type-def type-id='eca1d791' const='yes' id='d2d03d88'/>
    <pointer-type-def type-id='d2d03d88' size-in-bits='64' id='7fd10606'/>
    <pointer-type-def type-id='d875fc4e' size-in-bits='64' id='80d5ec40'/>
    <pointer-type-def type-id='3250fbe0' size-in-bits='64' id='231998da'/>
    <pointer-type-def type-id='8ee50edc' size-in-bits='64' id='c53a950e'/>
    <pointer-type-def type-id='0f042891' size-in-bits='64' id='cc4b1be9'/>
    <pointer-type-def type-id='2ae61988' size-in-bits='64' id='b8e14bfe'/>
    <pointer-type-def type-id='ef0f6b10' size-in-bits='64' id='f8fcfe66'/>
    <pointer-type-def type-id='009d18d1' size-in-bits='64' id='ca0db7d5'/>
    <pointer-type-def type-id='6f4be8cf' size-in-bits='64' id='0c31978b'/>
    <pointer-type-def type-id='8694d961' size-in-bits='64' id='0d4ba885'/>
    <pointer-type-def type-id='149c6638' size-in-bits='64' id='8a121f49'/>
    <pointer-type-def type-id='8f92235e' size-in-bits='64' id='90421557'/>
    <pointer-type-def type-id='220c9082' size-in-bits='64' id='c4ba6c30'/>
    <pointer-type-def type-id='d7c60ba9' size-in-bits='64' id='91d0de51'/>
    <pointer-type-def type-id='91d0de51' size-in-bits='64' id='06ce3ba1'/>
    <pointer-type-def type-id='1b4dff91' size-in-bits='64' id='ea4b0ff5'/>
    <pointer-type-def type-id='69547f68' size-in-bits='64' id='715d4cd2'/>
    <pointer-type-def type-id='39e284c5' size-in-bits='64' id='5d58cff1'/>
    <pointer-type-def type-id='0282c3dd' size-in-bits='64' id='3dd6b921'/>
    <pointer-type-def type-id='48b5725f' size-in-bits='64' id='eaa32e2f'/>
    <pointer-type-def type-id='eaa32e2f' size-in-bits='64' id='63e171df'/>
    <pointer-type-def type-id='b3f6da27' size-in-bits='64' id='79c5fcaf'/>
    <pointer-type-def type-id='f0783229' size-in-bits='64' id='a5e666e1'/>
    <pointer-type-def type-id='83e62d3d' size-in-bits='64' id='00f2075d'/>
    <class-decl name='spdk_json_write_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='2ae61988'/>
    <class-decl name='spdk_thread' is-struct='yes' visibility='default' is-declaration-only='yes' id='ef0f6b10'/>
    <function-decl name='virtio_dev_construct' mangled-name='virtio_dev_construct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_construct'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='7fd10606' name='ops'/>
      <parameter type-id='eaa32e2f' name='ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_reset' mangled-name='virtio_dev_reset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_reset'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <parameter type-id='9c313c2d' name='req_features'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_start' mangled-name='virtio_dev_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_start'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='max_queues'/>
      <parameter type-id='149c6638' name='fixed_queue_num'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_destruct' mangled-name='virtio_dev_destruct' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_destruct'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_start' mangled-name='virtqueue_req_start' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_start'>
      <parameter type-id='91d0de51' name='vq'/>
      <parameter type-id='eaa32e2f' name='cookie'/>
      <parameter type-id='95e97e5e' name='iovcnt'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtqueue_req_flush' mangled-name='virtqueue_req_flush' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_flush'>
      <parameter type-id='91d0de51' name='vq'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_abort' mangled-name='virtqueue_req_abort' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_abort'>
      <parameter type-id='91d0de51' name='vq'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtqueue_req_add_iovs' mangled-name='virtqueue_req_add_iovs' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtqueue_req_add_iovs'>
      <parameter type-id='91d0de51' name='vq'/>
      <parameter type-id='cc4b1be9' name='iovs'/>
      <parameter type-id='149c6638' name='iovcnt'/>
      <parameter type-id='82458b79' name='desc_type'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_recv_pkts' mangled-name='virtio_recv_pkts' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_recv_pkts'>
      <parameter type-id='91d0de51' name='vq'/>
      <parameter type-id='63e171df' name='io'/>
      <parameter type-id='90421557' name='len'/>
      <parameter type-id='149c6638' name='nb_pkts'/>
      <return type-id='149c6638'/>
    </function-decl>
    <function-decl name='virtio_dev_acquire_queue' mangled-name='virtio_dev_acquire_queue' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_acquire_queue'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='index'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_find_and_acquire_queue' mangled-name='virtio_dev_find_and_acquire_queue' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_find_and_acquire_queue'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='start_index'/>
      <return type-id='3ff5601b'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_get_thread' mangled-name='virtio_dev_queue_get_thread' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_get_thread'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='index'/>
      <return type-id='f8fcfe66'/>
    </function-decl>
    <function-decl name='virtio_dev_queue_is_acquired' mangled-name='virtio_dev_queue_is_acquired' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_queue_is_acquired'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='index'/>
      <return type-id='c894953d'/>
    </function-decl>
    <function-decl name='virtio_dev_release_queue' mangled-name='virtio_dev_release_queue' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_release_queue'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='149c6638' name='index'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_read_dev_config' mangled-name='virtio_dev_read_dev_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_read_dev_config'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <parameter type-id='b59d7dce' name='offset'/>
      <parameter type-id='eaa32e2f' name='dst'/>
      <parameter type-id='95e97e5e' name='length'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_write_dev_config' mangled-name='virtio_dev_write_dev_config' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_write_dev_config'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <parameter type-id='b59d7dce' name='offset'/>
      <parameter type-id='eaa32e2f' name='src'/>
      <parameter type-id='95e97e5e' name='length'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_dev_stop' mangled-name='virtio_dev_stop' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_stop'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_set_status' mangled-name='virtio_dev_set_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_set_status'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <parameter type-id='b96825af' name='status'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-decl name='virtio_dev_get_status' mangled-name='virtio_dev_get_status' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_get_status'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <return type-id='b96825af'/>
    </function-decl>
    <function-decl name='virtio_dev_backend_ops' mangled-name='virtio_dev_backend_ops' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_backend_ops'>
      <parameter type-id='c4ba6c30' name='dev'/>
      <return type-id='7fd10606'/>
    </function-decl>
    <function-decl name='virtio_dev_dump_json_info' mangled-name='virtio_dev_dump_json_info' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_dev_dump_json_info'>
      <parameter type-id='c4ba6c30' name='hw'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <function-type size-in-bits='64' id='d875fc4e'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b59d7dce'/>
      <parameter type-id='eaa32e2f'/>
      <parameter type-id='95e97e5e'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='3250fbe0'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='9c313c2d'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='8ee50edc'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='95e97e5e'/>
    </function-type>
    <function-type size-in-bits='64' id='009d18d1'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='149c6638'/>
      <return type-id='149c6638'/>
    </function-type>
    <function-type size-in-bits='64' id='6f4be8cf'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='9c313c2d'/>
    </function-type>
    <function-type size-in-bits='64' id='8694d961'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='b96825af'/>
    </function-type>
    <function-type size-in-bits='64' id='1b4dff91'>
      <parameter type-id='c4ba6c30'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='69547f68'>
      <parameter type-id='c4ba6c30' name='hw'/>
      <parameter type-id='b8e14bfe' name='w'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='39e284c5'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='b96825af'/>
      <return type-id='48b5725f'/>
    </function-type>
    <function-type size-in-bits='64' id='0282c3dd'>
      <parameter type-id='c4ba6c30'/>
      <parameter type-id='91d0de51'/>
      <return type-id='48b5725f'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_pci.c' language='LANG_C99'>
    <class-decl name='virtio_pci_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7790783'/>
    <class-decl name='spdk_pci_addr' size-in-bits='64' is-struct='yes' visibility='default' id='ec72f59a'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='8f92235e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='bus' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='40'>
        <var-decl name='dev' type-id='b96825af' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='func' type-id='b96825af' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='virtio_pci_create_cb' type-id='9259a2b1' id='9d774d53'/>
    <pointer-type-def type-id='04b7c0a5' size-in-bits='64' id='9259a2b1'/>
    <pointer-type-def type-id='ec72f59a' size-in-bits='64' id='a714fad8'/>
    <pointer-type-def type-id='b7790783' size-in-bits='64' id='486c7873'/>
    <class-decl name='virtio_pci_ctx' is-struct='yes' visibility='default' is-declaration-only='yes' id='b7790783'/>
    <function-decl name='virtio_pci_dev_event_process' mangled-name='virtio_pci_dev_event_process' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_event_process'>
      <parameter type-id='95e97e5e' name='fd'/>
      <parameter type-id='149c6638' name='device_id'/>
      <return type-id='80f4b756'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_enumerate' mangled-name='virtio_pci_dev_enumerate' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_enumerate'>
      <parameter type-id='9d774d53' name='enum_cb'/>
      <parameter type-id='eaa32e2f' name='enum_ctx'/>
      <parameter type-id='149c6638' name='pci_device_id'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_attach' mangled-name='virtio_pci_dev_attach' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_attach'>
      <parameter type-id='9d774d53' name='enum_cb'/>
      <parameter type-id='eaa32e2f' name='enum_ctx'/>
      <parameter type-id='149c6638' name='device_id'/>
      <parameter type-id='a714fad8' name='pci_address'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-decl name='virtio_pci_dev_init' mangled-name='virtio_pci_dev_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_pci_dev_init'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='486c7873' name='pci_ctx'/>
      <return type-id='95e97e5e'/>
    </function-decl>
    <function-type size-in-bits='64' id='04b7c0a5'>
      <parameter type-id='486c7873'/>
      <parameter type-id='eaa32e2f'/>
      <return type-id='95e97e5e'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='virtio_user.c' language='LANG_C99'>
    <function-decl name='virtio_user_dev_init' mangled-name='virtio_user_dev_init' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='virtio_user_dev_init'>
      <parameter type-id='c4ba6c30' name='vdev'/>
      <parameter type-id='80f4b756' name='name'/>
      <parameter type-id='80f4b756' name='path'/>
      <parameter type-id='8f92235e' name='queue_size'/>
      <return type-id='95e97e5e'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
